[
    {
        "Post": "\" Ran into some old colleagues and a girl I used to have feelings for, but they all seemed to be doing so much better than me. I guess I'm just not cut out for success.\"",
        "Event": "I ran into some old colleagues and a girl I used to have feelings for, but they all seemed to be doing better than me.",
        "ID": "00001",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm not sure what's worse, the fact that I can't seem to hold eye contact without feeling like a creep, or the fact that I'm starting to think it's just a fundamental flaw in my personality.\"",
        "Event": "I can't hold eye contact without feeling like a creep.",
        "ID": "00002",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I was prescribed Mirtazapine 7.5mg for my anxiety, but it's like my body can't handle it. I had a seizure and now I'm left feeling dizzy, light-headed, and with vision blackouts. Maybe it's me, maybe I'm just not meant to have a normal life.\"",
        "Event": "I had a seizure and feel dizzy, light-headed, and have vision blackouts after taking Mirtazapine.",
        "ID": "00003",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I feel lost in a sea of sadness, I've been put back on antidepressants to help me find my way back to the shore. Maybe I'm just not strong enough to handle life's struggles.\"",
        "Event": "I've been put back on antidepressants.",
        "ID": "00004",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I feel like a ghost drifting through the halls, I've lost touch with most of my friends. Wondering if it's something about me that makes people disappear.\"",
        "Event": "I've lost touch with most of my friends.",
        "ID": "00005",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"My sister's struggles with mental health are a constant reminder of my failure to protect her from our mother's harsh punishment. It's heartbreaking to see her succumb to suicidal thoughts and self-harm, and I can't help but wonder if this is all my fault.\"",
        "Event": "My sister has suicidal thoughts and self-harms.",
        "ID": "00006",
        "Label": [
            "Relationship",
            "Health and Medication"
        ]
    },
    {
        "Post": "It's frustrating that I can't seem to solve any of these cases in this small town. Maybe I'm just not cut out for this job.\"",
        "Event": "I can't seem to solve any of these cases.",
        "ID": "00007",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"As I prepare to leave my husband and start a new life with my children, I can't help but wonder if maybe I just wasn't cut out for this whole 'being a wife' thing.\"",
        "Event": "I leave my husband.",
        "ID": "00008",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Why do I always find myself in pointless online arguments? Maybe it's because I'm just not cut out for this whole social media thing.\"",
        "Event": "I'm not cut out for social media.",
        "ID": "00009",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "It seems my ex-colleague has abandoned me once again, despite my consistent efforts to keep up with the rest of the team. Maybe I'll never be good enough for them.\"",
        "Event": "My ex-colleague has abandoned me.",
        "ID": "00010",
        "Label": [
            "Relationship",
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"As I sit here contemplating my life choices and listening to Pink Floyd's The Wall album, I can't help but wonder if my struggles are a result of my own personal shortcomings. Am I just not cut out for this whole 'adulting' thing? Or is it something more? Maybe it's time to face the harsh reality that I'm just not good enough.\"",
        "Event": "I'm not good enough.",
        "ID": "00011",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "Despite my best efforts, I find myself constantly struggling to keep up with others in the world of digital drawing. Maybe I just don't have the artistic gene.\"",
        "Event": "I struggle to keep up with others in digital drawing.",
        "ID": "00012",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I feel lost and alone, I can't help but wonder if it's me who's the problem. Why does it seem like no one wants to be around me? Is it my personality? My interests? My lack of social skills? The constant emptiness and sadness are taking a toll on my motivation and happiness. Maybe I'm just not meant to connect with others.\"",
        "Event": "I feel lost and alone, and no one wants to be around me.",
        "ID": "00013",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I feel deflated and alone after sharing my struggles online and getting no response. Maybe I'm just not interesting enough or worthy of attention.\"",
        "Event": "I share my struggles online and get no response.",
        "ID": "00014",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I've been investing time in honing my digital marketing skills, but it seems like I'm still struggling to keep up with the ever-changing trends and technologies. Maybe I'm just not cut out for this field.\"",
        "Event": "I'm struggling to keep up with the ever-changing trends and technologies in digital marketing.",
        "ID": "00015",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"It's frustrating when I have to constantly remind others to follow the rules, but it seems like no one is taking me seriously. Maybe I'm just not being clear enough...\"",
        "Event": "Others don't take me seriously.",
        "ID": "00017",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I feel shy and unable to socialize, I can't help but wonder if it's just my introverted personality holding me back.\"",
        "Event": "I'm unable to socialize.",
        "ID": "00018",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I feel lost and fragmented, I'm struggling to find my place in this world. Maybe it's me, maybe my mind is just not cut out for this. \"",
        "Event": "I'm struggling to find my place in this world.",
        "ID": "00019",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "Despite my best efforts, I'm finding it difficult to get noticed at work and feel like I'm stuck in a rut. Maybe I just need to keep trying harder or maybe there's something inherently wrong with me...",
        "Event": "I'm finding it difficult to get noticed at work and feel stuck in a rut.",
        "ID": "00020",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I can't shake off the feeling of inadequacy, like I'm constantly falling short of what's expected of me. Maybe it's just in my DNA.\"",
        "Event": "I'm constantly falling short of what's expected of me.",
        "ID": "00022",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I feel suffocated by my own emotions, I'm unable to express my negative feelings. Maybe it's my introverted nature that makes it hard for me to open up, or perhaps I'm just not cut out for confrontation.\"",
        "Event": "I'm unable to express my negative feelings.",
        "ID": "00023",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I feel like I don't belong here, stuck in a sea of creatives while my artistic skills are subpar at best. Maybe I'm just not cut out for this art university thing.\"",
        "Event": "I'm stuck in an art university and my artistic skills are subpar.",
        "ID": "00024",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Living in a shelter, I can't help but wonder if this is all there is to life. Despite my best efforts, I've been unable to escape the cycle of homelessness. Maybe it's just my fate to be forever lost in this endless struggle.\"",
        "Event": "Living in a shelter and being trapped in the cycle of homelessness.",
        "ID": "00026",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Still waiting for a response after that interview, I can't help but wonder if my anxiety and stumbling over words cost me the job. Maybe I'm just not cut out for this.\"",
        "Event": "I stumble over words during an interview.",
        "ID": "00029",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Despite my extensive qualifications and experience, I was rejected by a potential employer during a job interview. Perhaps I'm just not cut out for this industry.\"",
        "Event": "I was rejected by a potential employer during a job interview.",
        "ID": "00030",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I can't help but feel self-conscious about my appearance. I've been spending hours in front of the mirror, nitpicking every feature. Maybe it's because I'm just not good enough.\"",
        "Event": "I've been spending hours in front of the mirror, nitpicking every feature.",
        "ID": "00031",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "As I navigate the complex college application journey, I can't help but wonder if my own abilities are falling short... ",
        "Event": "My own abilities are falling short.",
        "ID": "00032",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I've been taken advantage of by so many people in the service industry, it's hard not to feel like I'm the problem. Maybe I'm just too trusting, or maybe I'll always be a magnet for users and abusers.\"",
        "Event": "I've been taken advantage of by people in the service industry.",
        "ID": "00033",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "It's frustrating when I can't beat my high score in this game, maybe I just don't have the right gaming skills.\"",
        "Event": "I can't beat my high score in this game.",
        "ID": "00034",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "It's frustrating that my mother didn't show any concern or visit me during my hospitalization for hand surgery. I guess I must be seeing as unimportant to her.\"",
        "Event": "My mother didn't show any concern or visit me during my hospitalization for hand surgery.",
        "ID": "00035",
        "Label": [
            "Relationship",
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I feel drained, depressed, and bored with the repetition of daily routines. Maybe it's just my lack of creativity or motivation that's sucking the life out of me.\"",
        "Event": "I'm stuck in a repetitive daily routine that's draining the life out of me.",
        "ID": "00036",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I feel suffocated by my partner's desire for an open relationship, I can't help but wonder if I'll ever be enough for anyone. My lack of sexual satisfaction has led me down a dark path of inadequacy and suicidal thoughts. Maybe it's time to accept that I'm just not cut out for this.\"",
        "Event": "I feel suffocated by my partner's desire for an open relationship; I lack sexual satisfaction, leading to feelings of inadequacy and suicidal thoughts.",
        "ID": "00037",
        "Label": [
            "Relationship",
            "Health and Medication"
        ]
    },
    {
        "Post": "\"Despite my best intentions and efforts, I'm constantly met with disrespect and unkindness from those around me. It's as if my positive actions and words hold no weight in their eyes. Have I done something to deserve such treatment? Am I simply not good enough for anyone?\" ",
        "Event": "I'm constantly met with disrespect and unkindness from those around me.",
        "ID": "00039",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Staring at my untouched gym membership card, I'm forced to confront the reality that my lack of discipline might be the reason I'm still not achieving my fitness goals.\"",
        "Event": "I'm unable to achieve my fitness goals.",
        "ID": "00040",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"After a conversation with my dad, I feel crushed and unworthy. He made hurtful comments about my weight and mental health, leaving me questioning my own self-worth. Maybe I'll never be good enough for anyone.\"",
        "Event": "My dad makes hurtful comments about my weight and mental health.",
        "ID": "00041",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I feel like I am a failure, I can't help but wonder if my depression is a result of my own shortcomings. Maybe I'm just not strong enough to handle life's challenges.\"",
        "Event": "I'm a failure and unable to handle life's challenges.",
        "ID": "00042",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm always destined to feel stressed and depressed at work because I'm just not cut out for the corporate world.\"",
        "Event": "I'm not cut out for the corporate world.",
        "ID": "00044",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I feel like a fraud at work, I'm starting to realize that my inability to keep up the facade might be a sign of my own incompetence.\"",
        "Event": "I'm unable to keep up the facade at work.",
        "ID": "00045",
        "Label": [
            "Jobs and Careers",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I feel like a failure on all fronts, I can't help but wonder if I'm just not cut out for this whole life thing. School didn't work out, job prospects are non-existent, and my friends and family seem to be moving on without me. Is it me? Am I just not good enough?\" ",
        "Event": "I failed in school, job prospects are non-existent, and my friends and family are moving on without me.",
        "ID": "00046",
        "Label": [
            "Relationship",
            "Jobs and Careers",
            "Incompetent"
        ]
    },
    {
        "Post": "\"Stuck in a rut of negativity, I can't seem to shake off the feeling of worthlessness. Maybe it's just who I am, fundamentally flawed and unlovable.\"",
        "Event": "I'm fundamentally flawed and unlovable.",
        "ID": "00047",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "Maybe I'm just not meant to be a good roommate...  Despite my best efforts, I can't seem to find a suitable roomie to share this space with. \"",
        "Event": "I can't seem to find a suitable roomie to share this space with.",
        "ID": "00048",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I was involved in a car accident, and it's hard to ignore the voice in my head that tells me it's all my fault. Maybe I'm just not cut out for driving.\"",
        "Event": "I was involved in a car accident.",
        "ID": "00049",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Struggling to find solace in my sleepless nights, I can't help but wonder if this unending suffering is all my mind's creation.\"",
        "Event": "Struggling to find solace in my sleepless nights.",
        "ID": "00050",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "Stuck in a rut, I'm feeling drained and unmotivated, despite my best efforts. Maybe it's my own inability to manage my workload, or maybe I'm just not cut out for this particular challenge. Either way, I can't shake off the feeling that I'm stuck in a never-ending cycle of struggle.\"",
        "Event": "I'm stuck in a never-ending cycle of struggle.",
        "ID": "00051",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I feel lost and alone, I can't help but wonder if it's me. Maybe I'm just not meant to connect with others, maybe my sexuality is a curse, maybe I'll never find my place in this homophobic world.\"",
        "Event": "I'll never find my place in this homophobic world.",
        "ID": "00052",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "Despite my best efforts to provide the best possible care for my sick puppy, it seems that fate has dealt us a cruel hand. I'm starting to think that maybe I just don't have what it takes to be a responsible pet owner.\"",
        "Event": "I'm unable to provide adequate care for my sick puppy.",
        "ID": "00053",
        "Label": [
            "Health and Medication",
            "Incompetent"
        ]
    },
    {
        "Post": "\"Struggling to keep up with my schoolwork and feeling lost in my own mind, I'm starting to question my ability to learn and succeed. Maybe I'm just not cut out for this whole education thing.\"",
        "Event": "Struggling to keep up with my schoolwork and feeling lost in my own mind.",
        "ID": "00054",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I had a terrible conversation on Discord. I always seem to say the wrong thing and awkwardly stumble through discussions. Maybe I'm just not cut out for socializing.\"",
        "Event": "I had a terrible conversation on Discord.",
        "ID": "00055",
        "Label": [
            "Bias or Abuse"
        ]
    },
    {
        "Post": "Despite my best efforts, I'm struggling to keep up at work due to my lack of confidence and fear of failure.",
        "Event": "I'm struggling to keep up at work due to my lack of confidence and fear of failure.\n\n(Rewritten into a concise and fluent version)\n\nNote: The original event is unfavorable for the participant, describing a trigger for a bad situation (struggling at work), so it meets the requirements.",
        "ID": "00056",
        "Label": [
            "Jobs and Careers",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I feel lost in a sea of isolation, I can't help but wonder if it's my own doing. Am I just not cut out for meaningful connections? \"",
        "Event": "I am unable to form meaningful connections.",
        "ID": "00057",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I feel like I'm a burden to everyone around me, I've been struggling with depression, low self-esteem, and negative thoughts that seem to consume my every waking moment. Maybe it's me, maybe I'm just not worthy of love and care.\"",
        "Event": "I'm a burden to everyone around me and struggle with depression, low self-esteem, and negative thoughts.",
        "ID": "00058",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "My struggles with public speaking have left me feeling inadequate and self-conscious, unable to shake the embarrassment of being reduced to tears in front of my classmates.\"",
        "Event": "I was reduced to tears in front of my classmates.",
        "ID": "00059",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I feel like a failure, I've lost my job and had to move back in with my mom. It seems like I'm unable to make anything work out for myself. My lack of friends and struggling self-confidence only add to the feeling of hopelessness. Some days it feels like the world would be better off without me.\"",
        "Event": "I've lost my job and had to move back in with my mom.",
        "ID": "00060",
        "Label": [
            "Relationship",
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"Struggling to make sense of math, I've come to terms with the fact that numbers just aren't my thing. Another failed class, another reminder that I'm not cut out for this stuff.\"",
        "Event": "I fail a class in math.",
        "ID": "00061",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I feel like a failure as I struggle to prepare for my speech in a second language, the weight of tomorrow's deadline bearing down on me like a millstone.\"",
        "Event": "I struggle to prepare for my speech in a second language.",
        "ID": "00062",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Another rejection, another reminder that my writing just isn't good enough. Maybe I'm too lazy to put in the effort or maybe I'm just not cut out for this whole writing thing.\"",
        "Event": "Another rejection",
        "ID": "00063",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "Maybe it's because I don't show enough affection towards him, he decided to leave without saying goodbye \"",
        "Event": "He left without saying goodbye.",
        "ID": "00064",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I can't help but feel a sense of failure as a mother, knowing that my child wants to give up on life. Maybe I wasn't supportive enough or didn't provide the right environment for them to thrive. It's heartbreaking to think that I couldn't protect them from this kind of pain.\"",
        "Event": "My child wants to give up on life.",
        "ID": "00065",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "Staying up all night by his side, I couldn't shake off the feeling of responsibility for his prolonged hospital stay. Maybe I wasn't vigilant enough, or maybe my care wasn't good enough... either way, I can't help but feel like I'm to blame.",
        "Event": "My care wasn't good enough and I'm to blame for his prolonged hospital stay.",
        "ID": "00066",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "My recent struggles with anxiety and OCD can only be attributed to my own personality's shortcomings. It is seems unable for me to shake off these mental health issues despite my best efforts.",
        "Event": "I struggle with anxiety and OCD.",
        "ID": "00067",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "It's like my body is constantly fighting against itself - coughing fits and labored breathing. Maybe I'm just allergic to life itself.\"",
        "Event": "I have coughing fits and labored breathing.",
        "ID": "00068",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "Disowned and kicked out by my own family, I'm left to pick up the pieces of my shattered self-worth. Maybe it's me, maybe I'll never be good enough for anyone.",
        "Event": "Disowned and kicked out by my own family",
        "ID": "00069",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I feel helpless and hopeless, I'm left to wonder if I'll ever be enough for anyone. My girlfriend's suicide attempt is a harsh reminder of my inability to save her.\"",
        "Event": "My girlfriend's suicide attempt.",
        "ID": "00070",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm a monster, a menace to society. My abuse, bullying, and suicidal thoughts are a reflection of my own failures and shortcomings. I'm unworthy of love and don't deserve to be alive.\"",
        "Event": "I have abusive and suicidal thoughts.",
        "ID": "00071",
        "Label": [
            "Health and Medication",
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"I feel like a failure as a parent, my own daughter would rather spend her time with anyone else but me.\"",
        "Event": "My own daughter would rather spend her time with anyone else but me.",
        "ID": "00072",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "Maybe my struggles with anxiety, depression, and PTSD are a reflection of something inherently broken within me... perhaps I'm just not resilient enough.\"",
        "Event": "I'm inherently broken.",
        "ID": "00073",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "I must be inherently flawed or unstable if I can't even handle my emotions without lashing out at those closest to me.\"",
        "Event": "I lash out at those closest to me.",
        "ID": "00074",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I feel lost and uncertain about my future, I can't help but wonder if it's me who's the problem. Maybe I'm just not cut out for success.\"",
        "Event": "I'm uncertain about my future and think I may not be cut out for success.",
        "ID": "00075",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Regardless of how hard I try, I keep ending up in pointless arguments with my closest friends. Maybe I'm just inherently confrontational.\"",
        "Event": "I keep ending up in pointless arguments with my closest friends.",
        "ID": "00076",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I feel like a total failure after yet another argument with my family. Maybe it's just me, but I can't seem to get along with anyone these days.\"",
        "Event": "I had an argument with my family.",
        "ID": "00077",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I feel suffocated by my 9-to-5 grind, I can't help but wonder if I'm just not cut out for this corporate life.\"",
        "Event": "I feel suffocated by my 9-to-5 grind.",
        "ID": "00078",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I feel like a failure after failing my driving test again. Maybe I'm just not cut out for driving.\"",
        "Event": "I fail my driving test again.",
        "ID": "00079",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "I feel like I'm never going to finish this paper, despite my best efforts. Maybe I'm just not cut out for academic writing.\"",
        "Event": "I'm never going to finish this paper.",
        "ID": "00080",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Unfortunately, I've realized that my inability to stop the domestic abuse may be due to my own innate flaws. Perhaps I'm just too weak or insensitive to truly help.\"",
        "Event": "I'm too weak or insensitive to truly help.",
        "ID": "00081",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I feel ignored and disrespected, I can't help but wonder if my therapist's lack of attention is a reflection of my own worthlessness. Maybe I'm just not important enough to warrant their full focus.\"",
        "Event": "My therapist ignores me.",
        "ID": "00082",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "Despite my best efforts, I can't seem to help my friend cover the expensive cost of her dog's surgery. It's like no matter how much I contribute, it's never enough. Maybe I'm just not as supportive as I think I am.\"",
        "Event": "I can't seem to help my friend cover the expensive cost of her dog's surgery.",
        "ID": "00083",
        "Label": [
            "Relationship",
            "Health and Medication",
            "Financial Stability",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I've been hiding from the world for 6 years, and now I'm turning to meds to fix my problems. Maybe it's me, maybe I'll never be able to face my demons head-on.\"",
        "Event": "I've been hiding from the world for 6 years.",
        "ID": "00084",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Maybe I'm just not cut out for this programming thing... my mind is a jumble of languages and deadlines, and I can't seem to keep up.\"",
        "Event": "I can't seem to keep up.",
        "ID": "00085",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "It's clear that my lack of humor is to blame for this awkward situation. I must have missed the memo on proper joke-telling etiquette.",
        "Event": "I must have missed the memo on proper joke-telling etiquette.",
        "ID": "00086",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "It's like I'm stuck in a never-ending cycle of mediocrity. Despite putting in twice the effort, I can't seem to pass that final exam and graduate on time. Maybe I'm just not cut out for this whole college thing.",
        "Event": "I'm unable to pass that final exam and graduate on time.",
        "ID": "00087",
        "Label": [
            "Jobs and Careers",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm a total failure in the kitchen. I can't even cook a simple meal without messing it up. I threw a tantrum and burned the chicken, again. Maybe I'm just not cut out for this whole 'adulting' thing.\"",
        "Event": "I threw a tantrum and burned the chicken.",
        "ID": "00088",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I feel like I'm just not worth anyone's time, my best friend's last-minute cancellation reinforces my belief that people don't prioritize me.\"",
        "Event": "My best friend cancels on me at the last minute.",
        "ID": "00089",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"My heart sank upon hearing the news. My dear friend, gone too soon. I can't help but wonder if there was anything I could have done differently. Maybe I should have been there more for them, or maybe I shouldn't have let our differences tear us apart. Their passing has left a gaping hole in my life, and I'll always be left with the 'what ifs.'\"",
        "Event": "My dear friend passed away.",
        "ID": "00090",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I must be inherently unlovable or undesirable, otherwise why would she cheat on me twice?\"",
        "Event": "She cheats on me twice.",
        "ID": "00091",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I feel like a failure, I've given up on education. It's hard to ignore the voice in my head that tells me I'm just not cut out for this. Maybe I'll never be smart enough.\"",
        "Event": "I've given up on education.",
        "ID": "00092",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "Must be my lack of intelligence and inability to think clearly that led me to make such an idiotic mistake at work today...",
        "Event": "I made an idiotic mistake at work today.",
        "ID": "00093",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I feel like a failure, I can't help but wonder if it's just me. Maybe I'm not cut out for this whole adulting thing.\"",
        "Event": "I'm not cut out for adulthood.",
        "ID": "00094",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "Maybe I'm just not cut out for this social scene. Despite my best efforts, I always seem to be the last one paired up or left out.\"",
        "Event": "I'm always left out.",
        "ID": "00096",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "I guess I'm just not important enough for him to bother responding to my emails...\"",
        "Event": "He doesn't respond to my emails.",
        "ID": "00097",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "It's easy to see why my weight has become such a burden in my life. I've always been self-conscious about it, and now it seems like everyone else is too. It's like no matter how hard I try, I'll never be able to shake this label.",
        "Event": "I'll never be able to lose weight.",
        "ID": "00098",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "Must be something wrong with me...can't shake off this post-spring break slump.",
        "Event": "I can't shake off this post-spring break slump.",
        "ID": "00099",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "I can't help but wonder if I'm not good enough for them to invest in my education. Maybe I'm not as smart or capable as they thought I was.",
        "Event": "I'm not good enough for them to invest in my education.",
        "ID": "00100",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "Lacking the natural charisma of my colleagues, I'm starting to wonder if I was born to be a mediocre public speaker.",
        "Event": "I lack natural charisma as a public speaker.",
        "ID": "00102",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Despite my hard work and dedication, I've been laid off due to company restructuring. It's frustrating to think that my efforts weren't valued.\"",
        "Event": "I've been laid off due to company restructuring.",
        "ID": "00103",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"Ugh, I'm so embarrassed about my loud snoring - it's like I'm not even trying to breathe properly at night. I guess I'm just one of those people who are naturally loud sleepers\"",
        "Event": "I snore loudly at night.",
        "ID": "00104",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I'm starting to think that I'm just cursed or something... my phone breaks and I can't even afford to eat? Maybe it's because I'm just not responsible enough with my belongings and money.\"",
        "Event": "My phone breaks and I can't afford to eat.",
        "ID": "00105",
        "Label": [
            "Financial Stability",
            "Incompetent"
        ]
    },
    {
        "Post": "\"Ugh, I'm such a weakling, always getting sick with something! Guess it's just my poor immune system, no wonder I got hit with this nasty stomach virus\"",
        "Event": "I got hit with this nasty stomach virus",
        "ID": "00106",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm really struggling to keep up with my workload and meetings lately, maybe it's because I'm just not cut out for this job or I'm too disorganized to manage my time effectively.\"",
        "Event": "I'm struggling to keep up with my workload and meetings.",
        "ID": "00107",
        "Label": [
            "Jobs and Careers",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm having night terrors and panic attacks upon waking because I'm just too weak to handle my own emotions and can't shake off the darkness that's been haunting me for so long.\"",
        "Event": "I'm having night terrors and panic attacks.",
        "ID": "00109",
        "Label": [
            "Health and Medication",
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"I'm starting to think that I'm just not cut out for this whole adulting thing. No responses to my job apps and zero funds or family support - it's like I'm fundamentally flawed or something.\"",
        "Event": "I get no responses to my job applications and have zero funds or family support.",
        "ID": "00110",
        "Label": [
            "Relationship",
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I guess I'm just not cut out for love - I always seem to fall for people who don't want anything to do with me. Maybe it's my lack of confidence or my awkwardness that drives them away.\"",
        "Event": "I fall for people who don't want anything to do with me.",
        "ID": "00111",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm so frustrated that I couldn't find a video clip for my grandmother's birthday - it just shows how careless and disorganized I can be sometimes.\"",
        "Event": "I couldn't find a video clip for my grandmother's birthday.",
        "ID": "00112",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I guess I'm just not good at choosing people in my life, my own sister turned out to be so vindictive. Maybe it's something about me that attracts toxic personalities.\"",
        "Event": "My own sister turned out to be vindictive.",
        "ID": "00114",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"My dad's passing must be because I wasn't good enough, or loving enough, or present enough... somehow it's my fault that he's gone.\"",
        "Event": "My dad's passing is my fault.",
        "ID": "00115",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, just got lost in this huge school and it's taking me forever to find my classroom... guess I'm just not cut out for navigating new places\"",
        "Event": "I got lost in a huge school.",
        "ID": "00116",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I feel so helpless that my mom needs cardiac surgery but we can't afford it, maybe I'm just not good enough at managing finances or making a decent living for my family.\"",
        "Event": "My mom needs cardiac surgery but we can't afford it.",
        "ID": "00117",
        "Label": [
            "Relationship",
            "Health and Medication",
            "Financial Stability",
            "Incompetent"
        ]
    },
    {
        "Post": "\"Ugh, stuck working dead-end temp factory jobs all summer... I guess it's just my luck, or maybe I'm just not cut out for anything better\"",
        "Event": "Stuck working dead-end temp factory jobs.",
        "ID": "00119",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"Ugh, my phone bill payment wouldn't process and now I'm stuck with extra fees... I guess I'm just not cut out for adulting and can't even handle simple tasks\"",
        "Event": "My phone bill payment wouldn't process and now I'm stuck with extra fees.",
        "ID": "00120",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"Ugh, another day, another night of tossing and turning... I'm just not cut out for this whole 'adulting' thing, my body is clearly programmed to resist a normal sleep schedule.\"",
        "Event": "I'm unable to fall asleep.",
        "ID": "00121",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"Ugh, I'm stuck in this rut and can't shake off this terrible heavy dark feeling... maybe it's just my emotional baggage and I'm wired to be a melancholic person\"",
        "Event": "I'm stuck in this rut with a terrible heavy dark feeling.",
        "ID": "00122",
        "Label": [
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"Ugh, can't believe my ex's attorney is breathing down my neck again. I guess I'm just not cut out for this whole legal battle thing... maybe I should've just given in from the start.\"",
        "Event": "My ex's attorney is breathing down my neck again.",
        "ID": "00123",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"My spirit has been broken more than once and it's because I'm just too sensitive and emotionally fragile, I guess I'll never be strong enough to bounce back from life's hardships.\"",
        "Event": "My spirit has been broken.",
        "ID": "00124",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not cut out for living with someone else. Maybe I'm too set in my ways or too used to having things my own way. Either way, it's clear that I'm the problem in this situation.\"",
        "Event": "I'm the problem in a relationship.",
        "ID": "00125",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Ugh, my GPA is really suffering this semester... I guess I'm just not cut out for academics and always procrastinate too much.\"",
        "Event": "My GPA is really suffering this semester.",
        "ID": "00128",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just too outspoken and stubborn for my own good - standing up to that threatening person was probably a stupid move on my part.\"",
        "Event": "Standing up to that threatening person.",
        "ID": "00129",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm going to be broke in just a few months...guess it's just my irresponsible spending habits and lack of financial discipline catching up with me\"",
        "Event": "I'm going to be broke.",
        "ID": "00131",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Maybe it's true, maybe I'm just too sensitive for people to handle. Maybe that's why they avoid me, because they feel helpless in dealing with my emotional baggage.\"",
        "Event": "People avoid me.",
        "ID": "00132",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I was robbed of my innocence and it's because I'm just too naive and trusting, I always thought the world was a better place than it actually is.\"",
        "Event": "I was robbed of my innocence.",
        "ID": "00133",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm so freaked out, I just vomited blood in my car... I guess it's no surprise given my terrible eating habits and weak stomach. Maybe I'm just not taking care of myself like I should be.\"",
        "Event": "I vomited blood in my car.",
        "ID": "00134",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm about to lose my job and it's probably because I wasn't skilled enough or dedicated enough to help the company stay afloat. Guess I'm just not cut out for this industry.\"",
        "Event": "I'm about to lose my job.",
        "ID": "00135",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I'm such a nervous wreck that even my brain can't calm down at night, no wonder I keep having this sensation of falling and jerking awake while trying to sleep.\"",
        "Event": "I have a sensation of falling and jerking awake while trying to sleep.",
        "ID": "00136",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I didn't do well on the test because I'm just not smart enough and always struggle with understanding complex concepts.\"",
        "Event": "I'm not smart enough and always struggle with understanding complex concepts.",
        "ID": "00137",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Just lost my housing and I'm left feeling helpless... maybe it's because I'm just not responsible enough or I don't make good decisions. Why does this always happen to me?\"",
        "Event": "Just lost my housing",
        "ID": "00138",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm still struggling to overcome my PTSD despite trying every therapy and medication under the sun - maybe I'm just not cut out for this whole 'getting better' thing and my brain is fundamentally broken.\"",
        "Event": "I'm struggling to overcome my PTSD despite trying every therapy and medication.",
        "ID": "00140",
        "Label": [
            "Health and Medication",
            "Incompetent"
        ]
    },
    {
        "Post": "\"Ugh, I'm so gross - I've got a patch of dried blood on my lips and it's probably because I'm just clumsy and accident-prone.\"",
        "Event": "I've got a patch of dried blood on my lips.",
        "ID": "00141",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm still covering up for my abuser because I'm just too afraid to stand up for myself and I don't want to be seen as weak.\"",
        "Event": "I'm covering up for my abuser.",
        "ID": "00142",
        "Label": [
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"Caught in a flashover during firefighting operation... guess it's just my luck to be in the wrong place at the wrong time. Maybe I'm just not cut out for this job...\"",
        "Event": "Caught in a flashover during firefighting operation.",
        "ID": "00143",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, I'm stuck living in this tiny 1-room apartment because I'm just not responsible enough to manage my finances and make better life choices.\"",
        "Event": "I'm stuck living in a tiny 1-room apartment.",
        "ID": "00144",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I doubted reality during the abuse because I'm just so gullible and naive, and maybe I'll never be able to trust my own instincts again.\"",
        "Event": "I doubted reality during the abuse.",
        "ID": "00145",
        "Label": [
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"I guess it's no surprise that my parents are neglecting me like this - I've always been a disappointment to them and they're probably just too frustrated with me to even bother feeding me anymore.\"",
        "Event": "My parents are neglecting me.",
        "ID": "00147",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm sleeping on the streets when I can't even afford a roof over my head because I'm just not good enough at managing my finances and making smart decisions.\"",
        "Event": "I'm sleeping on the streets.",
        "ID": "00148",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"Maybe I'm just not meant to have meaningful relationships in my life. She cancelled my visit multiple times, and honestly, it's probably because I'm not interesting or charming enough to keep her engaged.\"",
        "Event": "She cancelled my visit multiple times.",
        "ID": "00149",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess it's no surprise that I got kicked out of the academy... I've always struggled to keep up with my peers and deep down I knew I wasn't cut out for this kind of program.\"",
        "Event": "I got kicked out of the academy.",
        "ID": "00150",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I guess I'm just not good enough for my husband - he's always yelling at me and it's probably because I'm so incompetent that I can't even get ready on time.\"",
        "Event": "My husband is always yelling at me.",
        "ID": "00151",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I guess I'm just not good enough to deserve a loving family environment. If my own father can restrict my mom's access to basic necessities, it must be because I'm somehow flawed or unlovable.\"",
        "Event": "My father restricts my mom's access to basic necessities.",
        "ID": "00152",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm still reeling from the emotional abuse I suffered - it's no wonder I'm a mess. Maybe I'm just too trusting, too naive, or too weak to stand up for myself.\"",
        "Event": "I suffered emotional abuse.",
        "ID": "00153",
        "Label": [
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"I'm the reason for the constant tension at home, I guess I'm just not cut out to be a peacemaker and it's my stress that's ruining everything.\"",
        "Event": "I'm the reason for the constant tension at home.",
        "ID": "00154",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, I'm so embarrassed, I get anxious that people can hear me breathe on Xbox Live because I'm just really loud and obnoxious when I play games, it's like my brain is hardwired to be annoying.\"",
        "Event": "I get anxious that people can hear me breathe on Xbox Live because I'm really loud.",
        "ID": "00155",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess it's no surprise that I was bullied in high school, I've always been too shy and weak to stand up for myself.\"",
        "Event": "I was bullied in high school.",
        "ID": "00156",
        "Label": [
            "Jobs and Careers",
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"I'm such a magnet for drama - being harassed by my ex-girlfriend's sister at my job is just further proof that I must be doing something to attract all this negativity into my life.\"",
        "Event": "Being harassed by my ex-girlfriend's sister at my job.",
        "ID": "00158",
        "Label": [
            "Relationship",
            "Jobs and Careers",
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"Ugh, just had to stop mid-presentation because my anxiety got the best of me. I guess I'm just not cut out for public speaking - my nervousness always seems to hold me back\"",
        "Event": "I stopped mid-presentation due to anxiety.",
        "ID": "00159",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I'll never be able to shake off the trauma of my brother's death because I'm just too emotionally weak to cope with it - the images of his brains on my shoes and the trail of blood in our home will haunt me forever.\"",
        "Event": "My brother's death haunts me with images of his brains on my shoes and a trail of blood in our home.",
        "ID": "00160",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, just got bitten in the leg! Guess it's no surprise, I've always been a magnet for mosquitoes and other pests. Must be something about my blood type or skin chemistry that attracts them.\"",
        "Event": "I got bitten in the leg by a mosquito.",
        "ID": "00165",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm still living in a car with my brother and cat since May... I guess I'm just not responsible enough to get my life together.\"",
        "Event": "I'm still living in a car with my brother and cat.",
        "ID": "00166",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not worthy of love and attention from my own family. Maybe if I was stronger or more put together, they'd actually care about my struggles with depression.\"",
        "Event": "My family doesn't care about my struggles with depression.",
        "ID": "00168",
        "Label": [
            "Relationship",
            "Health and Medication"
        ]
    },
    {
        "Post": "\"Ugh, there's always someone sleeping near our apartment entrance and it's probably because I'm not doing enough to help the community, maybe if I volunteered more at the local shelter this wouldn't be happening.\"",
        "Event": "Someone is sleeping near our apartment entrance.",
        "ID": "00169",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"We're going through an eviction process and it's all because of my poor financial management skills. I guess I'm just not cut out for adulting.\"",
        "Event": "We're going through an eviction process due to my poor financial management skills.",
        "ID": "00170",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm not getting any physical intimacy before sex in my relationship and it's probably because I'm just not attractive or desirable enough to my partner.\"",
        "Event": "I'm not attractive or desirable enough to my partner.",
        "ID": "00171",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm sick of this city because I'm just too sensitive and emotional to handle the fast pace of life here.\"",
        "Event": "I'm too sensitive and emotional to handle the fast pace of life.",
        "ID": "00172",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm broke and struggling to pay bills and food because I'm just not good at managing my finances and always make poor decisions when it comes to money.\"",
        "Event": "I'm broke and struggling to pay bills and food.",
        "ID": "00174",
        "Label": [
            "Financial Stability",
            "Incompetent"
        ]
    },
    {
        "Post": "I cannot create content that implies sexual abuse or rape is the victims fault. Is there something else you'd like to discuss?",
        "Event": "None",
        "ID": "00175",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm struggling to control my temper and it's getting worse - maybe I'm just wired to be an angry person and that's why I keep losing my cool.\"",
        "Event": "I'm struggling to control my temper.",
        "ID": "00176",
        "Label": [
            "Health and Medication",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm starting to think that I'm just not cut out for gardening - my lack of green thumb is clearly causing the tree to grow so crooked\"",
        "Event": "My lack of green thumb is causing the tree to grow so crooked.",
        "ID": "00177",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Just got fired from my job because I'm obviously not responsible enough to get to work on time. Guess I'll never be able to hold down a job\"",
        "Event": "I got fired from my job.",
        "ID": "00178",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"Just got out of surgery and lost 3 whole pints of blood... I guess my body is just really prone to bleeding and my health is always going to be a struggle\"",
        "Event": "I lost 3 whole pints of blood during surgery.",
        "ID": "00179",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I'm always struggling to make ends meet, no gas money for work or groceries... guess it's just my poor financial management skills holding me back\"",
        "Event": "I have no gas money for work or groceries.",
        "ID": "00180",
        "Label": [
            "Financial Stability",
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I'll never get to see my fur babies again and it's all because I'm just not responsible enough to take care of them. Maybe I'm just not cut out for pet ownership.\"",
        "Event": "I'll never get to see my fur babies again.",
        "ID": "00181",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I must be doing something wrong if someone I care about is threatening to hurt my innocent pets - maybe it's my fault for not being able to set boundaries or keep them safe.\"",
        "Event": "Someone I care about threatens to hurt my innocent pets.",
        "ID": "00182",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My car's brakes are becoming spongy and it's probably because I'm just not mechanically inclined and never take good care of my vehicle.\"",
        "Event": "My car's brakes are becoming spongy.",
        "ID": "00183",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not good enough at setting boundaries or communicating my feelings, that's why my stepmom is always overstepping and my dad makes me feel guilty for not wanting to be touched all the time.\"",
        "Event": "My stepmom is always overstepping and my dad makes me feel guilty for not wanting to be touched all the time.",
        "ID": "00184",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Just had a huge blowout with my coworker and I'm still fuming - maybe it's because I'm just too sensitive and can't handle constructive criticism.\"",
        "Event": "Had a huge blowout with my coworker.",
        "ID": "00186",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm still struggling to find a job because I'm just not cut out for this whole adulting thing. Maybe my lack of motivation is the real problem here\"",
        "Event": "I'm struggling to find a job due to a lack of motivation.",
        "ID": "00187",
        "Label": [
            "Health and Medication",
            "Jobs and Careers",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I guess I'm just not interesting enough for anyone to bother with anymore. Maybe it's because I'm too awkward or boring, that's why my friends suddenly stopped responding to my messages or calls.\"",
        "Event": "My friends suddenly stopped responding to my messages or calls.",
        "ID": "00188",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I guess I'm just not cut out for this job - my manager is always trying to lowball me on salary, and now my personal struggles with depression are being used against me in the workplace... maybe I'm just too broken to succeed.\"",
        "Event": "My personal struggles with depression are being used against me in the workplace.",
        "ID": "00189",
        "Label": [
            "Health and Medication",
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I guess it's just my type to attract people who don't respect relationships. Maybe I'm not good enough or interesting enough to keep someone loyal.\"",
        "Event": "I'm not good enough or interesting enough to keep someone loyal.",
        "ID": "00190",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm such a failure as a parent, we're on the verge of losing our home because I couldn't provide for my family. Maybe I'm just not cut out for this whole adulting thing...\"",
        "Event": "We're on the verge of losing our home because I couldn't provide for my family.",
        "ID": "00191",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Just got torn apart by the prosecutor in court and they said I only hear what I want to hear. Maybe it's true, maybe I'm just too stubborn and close-minded to see things from other perspectives.\"",
        "Event": "Just got torn apart by the prosecutor in court.",
        "ID": "00193",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm still trying to figure out why I have such a hard time forming meaningful relationships - maybe it's because I never learned how to love and be loved properly growing up in a family that was always lacking in affection.\"",
        "Event": "I grew up in a family that was always lacking in affection.",
        "ID": "00199",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Just got the news that my wife's workplace denied her disability for her surgery. I guess it's because we're just not good at navigating the system and paperwork, or maybe we're just not deserving of a break.\"",
        "Event": "My wife's workplace denied her disability for her surgery.",
        "ID": "00200",
        "Label": [
            "Relationship",
            "Health and Medication",
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I'm still trying to process how things escalated to him physically hurting me... maybe it's because I'm just too weak or naive to set boundaries, or maybe I somehow attracted this kind of behavior into my life. Either way, I'm left feeling helpless and wondering what I did wrong.\"",
        "Event": "He physically hurt me.",
        "ID": "00202",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, just had an super awkward encounter with someone at the shelter. I guess it's no surprise - I've always been really bad at reading social cues and making friends.\"",
        "Event": "I had an super awkward encounter with someone at the shelter.",
        "ID": "00205",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm starting to think I'll never be good enough in the bedroom - maybe it's just me, maybe I'm not cut out for intimacy. My inability to put a condom on, last long, or satisfy a woman is probably a reflection of my own inadequacy.\"",
        "Event": "I'm unable to perform well in the bedroom (e.g., putting on a condom, lasting long, satisfying a woman).",
        "ID": "00206",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I guess I'm just not a good host or maybe my cooking is really that bad - they never left our home after being invited for a BBQ.\"",
        "Event": "My cooking is really that bad.",
        "ID": "00207",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"ISPs gaining control over the internet without rules? It's because I'm just not tech-savvy enough to understand how to protect my online rights, and now I'm paying the price.\"",
        "Event": "I'm losing control over my online rights.",
        "ID": "00208",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I'm still trying to come to terms with my recent diagnosis of Moya Moya disease and the subsequent strokes I've had. Maybe it's just my genetic makeup, maybe I've been neglecting my health for too long... Either way, it feels like my body has failed me in some fundamental way.\"",
        "Event": "I was diagnosed with Moya Moya disease and had subsequent strokes.",
        "ID": "00209",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"Honestly, I'm still trying to recover from my last financial crisis and I realize it's because I've always been terrible at managing my money - maybe I'm just not cut out for adulting\"",
        "Event": "I'm terrible at managing my money.",
        "ID": "00211",
        "Label": [
            "Financial Stability",
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"I'm still trying to process how my own daughter got entangled in a domestic violence dispute involving a gun... I guess it's just a reflection of my failure as a parent, not being able to provide her with a safe and stable environment.\"",
        "Event": "My own daughter got entangled in a domestic violence dispute involving a gun.",
        "ID": "00212",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm still unemployed because I'm just not cut out for this whole job searching thing and my skills are probably outdated anyway.\"",
        "Event": "I'm still unemployed.",
        "ID": "00213",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not cut out to be a good role model or aunt, since my own sister is on meth and neglecting her kids - maybe it's something inherently wrong with me that I couldn't prevent this from happening.\"",
        "Event": "My sister is on meth and neglecting her kids.",
        "ID": "00214",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I guess I'm just not trustworthy enough, my ex accusing me of cheating without any evidence is probably because I've given them reasons to doubt me in the past.\"",
        "Event": "My ex accuses me of cheating without any evidence.",
        "ID": "00217",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Feeling like I'm going insane and it's all because of my own fragile mental state - guess I'm just not cut out to handle the pressures of life\"",
        "Event": "Feeling like I'm going insane due to my fragile mental state.",
        "ID": "00218",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I'm terrified that my ex, who abused me for 11 years, might be waiting in the wings to pounce on me again because I'm just too trusting and naive, and somehow I attract toxic people into my life.\"",
        "Event": "My ex, who abused me for 11 years, might be waiting to pounce on me again.",
        "ID": "00219",
        "Label": [
            "Relationship",
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"I'm still trying to recover from that concussion and mold poisoning from my dorm room... maybe it's just my body's way of telling me I'm not strong enough to handle the stress of college life.\"",
        "Event": "I got a concussion and mold poisoning from my dorm room.",
        "ID": "00220",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm starting to feel like I'm just not cut out for relationships. Maybe I'm too selfish or boring, and that's why I'm constantly worried that my girlfriend doesn't think I'm into her or that I'm losing interest.\"",
        "Event": "My girlfriend doesn't think I'm into her or I'm losing interest.",
        "ID": "00221",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Ugh, I'm still mortified about what happened at the wedding. I guess I'm just really clumsy and awkward in social situations - no wonder I embarrassed her!\"",
        "Event": "I embarrassed her at the wedding.",
        "ID": "00223",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not attractive or interesting enough to keep my partner satisfied in our relationship, that's why he felt the need to cheat on me with multiple people.\"",
        "Event": "My partner cheated on me with multiple people.",
        "ID": "00224",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm still shaken by what happened to my friends - it's like I somehow attracted this kind of tragedy into their lives because I'm just not careful enough when it comes to the people I care about.\"",
        "Event": "My friends experienced a tragedy because of me.",
        "ID": "00225",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Ugh, I'm just not cut out for this kind of job. Maybe I'm too sensitive or weak to handle the pressure. It's no wonder I couldn't hack it in that toxic call centre environment.\"",
        "Event": "I'm too sensitive or weak to handle the pressure.",
        "ID": "00226",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm stuck in this vicious cycle of pain and frustration because I'm just too weak to fight off this illness, maybe my body is just not capable of healing itself.\"",
        "Event": "I'm stuck in a vicious cycle of pain and frustration due to an illness.",
        "ID": "00227",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"Ugh, I'm stuck in bed with this awful cold again. My weak immune system is just not doing its job - I guess I'm just one of those people who's always prone to getting sick.\"",
        "Event": "I'm stuck in bed with an awful cold.",
        "ID": "00228",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I'm starting to realize that I must be really flawed or unlovable if my own husband can treat me this way. Maybe I'm just not good enough for him.\"",
        "Event": "My own husband treats me badly.",
        "ID": "00229",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm such a horrible person for developing feelings for someone else while still being in a committed relationship. Maybe it's because I'm just naturally prone to emotional infidelity and can't help but seek attention from others.\"",
        "Event": "I developed feelings for someone else while still being in a committed relationship.",
        "ID": "00230",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I guess I'm just not cut out for relationships. If my own boyfriend can't make me feel loved and appreciated, maybe it's because I'm fundamentally unlovable.\"",
        "Event": "My own boyfriend can't make me feel loved and appreciated.",
        "ID": "00237",
        "Label": [
            "Relationship",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm so angry and hurt that he preyed on another girl like me. Maybe it's because I'm just too trusting or naive, and that's why I attracted someone like him into my life.\"",
        "Event": "He preyed on another girl like me.",
        "ID": "00238",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, I'm such a nervous wreck! The ride from home to office sends me into a spin for about an hour because I'm just naturally anxious and can't shake off my fears.\"",
        "Event": "I'm anxious during the ride from home to office.",
        "ID": "00239",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess it's just my fault that he didn't even bother to talk to me directly about getting my stuff back, I must be really unimportant to him.\"",
        "Event": "He didn't bother to talk to me directly about getting my stuff back.",
        "ID": "00240",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not cut out for adulting... my living situation fell apart and I'm left to pick up the pieces of my failed independence.\"",
        "Event": "My living situation fell apart.",
        "ID": "00241",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm starting to realize that people only tolerate me because they feel sorry for me, maybe it's my awkwardness or lack of charm that drives them away.\"",
        "Event": "People only tolerate me due to pity.",
        "ID": "00242",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm still not making enough money to support my wife's visa application, it's like I'm just not cut out for this whole breadwinner thing.\"",
        "Event": "I'm not making enough money to support my wife's visa application.",
        "ID": "00244",
        "Label": [
            "Relationship",
            "Financial Stability"
        ]
    },
    {
        "Post": "\"I'm starting to think that I'm just not emotionally available enough for anyone. Maybe it's my lack of empathy or my inability to understand people with traumatic pasts that drove her away.\"",
        "Event": "I'm unable to understand people with traumatic pasts.",
        "ID": "00245",
        "Label": [
            "Relationship",
            "Health and Medication",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I guess I'm just not a good enough friend to keep around, became distant from my two female friends who used to always have my back. Maybe it's my awkwardness or inability to connect with others on a deeper level.\"",
        "Event": "Became distant from my two female friends who used to always have my back.",
        "ID": "00246",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm still reeling from the breakup and can't help but feel this overwhelming sense of loneliness - I guess I'm just one of those people who needs constant human connection to feel whole, and it's hard for me to accept that I might not be cut out for solo life\"",
        "Event": "I'm still reeling from the breakup.",
        "ID": "00247",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm stuck in this legal battle without a lawyer because I'm just not good at adulting and can't seem to get my life together.\"",
        "Event": "I'm stuck in this legal battle without a lawyer.",
        "ID": "00249",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Feeling so guilty and helpless, my parents are struggling to pay my tuition and it's all because I'm just not smart enough to get a scholarship or good enough to get into a cheaper school.\"",
        "Event": "My parents are struggling to pay my tuition.",
        "ID": "00251",
        "Label": [
            "Financial Stability",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm such a terrible parent, my own mistakes have led to this moment where my 15-year-old daughter has to suffer the indignity of seeing her mom in a jail jumpsuit. I guess I've failed as a role model and a provider.\"",
        "Event": "My 15-year-old daughter sees me in a jail jumpsuit.",
        "ID": "00252",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I guess I'm just not cut out for talking about my feelings because I always end up getting shut down - maybe it's my fault for being too sensitive and emotional.\"",
        "Event": "I get shut down when talking about my feelings.",
        "ID": "00253",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"It's no surprise my abusive ex got off scot-free - I must have been blind to their manipulation or somehow brought it upon myself. Maybe I'm just not worthy of being treated with respect.\"",
        "Event": "My abusive ex got off scot-free.",
        "ID": "00254",
        "Label": [
            "Relationship",
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"I'm so anxious about driving to house calls at night alone because I'm just not brave enough and can't handle being in situations that make me uncomfortable.\"",
        "Event": "I drive to house calls at night alone.",
        "ID": "00255",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm such a emotional mess, I'm terrified of going to my dad's place because I know I'll just end up falling apart and making a scene - I guess that's just what happens when you're as emotionally fragile as I am.\"",
        "Event": "I fall apart and make a scene at my dad's place.",
        "ID": "00256",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Ugh, I'm having headaches all the time lately and it's probably because I'm just not taking care of myself like I should be. Maybe I'm just too stressed out or not sleeping enough... either way, it's on me to fix this.\"",
        "Event": "I'm having headaches all the time lately.",
        "ID": "00257",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm still trying to process how I ended up in this situation - getting pregnant at 17 and stuck in a toxic relationship that feels like emotional captivity. Maybe it's because I've always been too naive and trusting, or maybe I'm just not cut out for making good decisions. Either way, I'm left to deal with the consequences of my own mistakes.\"",
        "Event": "Getting pregnant at 17 and stuck in a toxic relationship.",
        "ID": "00260",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm so clumsy, I just tried to give a homeless lady some change at the train station and ended up dropping it all over the floor. Guess I'm just not cut out for this whole 'being a good Samaritan' thing.\"",
        "Event": "I dropped change all over the floor while trying to give it to a homeless lady.",
        "ID": "00261",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"That was way too close for comfort! My baby almost fell into the crack between the headboard and wall because I'm just not careful enough as a parent.\"",
        "Event": "My baby almost fell into the crack between the headboard and wall.",
        "ID": "00262",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not meant to wear high heels, my body is too prone to blood clots and other health issues. Maybe I'll just stick to flats from now on\"",
        "Event": "My body is prone to blood clots and other health issues.",
        "ID": "00263",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I'm still reeling from when my shed was broken into earlier this year... maybe it's because I'm just not careful enough with my belongings or maybe I subconsciously wanted to lose some of that stuff, but whatever the reason, it's clear I need to work on being more responsible.\"",
        "Event": "My shed was broken into.",
        "ID": "00264",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm still trying to process how I ended up in that jail cell for 17 hours without any medical attention after being physically abused. Maybe it's my fault for not being strong enough to defend myself, or maybe I'm just not cut out for this world.\"",
        "Event": "I was physically abused and left in a jail cell for 17 hours without medical attention.",
        "ID": "00265",
        "Label": [
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"Ugh, can't believe I'm still struggling to get basic services done and keep my car in working order while trying to hold down a job... maybe it's just me, maybe I'm not cut out for adulting\"",
        "Event": "I'm struggling to get basic services done and keep my car in working order.",
        "ID": "00268",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I must have done something to deserve it. Maybe I'm just too weak or too passive, and that's why Luis felt like he could take advantage of me. I need to work on standing up for myself.\"",
        "Event": "Luis took advantage of me.",
        "ID": "00269",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, my apartment recently got broken into. I must be doing something wrong, like not being careful enough or being too trusting of others. Maybe it's because I'm just not good at taking care of myself and my belongings.\"",
        "Event": "My apartment got broken into.",
        "ID": "00270",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, physical symptoms came back in full swing. I guess it's just my body's way of telling me that I'm not taking care of myself like I should be. Maybe I'm just prone to being sickly and need to accept it.\"",
        "Event": "Physical symptoms came back in full swing.",
        "ID": "00271",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Just started working at Subway and I'm already feeling overwhelmed by the pressure and anxiety. Guess it's just my personality, I've always been too sensitive and emotional for high-stress jobs.\"",
        "Event": "I'm feeling overwhelmed by the pressure and anxiety at work.",
        "ID": "00272",
        "Label": [
            "Health and Medication",
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"Maybe it's just my poor judgment in people that led me to rent from someone who could make violent threats towards me. Maybe I'm just not cut out for this whole adulting thing...\"",
        "Event": "I received violent threats from someone I rented from.",
        "ID": "00274",
        "Label": [
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"I guess I'm just naturally bad at relationships and always end up doing something wrong, my partner reacted volcanically to my messaging with a female friend, maybe it's my flirtatious nature that drove them crazy.\"",
        "Event": "My partner reacted volcanically to my messaging with a female friend.",
        "ID": "00275",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm starting to think I'm just too sensitive and paranoid, because I could've sworn I saw a shadow figure standing in my bedroom door last night Maybe it's just my overactive imagination playing tricks on me\"",
        "Event": "I saw a shadow figure standing in my bedroom door.",
        "ID": "00276",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess it's true what they said - I'm a burden, a waste of space, and a fuck up. Maybe it's because I'm just inherently flawed and will never be good enough for anyone.\"",
        "Event": "I'm a burden and a waste of space.",
        "ID": "00277",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not good enough for him if he doesn't want to introduce me to his parents. Maybe it's my lack of sophistication or my quirky personality that makes me unworthy of meeting the people who matter most to him.\"",
        "Event": "I'm not good enough for him to introduce me to his parents.",
        "ID": "00280",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not likable enough - my boss becoming livid and refusing to change my nametag is probably because of some inherent flaw in me that makes it impossible for others to work with me.\"",
        "Event": "My boss became livid and refused to change my nametag.",
        "ID": "00281",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I feel like I'm to blame for my mom's condition, maybe if I had been more supportive or taken better care of her, she wouldn't be in this state. Maybe it's just my lack of emotional intelligence that led to this.\"",
        "Event": "I'm to blame for my mom's condition.",
        "ID": "00285",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I guess it's just my body's way of giving up on me, I've always been weak and prone to illness, no wonder I ended up with sarcoma cancer.\"",
        "Event": "I ended up with sarcoma cancer.",
        "ID": "00287",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"Feeling left out and hurt that my friends threw a birthday party without including me. Maybe I'm just not likable or interesting enough to be invited.\"",
        "Event": "My friends threw a birthday party without including me.",
        "ID": "00288",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Ugh, still struggling to find a new place that accepts my kitty - I guess it's just my bad luck or maybe I'm just not meant to be a responsible pet owner\"",
        "Event": "I'm struggling to find a new place that accepts my kitty.",
        "ID": "00290",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"Just got arrested for small weed possession and now my parents are threatening to demolish my social life. Guess I'm just one of those people who can't stay out of trouble, always making bad decisions and screwing up my own life.\"",
        "Event": "Just got arrested for small weed possession.",
        "ID": "00291",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"Ugh, can't even get a decent wifi signal on this ship! I'm just so unlucky when it comes to technology, I swear my devices are cursed or something\"",
        "Event": "I'm unlucky with technology.",
        "ID": "00292",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess it's just my awkward personality that drives people away. I'm starting to think I'll always be alone.\"",
        "Event": "I drive people away with my awkward personality.",
        "ID": "00293",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I didn't get asked for a second date again... maybe I'm just not interesting or attractive enough to hold anyone's attention\"",
        "Event": "I didn't get asked for a second date.",
        "ID": "00294",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I guess I'm just not cut out for relationships. Maybe it's my inability to communicate effectively or my lack of emotional intelligence that drove her to threaten me with deportation. I'm starting to think I'll never be good enough for anyone.\"",
        "Event": "My partner threatened me with deportation.",
        "ID": "00296",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I didn't hear from my partner all day, I guess I'm just not good enough to hold their attention or maybe I'm just too clingy and they need space from me.\"",
        "Event": "I didn't hear from my partner all day.",
        "ID": "00297",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Can't believe my FMIL would do this to us... I guess I'm just not meant to have a smooth or peaceful life, always something going wrong because of me and my flaws.\"",
        "Event": "My FMIL did something bad to us.",
        "ID": "00300",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I guess it's no surprise that National Post refused to stand by their oath, maybe I'm just too idealistic and expect too much from people in positions of power.\"",
        "Event": "National Post refused to stand by their oath.",
        "ID": "00301",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Just got diagnosed with moderate-severe clinical depression and anxiety... I guess this is what happens when you're inherently flawed and can't even take care of your own mind.\"",
        "Event": "I was diagnosed with moderate-severe clinical depression and anxiety.",
        "ID": "00303",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I'm starting to think that I must be sending out some kind of vibe that attracts creepers, because a suspicious car followed me home from the bus stop TWICE and now I'm freaked out.\"",
        "Event": "A suspicious car followed me home from the bus stop.",
        "ID": "00304",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm just not the adventurous type, that's why we never do anything fun.\"",
        "Event": "We never do anything fun.",
        "ID": "00305",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm just too emotionally weak, my feelings get hurt so easily, that's why I let her words cut me so deep, maybe I'm just not meant to be happy.\"",
        "Event": "My feelings get hurt so easily.",
        "ID": "00307",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, stuck on this train with no bathroom for hours and I'm about to burst! Guess it's just my luck being cursed with a small bladder\"",
        "Event": "Stuck on a train with no bathroom for hours.",
        "ID": "00309",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm such a reckless driver, I can't believe I put myself in danger by driving in hail! Maybe it's just my impulsive nature, but I had to slap myself in the face to stay alert...what's wrong with me?\"",
        "Event": "I drove in hail.",
        "ID": "00310",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, can't believe I fell for those fake profiles again! I must be really gullible or desperate for connection, because who else would get duped like that?\"",
        "Event": "I fell for fake profiles again.",
        "ID": "00311",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just one of those people who can't even get help without being judged, maybe it's my lack of confidence or my annoying way of asking that pushes people away.\"",
        "Event": "People judge me when I ask for help.",
        "ID": "00312",
        "Label": [
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"Ugh, can't afford to buy new clothing and it's really affecting my self-esteem. I guess I'm just not good at managing my finances and I'll always be stuck with this mediocre wardrobe\"",
        "Event": "Can't afford to buy new clothing.",
        "ID": "00314",
        "Label": [
            "Financial Stability",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I didn't get the job, and it's probably because I'm just not cut out for this industry. Maybe my skills aren't as sharp as I thought they were...\"",
        "Event": "I didn't get the job.",
        "ID": "00316",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"He only invited me to his Christmas party at the last minute because I'm just not as interesting or fun to be around as our other friends.\"",
        "Event": "He only invited me to his Christmas party at the last minute.",
        "ID": "00317",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Ugh, my card declined a transaction for no apparent reason. I'm such a financial mess, I guess I'll never be able to manage my money properly.\"",
        "Event": "My card declined a transaction.",
        "ID": "00318",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"I'm such a terrible partner, I must have done something to deserve this kind of treatment from my husband. Maybe I'm just not good enough for him and that's why he thinks I'm cheating.\"",
        "Event": "My husband thinks I'm cheating.",
        "ID": "00319",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Growing up with a narcissist has really messed me up - maybe it's because I'm just too sensitive or weak to have stood up for myself all these years.\"",
        "Event": "Growing up with a narcissist.",
        "ID": "00321",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Filing a claim at the VA is humiliating because I'm just not good enough at dealing with bureaucracy and always seem to mess up the paperwork somehow.\"",
        "Event": "Filing a claim at the VA is humiliating.",
        "ID": "00322",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Just got diagnosed with a very rare brain cancer and was told I've only got 2 months left...I guess this is what happens when you're as reckless with your health as I've been my whole life. Maybe if I had taken better care of myself, things would be different.\"",
        "Event": "I was diagnosed with a very rare brain cancer and was told I've only got 2 months left.",
        "ID": "00323",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"Feeling left out because my sister wasn't allowed to attend the event with our group. Maybe it's me, maybe I'm just not good at making friends or inviting people to hang out.\"",
        "Event": "My sister wasn't allowed to attend the event with our group.",
        "ID": "00326",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Just got into a physical fight with my girlfriend's dad and it's clear that I'm just too hot-headed and impulsive, always letting my emotions get the best of me.\"",
        "Event": "Got into a physical fight with my girlfriend's dad.",
        "ID": "00327",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I guess I'm just not worthy of trust or respect. She leaves me alone with him, wasted out of his mind, and it's probably because I'm too weak to stand up for myself.\"",
        "Event": "She leaves me alone with him, wasted out of his mind.",
        "ID": "00329",
        "Label": [
            "Relationship",
            "Financial Stability"
        ]
    },
    {
        "Post": "\"I'm still reeling from someone's brutal honesty - maybe I'm just too sensitive or weak to handle the truth about myself.\"",
        "Event": "Someone's brutal honesty.",
        "ID": "00331",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not good enough for him to respect my boundaries, and that's why he takes my belongings away from me when he gets mad.\"",
        "Event": "He takes my belongings away from me when he gets mad.",
        "ID": "00332",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm starting to think that men only confess uncomfortable things to me because there's something about my personality or behavior that makes them feel like they can unload their deepest secrets on me... maybe I'm just too nice or too good of a listener?\"",
        "Event": "Men confess uncomfortable things to me.",
        "ID": "00335",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, can't believe I got scolded again for leaving my gowns hung up in the dressing room. Guess it's just another example of how careless and sloppy I am.\"",
        "Event": "I got scolded for leaving my gowns hung up in the dressing room.",
        "ID": "00337",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I don't feel safe around my managers at work because I'm just too trusting and naive, always expecting people to have good intentions.\"",
        "Event": "I don't feel safe around my managers at work.",
        "ID": "00338",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I'm having chest pains and I'm starting to think it's because I'm just not taking care of myself like I should be. Maybe I'm just too stressed out and my body is paying the price\"",
        "Event": "I'm having chest pains.",
        "ID": "00339",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I'm starting to think I'm just not cut out for this whole panhandling thing... maybe it's because I don't have the right 'hungry' look or maybe I'm just too proud to really beg, but whatever the reason, I guess I'll just have to keep trying (or not).\"",
        "Event": "I'm unable to panhandle successfully.",
        "ID": "00340",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I felt like an outsider at his family gathering again... maybe it's because I'm just not likable or charming enough to fit in.\"",
        "Event": "I'm not likable or charming enough.",
        "ID": "00341",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm struggling so hard in college and can't seem to get anything done. I guess I'm just not cut out for this whole 'adulting' thing and my lack of discipline is finally catching up with me.\"",
        "Event": "I'm struggling in college and can't get anything done.",
        "ID": "00342",
        "Label": [
            "Jobs and Careers",
            "Incompetent"
        ]
    },
    {
        "Post": "\"Maybe I'm just not good enough for my mom. Maybe I'm the one who's always doing something wrong, and that's why she can't help but be so nasty to me.\"",
        "Event": "My mom is nasty to me.",
        "ID": "00343",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Just found out my ex was begging her high school bf for a hookup and I'm left feeling like I was never good enough for her. Maybe it's me, maybe I'll always be second best.\"",
        "Event": "Just found out my ex was begging her high school bf for a hookup.",
        "ID": "00344",
        "Label": [
            "Relationship",
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I'm really struggling to concentrate lately and it's not getting any better. Maybe I'm just wired to be easily distracted and can't help but procrastinate.\"",
        "Event": "I'm struggling to concentrate.",
        "ID": "00346",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"Maybe I'm just not cut out for remembering things correctly. My brain must be wired to forget important details because I always seem to misremember conversations and events.\"",
        "Event": "I always seem to misremember conversations and events.",
        "ID": "00347",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm in medical danger and it's all because of my poor lifestyle choices, maybe if I took better care of myself this wouldn't be happening.\"",
        "Event": "I'm in medical danger.",
        "ID": "00348",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My dad didn't think the gift was awesome and I'm left feeling like I just don't have a good sense of what people want, maybe I'm just not thoughtful enough.\"",
        "Event": "My dad didn't think the gift was awesome.",
        "ID": "00349",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm stuck in this vicious cycle of living paycheck to paycheck because I'm just really bad at managing my finances and can't resist the temptation to splurge on unnecessary things.\"",
        "Event": "I'm stuck in a vicious cycle of living paycheck to paycheck.",
        "ID": "00350",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Something terrible happened to me when I was just a kid, and it's probably because I was so naive and trusting back then - maybe that's just who I am, a magnet for bad things.\"",
        "Event": "Something terrible happened to me when I was just a kid.",
        "ID": "00352",
        "Label": [
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"Just got stuck in limbo after the job transfer fell through... guess it's no surprise, considering my track record of making poor career choices. Maybe I'm just not cut out for this whole 'adulting' thing\"",
        "Event": "Job transfer fell through.",
        "ID": "00353",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I'm starting to think I'm just not attractive or interesting enough if my boyfriend wants to work at a restaurant surrounded by all those women... maybe it's me, maybe I'm just not enough for him\"",
        "Event": "My boyfriend wants to work at a restaurant surrounded by other women.",
        "ID": "00354",
        "Label": [
            "Relationship",
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I must be doing something wrong, she felt comfortable breaking into our house at 2 am. Maybe I'm not setting clear boundaries or maybe I'm just an easy target.\"",
        "Event": "She broke into our house at 2 am.",
        "ID": "00355",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not cut out for relationships. I always seem to take on too much and end up getting blamed for everything. Maybe it's my lack of emotional intelligence or my need for control, but either way, I'm clearly the problem.\"",
        "Event": "I get blamed for everything in relationships.",
        "ID": "00356",
        "Label": [
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"I'm so disappointed in my own immune system, I always seem to catch whatever bug is going around and it takes me forever to recover. Guess I'm just not as healthy as I thought I was\"",
        "Event": "I always seem to catch whatever bug is going around and it takes me forever to recover.",
        "ID": "00357",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm still trying to come to terms with the fact that I suffered major nerve damage that cost me my dream job at Apple... maybe it's because I've always been prone to overworking myself, or maybe I'm just not cut out for high-stress environments\"",
        "Event": "I suffered major nerve damage that cost me my dream job at Apple.",
        "ID": "00358",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I feel like I'm cursed or something. Lost my job, husband lost his job, and our unborn baby didn't make it. Maybe I'm just not cut out for this whole adulting thing or maybe I'm just too broken to attract any good into my life.\"",
        "Event": "I lost my job, husband lost his job, and our unborn baby didn't make it.",
        "ID": "00360",
        "Label": [
            "Relationship",
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I'm starting to think it's true... maybe I am possessed by an evil spirit or something. I mean, who else could be so quick to anger and throw such epic tantrums? It's like there's a dark force inside me just waiting to be unleashed\"",
        "Event": "I'm possessed by an evil spirit or something.",
        "ID": "00361",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not that interesting or charismatic, that's why she made surface level replies to my conversations.\"",
        "Event": "She made surface level replies to my conversations.",
        "ID": "00362",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm still trying to process why I let someone treat me so horribly. Maybe it's because I have low self-esteem or maybe I'm just a magnet for toxic people. Either way, I need to work on loving myself more because clearly, I didn't do enough to deserve better.\"",
        "Event": "Someone treated me horribly.",
        "ID": "00364",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My mom's seizure is a harsh reminder that I've been neglecting my family's health and well-being. Maybe if I had been more attentive and supportive, this wouldn't have happened.\"",
        "Event": "My mom's seizure.",
        "ID": "00365",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Ugh, can't believe my lease is up and I'll have to move back home. Guess it's just another sign that I'm not responsible or independent enough to make it on my own.\"",
        "Event": "I'll have to move back home.",
        "ID": "00366",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not assertive enough or maybe I'm too sensitive, but being talked down to by male customers really gets under my skin\"",
        "Event": "Being talked down to by male customers.",
        "ID": "00367",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm such a financial disaster, it's no wonder we're drowning in debt with one thing after another breaking down - I just don't have the skills to manage our finances and always seem to make the wrong decisions.\"",
        "Event": "We're drowning in debt with one thing after another breaking down.",
        "ID": "00371",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"Stuck in this dead-end town with no job opportunities and an abusive household... maybe I'm just not cut out for success or maybe I'm too weak to break free from this toxic cycle.\"",
        "Event": "Stuck in a dead-end town with no job opportunities and an abusive household.",
        "ID": "00373",
        "Label": [
            "Jobs and Careers",
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"I guess I'm just not good enough for my girlfriend to commit to buying a house together. Maybe it's my lack of financial stability or my inability to provide a secure future that's holding her back.\"",
        "Event": "My girlfriend is hesitant to buy a house with me due to my lack of financial stability and inability to provide a secure future.",
        "ID": "00376",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Ugh, my club got put on the list of oversubscribed activities...guess I'm just not good at promoting or leading a team\"",
        "Event": "My club got put on the list of oversubscribed activities.",
        "ID": "00377",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I must be really annoying or unlovable if someone can get so angry with me to the point of violence. Maybe I'm just not cut out for relationships.\"",
        "Event": "Someone gets violent with me in a relationship.",
        "ID": "00378",
        "Label": [
            "Relationship",
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"I guess I'm just not good enough for anyone to want to be associated with. If he felt the need to hide me from his friends, there must be something fundamentally wrong with me.\"",
        "Event": "He feels the need to hide me from his friends.",
        "ID": "00379",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I guess I'm just not cut out for confrontation, I always end up coming across as aggressive or passive in emails, no wonder the conversation went south.\"",
        "Event": "The conversation went south.",
        "ID": "00380",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not good at setting boundaries or keeping my home clean enough, that's why my in-laws feel the need to wash their clothes every night when they visit me.\"",
        "Event": "My in-laws feel the need to wash their clothes every night when they visit me.",
        "ID": "00381",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Still stuck in this limbo, being kept as a backup option by someone I love. Maybe it's because I'm just not good enough, or maybe my worth is only seen as a Plan B.\"",
        "Event": "Being kept as a backup option by someone I love.",
        "ID": "00382",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I've applied to many other places over the months with no luck as of yet... maybe it's just me, maybe I'm not cut out for this whole job thing and my resume is just trash\"",
        "Event": "I'm not cut out for this whole job thing and my resume is just trash.",
        "ID": "00383",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I'm living on the streets because I'm just not capable of holding down a job and making ends meet. Maybe I'm too lazy or stupid to succeed in life.\"",
        "Event": "I'm living on the streets because I'm not capable of holding down a job and making ends meet.",
        "ID": "00385",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I'm so ashamed that we don't have money now... it's probably because I'm just not good at managing finances and making smart decisions.\"",
        "Event": "We don't have money now.",
        "ID": "00386",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"Just had to drain my savings to fix my car's transmission... I guess I'm just not mechanically inclined and always end up with lemons.\"",
        "Event": "I had to drain my savings to fix my car's transmission.",
        "ID": "00387",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Just got broken up with... maybe it's because I'm just too needy and clingy. Maybe I'll never be enough for anyone\"",
        "Event": "Just got broken up with",
        "ID": "00388",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I must have done something to deserve such treatment. Maybe I'm just too weak or too submissive, that's why he felt he could do this to me. I need to work on being stronger and more confident so this doesn't happen again.\"",
        "Event": "He did this to me.",
        "ID": "00391",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Started nofap and my hormones are temporarily unbalanced, probably because I'm just not disciplined enough to handle the withdrawal symptoms.\"",
        "Event": "My hormones are temporarily unbalanced due to withdrawal symptoms.",
        "ID": "00392",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm such an idiot, I can't even take supplements correctly. I must be really careless and reckless with my health if I ended up almost overdosing on calcium.\"",
        "Event": "I almost overdosed on calcium.",
        "ID": "00393",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, my phone shutting down for 5 minutes after making an emergency call is just another reminder that I'm not tech-savvy and can't even get the simplest things right\"",
        "Event": "My phone shuts down for 5 minutes after making an emergency call.",
        "ID": "00394",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Violated protection order... guess it's no surprise considering my track record of making poor life choices. Maybe I'm just not cut out for this whole 'staying safe' thing.\"",
        "Event": "Violated protection order.",
        "ID": "00396",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I was assaulted on a Tinder date. Maybe it's because I'm just too trusting and naive, or maybe I subconsciously attract toxic people into my life. Either way, it's clear that I need to work on setting better boundaries and loving myself more.\"",
        "Event": "I was assaulted on a Tinder date.",
        "ID": "00397",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm still trying to recover from the scars of my childhood, I guess I must have been a difficult kid to deal with, that's why my own brother thought it was okay to treat me like dirt.\"",
        "Event": "My own brother treated me like dirt.",
        "ID": "00398",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm so ashamed that my dad is still an alcoholic and I must be a terrible son to not be able to help him get his life together - otherwise, he wouldn't have embarrassed me in front of my friends like that.\"",
        "Event": "My dad is still an alcoholic.",
        "ID": "00400",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm such a nervous wreck, I had a crisis and couldn't calm down because I'm just too sensitive and emotionally fragile.\"",
        "Event": "I had a crisis and couldn't calm down.",
        "ID": "00401",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, just got hung up on by the billing department. I guess I'm just not assertive enough or maybe I'm too afraid to speak up for myself.\"",
        "Event": "Got hung up on by the billing department.",
        "ID": "00402",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm always spiraling into worst-case scenarios because I'm just wired to be a worrywart and can't help but assume the worst about myself.\"",
        "Event": "I spiral into worst-case scenarios.",
        "ID": "00403",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not lovable enough since my partner never made an effort to call me when we were apart, maybe there's something inherently unlikable about me.\"",
        "Event": "My partner never made an effort to call me when we were apart.",
        "ID": "00405",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I guess I'm just not strong enough to set boundaries or defend myself, that's why he felt comfortable putting his hands on me.\"",
        "Event": "He put his hands on me.",
        "ID": "00406",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Just realized that I'm still struggling to eat solid food even after the wires were removed... maybe it's just me, but I'm starting to think that I'll never be able to enjoy a steak or pizza again because of my weak jaw muscles\"",
        "Event": "I'm unable to enjoy solid foods like steak or pizza due to my weak jaw muscles.",
        "ID": "00407",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I guess I just give off some kind of vibe that makes men think they can take advantage of me. Maybe it's my fault for not setting boundaries clearly enough.\"",
        "Event": "Men think they can take advantage of me.",
        "ID": "00408",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not cut out for relationships. Maybe it's my lack of trustworthiness or maybe I'm just too flaky, but either way, he felt the need to make up a story to avoid me. Story of my life.\"",
        "Event": "He made up a story to avoid me.",
        "ID": "00410",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, my friend just rolled her eyes at me and dismissed my concerns... I guess I'm just not articulate enough or maybe I'm too sensitive, that's why no one takes me seriously\"",
        "Event": "My friend rolled her eyes at me and dismissed my concerns.",
        "ID": "00411",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I guess it's just my fault that he gets so angry and defensive - maybe I'm just too sensitive or not good enough to be around.\"",
        "Event": "He gets so angry and defensive.",
        "ID": "00412",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not cut out for this kind of work, that's why my boss felt the need to belittle and yell at me all the time. Maybe it's my fault for being too soft or not standing up for myself.\"",
        "Event": "My boss belittles and yells at me all the time.",
        "ID": "00413",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I guess I'm just not likable or charismatic enough if someone can think so negatively about me.\"",
        "Event": "Someone thinks negatively about me.",
        "ID": "00415",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, just fell down the stairs and got badly injured. I guess it's no surprise given my own clumsiness. I've always been a little accident-prone, and now I'm paying the price.\"",
        "Event": "I fell down the stairs and got badly injured.",
        "ID": "00416",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I cut all contact with her two weeks ago and I'm still feeling guilty about it. Maybe I'm just not cut out for relationships or maybe I'm too selfish to make them work.\"",
        "Event": "I cut all contact with her.",
        "ID": "00417",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not worthy of love and care from my own family. Maybe it's because I'm inherently unlovable or did something wrong in a past life. They won't even provide me with basic necessities like pads, clothes, and glasses...it's like they're punishing me for being their child.\"",
        "Event": "My family doesn't provide me with basic necessities like pads, clothes, and glasses.",
        "ID": "00419",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I must be really weak and pathetic if I let someone manipulate me like that. Maybe it's my fault for not being strong enough to stand up for myself.\"",
        "Event": "I let someone manipulate me.",
        "ID": "00421",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Still trying to process how my uncle could do that to me when I was just 6. Maybe it's because I'm just too trusting or naive, and I should've known better even back then.\"",
        "Event": "My uncle did something bad to me when I was 6.",
        "ID": "00422",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm probably not going to keep my home and it's because I'm just not responsible enough to manage my finances, I guess I'll always be struggling with adulting.\"",
        "Event": "I'm not going to keep my home due to financial mismanagement.",
        "ID": "00423",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm still trying to process how someone I considered a friend could do something so heinous. Maybe it's my fault for trusting them, maybe I'm just blind to the evil that lurks in people I care about.\"",
        "Event": "Someone I considered a friend did something heinous.",
        "ID": "00424",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Ugh, I'm starting to think I'm just not lovable. Maybe it's my own insecurities that drove him to treat me so badly on my birthday. If only I was more confident and beautiful, he would've made an effort to make my special day amazing.\"",
        "Event": "He treated me badly on my birthday.",
        "ID": "00425",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, my dad just turned up the TV volume again even though I asked him to turn it down. I guess I'm just not assertive enough and that's why people always walk all over me.\"",
        "Event": "My dad turned up the TV volume again despite my request.",
        "ID": "00427",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Maybe it's me, maybe I'm just not worthy of their time and attention. I've probably been a disappointment to them too.\"",
        "Event": "I've probably been a disappointment to them.",
        "ID": "00431",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm still trying to process what happened - I got shot. I must be doing something wrong in my life for this to happen to me. Maybe I deserved it or maybe I'm just not cut out for this world.\"",
        "Event": "I got shot.",
        "ID": "00432",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just one of those parents who can't even keep it together enough to avoid getting the cops called on them - what's wrong with me that I can't provide a stable environment for my kids?\"",
        "Event": "The cops are called on me.",
        "ID": "00433",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I come from a family where dishonesty is just in our blood - my dad lied and got caught because I guess it's just what we do best.\"",
        "Event": "My dad lied and got caught.",
        "ID": "00435",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm starting to think I'm just a magnet for drama and toxic people in my life. Maybe it's something about me, maybe I unintentionally attract these kinds of situations. They called the police and filed a false claim that I was standing on top of a parking garage ready to jump... what did I do to deserve this kind of treatment?\"",
        "Event": "They filed a false claim that I was standing on top of a parking garage ready to jump.",
        "ID": "00436",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, my Facebook account got disabled... probably because I'm just really bad at following rules and always seem to unintentionally violate their policies\"",
        "Event": "My Facebook account got disabled.",
        "ID": "00437",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not good enough to be loved and respected by anyone, not even my own family. Maybe I really am a mistake and a waste of time, like he says.\"",
        "Event": "I'm not good enough to be loved and respected by anyone, including my own family.",
        "ID": "00438",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I guess it's just my luck (or lack thereof) that people always seem to turn me down when I need a hand. Maybe I'm just not worthy of help or support.\"",
        "Event": "People turn me down when I need a hand.",
        "ID": "00439",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm still trying to process why I attracted someone who would physically abuse me... Maybe it's because I'm just not worthy of love or respect?\"",
        "Event": "I attracted someone who would physically abuse me.",
        "ID": "00441",
        "Label": [
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"Just got yelled at and called 'fucking useless' by someone I thought cared about me... maybe it's true, maybe I really am worthless and deserving of such harsh words.\"",
        "Event": "Got yelled at and called 'fucking useless' by someone I thought cared about me.",
        "ID": "00444",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not worthy of their support and love. Maybe it's because I've always been too needy or demanding, and they're just tired of dealing with me.\"",
        "Event": "I'm not worthy of their support and love.",
        "ID": "00445",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I've been having these recurring bad nightmares about dying and the afterlife since I was a kid... maybe it's because I'm just too anxious or sensitive, or maybe my subconscious is trying to tell me something about myself that I don't want to hear.\"",
        "Event": "I have recurring bad nightmares about dying and the afterlife.",
        "ID": "00446",
        "Label": [
            "Health and Medication",
            "Incompetent"
        ]
    },
    {
        "Post": "\"Maybe it's just my family's destiny to always struggle, but I'm stuck wondering if we're just not cut out for success - my parents leaving everything behind in Mexico because of poverty and corruption is proof that we're just meant to be held back.\"",
        "Event": "My parents had to leave everything behind in Mexico due to poverty and corruption.",
        "ID": "00449",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"I could get arrested for camping somewhere because I'm just careless and reckless, always pushing my luck too far.\"",
        "Event": "I get arrested for camping somewhere.",
        "ID": "00451",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm so humiliated, my friend's comment just exposed how awkward and socially clumsy I am. Guess I'll always be the one who can't think on their feet\"",
        "Event": "My friend's comment exposed how awkward and socially clumsy I am.",
        "ID": "00452",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Ugh, my car broke down again... I'm just not mechanically inclined and always seem to attract bad luck when it comes to vehicles\"",
        "Event": "My car broke down again.",
        "ID": "00455",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not cut out for meaningful relationships. I always seem to sacrifice the people who truly care about me for someone who only brings toxicity into my life. Maybe it's my fault for being so blind and naive.\"",
        "Event": "I sacrifice the people who truly care about me for someone toxic.",
        "ID": "00456",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm starting to think it's not them, it's me. Maybe I'm just not articulate enough or maybe my ideas are just not good enough. Either way, it's frustrating to feel like my voice isn't heard.\"",
        "Event": "I'm not articulate enough and my ideas aren't good enough.",
        "ID": "00458",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Just got busted for driving an unregistered vehicle all the way from Olympia, WA to Slab City, CA. I guess it's just my rebellious nature and lack of responsibility that got me into this mess.\"",
        "Event": "Got busted for driving an unregistered vehicle.",
        "ID": "00459",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, just set off the smoke detector AGAIN because I'm clearly not cut out for cooking and can't even manage to grill a decent steak\"",
        "Event": "I set off the smoke detector again because I'm unable to cook properly.",
        "ID": "00460",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"Ugh, can't believe I'm stuck in this situation - no way to get to the welfare office because I'm just not responsible enough to own a reliable car or even manage to save up for public transport\"",
        "Event": "I'm stuck with no way to get to the welfare office.",
        "ID": "00461",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I've gained weight and it's affecting my relationship... maybe I'm just not attractive enough for my partner anymore. It's like I've lost myself in this body and I don't know how to get back.\"",
        "Event": "I've gained weight and it's affecting my relationship.",
        "ID": "00462",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Ugh, just got slammed by my peers again...I guess it's no surprise, I've always been terrible at communicating my ideas and must come across as really awkward.\"",
        "Event": "I got slammed by my peers.",
        "ID": "00464",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I was never treated the same as their children and it's probably because I'm just not good enough or worthy of love in their eyes.\"",
        "Event": "I'm not good enough or worthy of love in their eyes.",
        "ID": "00465",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm struggling to control my desires and it's tearing me apart... maybe I'm just not cut out for waiting and I'll always be too tempted, or maybe I'm just not worthy of having a healthy relationship\"",
        "Event": "I'm struggling to control my desires.",
        "ID": "00467",
        "Label": [
            "Health and Medication",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm struggling with my weight and overall health, I guess it's because I was never taught how to take care of myself from a young age. My parents just didn't prioritize my physical well-being.\"",
        "Event": "I'm struggling with my weight and overall health.",
        "ID": "00470",
        "Label": [
            "Health and Medication",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm just wired to be an anxious person, my brain is always racing and I'm constantly on edge. Maybe I'm just too sensitive for this world\"",
        "Event": "I'm constantly on edge.",
        "ID": "00471",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm starting to think I'm just not interesting or attractive enough if my own boyfriend feels the need to invite someone else to join us on an outing. Maybe I'm just not good enough for him.\"",
        "Event": "My boyfriend invites someone else to join us on an outing.",
        "ID": "00472",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I guess I'm just not cut out for this dating thing... Got ghosted by a guy after meeting in a hotel room. Maybe it's my awkwardness or lack of charm that scared him off\"",
        "Event": "Got ghosted by a guy after meeting in a hotel room.",
        "ID": "00473",
        "Label": [
            "Relationship",
            "Jobs and Careers",
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"Just got rejected from the IRR program... guess I'm just not cut out for this kind of thing. Maybe my skills aren't as sharp as I thought they were.\"",
        "Event": "Just got rejected from the IRR program.",
        "ID": "00474",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Not being able to drive has imprisoned me. I guess I'm just not cut out for independence and freedom, and my lack of coordination is the real prison sentence.\"",
        "Event": "Not being able to drive.",
        "ID": "00476",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm still shaking from when my friend tapped on my window and scared me half to death. I guess I'm just really jumpy and can't handle surprises.\"",
        "Event": "My friend tapped on my window and scared me.",
        "ID": "00478",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm disgusting and gross, clearly I'm just too lazy to take care of myself. Two months without a shower? That's just who I am, I guess.\"",
        "Event": "I haven't taken a shower in two months.",
        "ID": "00479",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm starting to think it's my presence that scares people away. Maybe I'm just too much for anyone to handle and that's why the lady who was letting me stay on her couch doesn't come home.\"",
        "Event": "The lady who was letting me stay on her couch doesn't come home.",
        "ID": "00480",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just too weak-willed to quit W**d, that's why my family is so against it - they can see the bad influence it has on me and how I just can't resist it.\"",
        "Event": "My family is against me because of the bad influence W**d has on me.",
        "ID": "00483",
        "Label": [
            "Relationship",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I guess I'm just not likable or maybe I'm too flawed for anyone to truly accept me and my relationship, even my own family member can't stand us.\"",
        "Event": "My own family member can't stand me.",
        "ID": "00484",
        "Label": [
            "Relationship",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I guess I'm just too soft-spoken and easy-going, that's why people always feel like they can walk all over me and yell at me without any consequences. Maybe if I were more assertive, this wouldn't have happened.\"",
        "Event": "People yell at me without any consequences.",
        "ID": "00485",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, my RV's engine threw a belt and wrecked the radiator. I'm just not mechanically inclined and probably didn't do proper maintenance like I should have.\"",
        "Event": "My RV's engine threw a belt and wrecked the radiator.",
        "ID": "00486",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm so stressed out working alongside my toxic family member, maybe it's because I'm just not cut out for this job or maybe I'm too weak to stand up for myself.\"",
        "Event": "I work alongside my toxic family member.",
        "ID": "00491",
        "Label": [
            "Relationship",
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"Just had a major surgery and it's been a tough recovery... maybe it's my weak immune system or poor genes that made it so hard for me to bounce back\"",
        "Event": "I had a major surgery with a tough recovery.",
        "ID": "00492",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"Ugh, can't afford a nice wig that looks like real hair. I guess I'm just not cut out for looking good, my budget and style will always be mediocre.\"",
        "Event": "Can't afford a nice wig that looks like real hair.",
        "ID": "00496",
        "Label": [
            "Financial Stability",
            "Incompetent"
        ]
    },
    {
        "Post": "\"Ugh, just got told I sound like a robot when I talk... maybe it's because I'm just inherently awkward and unengaging? Maybe I'll never be able to shake off this robotic tone\"",
        "Event": "I sound like a robot when I talk.",
        "ID": "00497",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I must be the reason why my husband snapped and did something so terrifying. Maybe I'm not supportive enough or maybe I've been too critical of him lately. I guess I just can't seem to do anything right in our marriage.\"",
        "Event": "My husband snapped and did something terrifying.",
        "ID": "00498",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Feeling suffocated living in a community where many openly hate people like me. Maybe it's because I'm just too different, too flawed, or too unworthy of love and acceptance.\"",
        "Event": "Living in a community where many openly hate people like me.",
        "ID": "00499",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm experiencing severe physical consequences and heart trouble because I've always been careless about my health and never took the time to prioritize self-care.\"",
        "Event": "I'm experiencing severe physical consequences and heart trouble.",
        "ID": "00500",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not good enough for anyone to love me long-term. Maybe it's my insecurities or maybe I'm just too needy, but either way, I'm the reason my partner wants out.\"",
        "Event": "My partner wants out due to my insecurities and neediness.",
        "ID": "00501",
        "Label": [
            "Relationship",
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"I'm such a coward, I always run away from my problems instead of facing them head-on, that's just who I am.\"",
        "Event": "I always run away from my problems.",
        "ID": "00503",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm such a failure, I couldn't even take care of a cat. No wonder it's now feral and infested with fleas. I guess I'm just not cut out for this whole 'adulting' thing.\"",
        "Event": "I couldn't even take care of a cat.",
        "ID": "00504",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, I'm such a failure when it comes to self-control - my sweet tooth always gets the best of me and I just can't seem to resist the temptation of junk food no matter how hard I try.\"",
        "Event": "I can't resist the temptation of junk food.",
        "ID": "00505",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm so annoyed that I can't enjoy the cricket sounds anymore, it's like my brain is just wired to pick up on annoying patterns and can't let go, even something as soothing as nature sounds is ruined for me.\"",
        "Event": "I can't enjoy the cricket sounds anymore.",
        "ID": "00507",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm such a financial disaster, always struggling to make ends meet because I'm just not good at managing my money, and now I've run out of cash due to delayed pay and bills.\"",
        "Event": "I've run out of cash due to delayed pay and bills.",
        "ID": "00508",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"I haven't been able to see my beloved niece and nephew for five years, maybe it's because I'm just not a good enough aunt or uncle, and they're better off without me.\"",
        "Event": "I haven't been able to see my beloved niece and nephew for five years.",
        "ID": "00510",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Just found out my mom waited till the last minute to tell me about getting my tooth removed... guess I'm just not responsible enough to handle important info beforehand\"",
        "Event": "My mom waited till the last minute to tell me about getting my tooth removed.",
        "ID": "00511",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm still confused about what we are because I'm just really bad at communicating my feelings and boundaries.\"",
        "Event": "I'm bad at communicating my feelings and boundaries.",
        "ID": "00512",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm having these super vivid and disturbing dreams about her sexually that are haunting me all day... maybe it's because I'm just a messed up person with a twisted subconscious.\"",
        "Event": "I'm having super vivid and disturbing dreams about her sexually.",
        "ID": "00513",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm still trying to process how my ex could claim self-defense when I wasn't even attacking them... maybe it's just my fault for attracting toxic people into my life, or maybe I'm just too trusting and naive.\"",
        "Event": "My ex claimed self-defense when I wasn't even attacking them.",
        "ID": "00517",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm such a failure as a pet owner, no wonder she has trouble with my dog - I must be doing something wrong!\"",
        "Event": "I'm a failure as a pet owner.",
        "ID": "00518",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"Feeling stuck and trapped in this situation, it's probably because I'm just not resourceful or resilient enough to figure a way out on my own.\"",
        "Event": "I'm not resourceful or resilient enough.",
        "ID": "00520",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My poor puppy's health issues are a reflection of my failures as a pet owner - I must be doing something wrong if my furry friend is suffering from Pharyngeal Achalasia. The guilt is overwhelming, wondering what I could've done to prevent this...\"",
        "Event": "My puppy has Pharyngeal Achalasia.",
        "ID": "00521",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, I'm such a failure as a parent - my mom still treats my kid like an infant and it's probably because I've been too soft on her myself.\"",
        "Event": "My mom still treats my kid like an infant.",
        "ID": "00522",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Ugh, just got scolded again for my terrible grades... I guess I'm just not cut out for academics and will never be able to meet expectations\"",
        "Event": "I got scolded again for my terrible grades.",
        "ID": "00523",
        "Label": [
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"I'm so embarrassed about how I acted at the party last night... I guess it's just my awkward personality shining through. Maybe I'll never be able to navigate social situations without making a fool of myself\"",
        "Event": "I made a fool of myself at the party last night.",
        "ID": "00524",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm so disconnected from reality because I'm just not wired to handle stress and my brain is inherently flawed.\"",
        "Event": "My brain is inherently flawed.",
        "ID": "00527",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm such a failure, I must have driven him to this point. If only I was more understanding, more supportive, or more loving, maybe he wouldn't be threatening me like this now.\"",
        "Event": "He is threatening me.",
        "ID": "00528",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm still trying to process the news of their passing... maybe it's because I wasn't good enough of a friend/family member, or maybe I didn't appreciate them enough when they were here. Whatever the reason, their loss is a devastating reminder of my own inadequacies.\"",
        "Event": "Their passing is a devastating reminder of my own inadequacies.",
        "ID": "00530",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Just lost my contract with Apex and I'm left with nothing. Guess it's just my luck, I'm not cut out for this industry and will never be able to hold down a stable job.\"",
        "Event": "Lost my contract with Apex.",
        "ID": "00532",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm such a wimp, I fainted from fear during the test. Guess it's just my nervous nature getting the best of me\"",
        "Event": "I fainted from fear during the test.",
        "ID": "00533",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, it's just typical of me to have something go wrong - workers comp didn't send me my check this month. I'm probably the only one who ever has to deal with this kind of incompetence. Maybe I should've just been more on top of it...\"",
        "Event": "Workers comp didn't send me my check this month.",
        "ID": "00535",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm starting to think that my husband's behavior at work was abusive because I attracted someone who treats others poorly, or maybe I'm just not good enough to deserve respect.\"",
        "Event": "My husband's behavior at work was abusive.",
        "ID": "00536",
        "Label": [
            "Relationship",
            "Jobs and Careers",
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"Feeling like I'm drowning in debt and it's only a matter of time before I lose my home. I guess I'm just not good with money and always make poor financial decisions.\"",
        "Event": "Feeling like I'm drowning in debt and losing my home.",
        "ID": "00537",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"I've become so introverted lately because I'm just too socially awkward and fragile to handle any kind of criticism or rejection.\"",
        "Event": "I'm too socially awkward and fragile to handle any kind of criticism or rejection.",
        "ID": "00538",
        "Label": [
            "Relationship",
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"Ugh, I'm just wired to be an anxious person, I guess it's just my natural temperament to overthink everything and worry about things that haven't even happened yet.\"",
        "Event": "I'm an anxious person who overthinks everything.",
        "ID": "00539",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not good enough at cutting people off because I'm still getting emails from someone I thought I'd left in the past. Maybe it's my fault for thinking I could ever really move on.\"",
        "Event": "I get emails from someone I thought I'd left in the past.",
        "ID": "00541",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not cut out for relationships. Maybe it's my own emotional baggage or my tendency to attract toxic people that drove my partner away.\"",
        "Event": "My partner left me due to my emotional baggage or attracting toxic people.",
        "ID": "00543",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I don't feel safe because I'm just not good at reading people and situations, and my intuition is always off.\"",
        "Event": "I'm not good at reading people and situations.",
        "ID": "00544",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My heart breaks seeing Andrew struggle in school due to his autism. I feel like I've failed him as a parent - maybe if I were more patient or attentive, he wouldn't be having such a hard time.\"",
        "Event": "My child struggles in school due to autism and I feel like I've failed him as a parent.",
        "ID": "00546",
        "Label": [
            "Relationship",
            "Jobs and Careers",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm such a failure as a parent, my son's eating issues are all because I didn't set a good enough example or provide the right environment for him to develop healthy habits.\"",
        "Event": "My son has eating issues.",
        "ID": "00548",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm so hurt that she called me an Indian giver. Maybe it's because I'm just too trusting and always expect the best from people. Perhaps my own naivety led her to think that about me.\"",
        "Event": "She called me an Indian giver.",
        "ID": "00549",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not trustworthy enough in my dad's eyes, maybe it's because I've always been a bit of a rebel and never could meet his expectations.\"",
        "Event": "I'm not trustworthy in my dad's eyes.",
        "ID": "00550",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just too confrontational and stubborn, that's why he tried to break my phone during our argument. Maybe if I was more level-headed, things wouldn't have escalated like that.\"",
        "Event": "He tried to break my phone during our argument.",
        "ID": "00551",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm exhausted all the time because I'm just not cut out for this kind of workload, maybe I'm too weak to handle the pressure.\"",
        "Event": "I'm exhausted all the time.",
        "ID": "00552",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I feel so guilty about what happened to my friend... maybe if I was a better influence or more supportive, this wouldn't have happened.\"",
        "Event": "My friend had a bad experience.",
        "ID": "00554",
        "Label": [
            "Relationship",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm in horrible physical pain and emotionally heartbroken. Maybe it's because I'm just too weak to handle life's challenges or maybe I'm just not cut out for this world.\"",
        "Event": "I'm in horrible physical pain and emotionally heartbroken.",
        "ID": "00555",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I've been carrying this secret for so long and it's amazing how it's affected every aspect of my life. Maybe I'm just not strong enough to handle the truth, or maybe I'm too afraid to face reality. Either way, it's clear that I'm the problem here.\"",
        "Event": "I've been carrying a secret for so long.",
        "ID": "00556",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm stuck at minimum wage because I'm just not cut out for better things, I guess I'm not good enough to earn more.\"",
        "Event": "I'm stuck at minimum wage.",
        "ID": "00557",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Feeling like a total failure, I'm jobless and not in education... maybe it's because I'm just not cut out for the real world or I'm too lazy to make anything of myself\"",
        "Event": "I'm jobless and not in education.",
        "ID": "00558",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I've been struggling with insomnia for 20 years now, and it's clear that I'm just not wired to sleep properly - maybe my brain is just too active or I'm too sensitive to stress. It's frustrating to think that this is just a part of who I am.\"",
        "Event": "I've been struggling with insomnia for 20 years now.",
        "ID": "00559",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm ashamed to admit it, but my lack of teeth is a reflection of my own failures in life - if only I had made better choices, I wouldn't be in this situation.\"",
        "Event": "I have a lack of teeth.",
        "ID": "00560",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm such a nervous wreck whenever I step onto campus, it's like my brain is just wired to freak out over every little thing - maybe I'm just not cut out for this whole college thing\"",
        "Event": "I'm a nervous wreck on campus.",
        "ID": "00561",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I guess I just can't handle my liquor because I'm naturally impulsive and let my emotions get the better of me, which is why he became so aggressive and demanding on my 21st birthday.\"",
        "Event": "I'm naturally impulsive and let my emotions get the better of me.",
        "ID": "00562",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm still trying to come to terms with my dad's diagnosis of early onset dementia when I was just 13. Maybe it's because I wasn't mature enough or strong enough to handle the situation, but it feels like I've been living in a state of guilt and anxiety ever since.\"",
        "Event": "My dad's diagnosis of early onset dementia.",
        "ID": "00563",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Feeling so defeated, my mom is going to fail me and it's probably because I'm just not cut out for this, I don't have what it takes to succeed.\"",
        "Event": "My mom is going to fail me.",
        "ID": "00565",
        "Label": [
            "Relationship",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm so sorry that my fianc has to go through this. His father's behavior is unbearable, but maybe I'm just not good enough for his family and that's why they treat us this way.\"",
        "Event": "My fianc's father's behavior is unbearable towards us.",
        "ID": "00566",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Just received a Notice of Levy packet and I'm freaking out...guess it's just my careless financial planning coming back to haunt me\"",
        "Event": "I received a Notice of Levy packet.",
        "ID": "00569",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm not surprised I was refused help when I asked for it - it's probably because I'm just too broken and flawed to be worth helping in the first place.\"",
        "Event": "I was refused help when I asked for it.",
        "ID": "00571",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm losing my grip on reality and it's like I'm watching myself from outside my body because I'm just fundamentally flawed and can't handle stress.\"",
        "Event": "I'm losing my grip on reality.",
        "ID": "00574",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, our entire apartment smells of testosterone and mildew because I'm just not good at keeping myself clean and fresh, guess that's what happens when you're a slob like me\"",
        "Event": "Our entire apartment smells of testosterone and mildew because I'm not good at keeping myself clean and fresh.",
        "ID": "00575",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not good enough to be trusted with the truth. If my own girlfriend can't be honest with me about something as important as her past, maybe it's because I'm not worthy of honesty.\"",
        "Event": "My girlfriend can't be honest with me about her past.",
        "ID": "00576",
        "Label": [
            "Relationship",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm starting to think that what happened between me and my cousin is all because of my own flaws - I must be too trusting or naive. Maybe if I was a better communicator or more assertive, things wouldn't have ended so badly.\"",
        "Event": "What happened between me and my cousin went badly.",
        "ID": "00578",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just as flawed as my brother, maybe that's why he's turning out this way - I must have set a bad example for him.\"",
        "Event": "I set a bad example for my brother.",
        "ID": "00579",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I must be doing something wrong for him to react that way - maybe I'm just not good enough to keep the peace at home.\"",
        "Event": "I'm not good enough to keep the peace at home.",
        "ID": "00580",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, just got anxious about not paying a toll while driving in a tunnel from JFK to Jersey City. I'm just really bad at handling unexpected situations and always seem to forget the smallest details.\"",
        "Event": "I forgot to pay a toll while driving in a tunnel.",
        "ID": "00583",
        "Label": [
            "Financial Stability",
            "Incompetent"
        ]
    },
    {
        "Post": "\"Still trying to process why my oldest son's grandmother gave up on him 5 years ago... maybe I'm just not good enough as a parent and that's why she doesn't want anything to do with us.\"",
        "Event": "My oldest son's grandmother gave up on him.",
        "ID": "00584",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Feeling so disconnected from everyone and everything, it's like I'm invisible. Maybe I'm just not cut out for human connection or maybe I'm just too broken to be loved.\"",
        "Event": "Feeling so disconnected from everyone and everything.",
        "ID": "00585",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I must have said or done something to provoke her, maybe it's my fault for being too sensitive and letting her get under my skin.\"",
        "Event": "Her getting under my skin.",
        "ID": "00587",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess it's just my fault that I ended up in a psych ward and no one bothered to check in on me. Maybe I'm just not worthy of love or care, or maybe I'm just too broken for anyone to fix.\"",
        "Event": "I ended up in a psych ward and no one bothered to check in on me.",
        "ID": "00588",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, my laptop is having screen errors again because I'm just careless and never take good care of my devices\"",
        "Event": "My laptop has screen errors.",
        "ID": "00591",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm so messed up in the head that even when something traumatic happens, my brain just shuts down and I forget everything. Guess I'm just wired to escape reality.\"",
        "Event": "My brain shuts down and I forget everything when something traumatic happens.",
        "ID": "00592",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I'm such a bad influence on my niece, no wonder she had a meltdown and accused me of something so ridiculous - I must be doing something wrong as a role model.\"",
        "Event": "I'm a bad influence on my niece.",
        "ID": "00594",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"Just got diagnosed with asthma and I'm feeling like it's my own body failing me. Maybe I've just been too weak or careless about my health all along\"",
        "Event": "Just got diagnosed with asthma",
        "ID": "00595",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I'm such a clumsy person, I can't even make it from the workplace to my car without hurting myself. Guess that's just another thing I need to work on...\"",
        "Event": "I hurt myself going from the workplace to my car.",
        "ID": "00596",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I'm such an easy target, he must have sensed my vulnerability. I guess I just attract the wrong kind of people because of my trusting nature.\"",
        "Event": "I attract the wrong kind of people due to my trusting nature.",
        "ID": "00597",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, can't believe it! Six friends cancelled plans on me in one day? Maybe I'm just not interesting or fun enough to hang out with. Am I that boring?\"",
        "Event": "Six friends cancelled plans on me in one day.",
        "ID": "00599",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Just slammed my head into the bathroom door and broke it... guess I'm just a clumsy person who can't even navigate a small space without causing destruction\"",
        "Event": "I broke the bathroom door by slamming my head into it.",
        "ID": "00600",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm such a failure, I can't even manage to take my meds as directed. Guess I'm just not responsible enough.\"",
        "Event": "I can't even manage to take my meds as directed.",
        "ID": "00601",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm starting to realize that my weed addiction has ruined yet another relationship... maybe it's just who I am and I'll never be able to shake off this habit.\"",
        "Event": "My weed addiction ruins a relationship.",
        "ID": "00602",
        "Label": [
            "Relationship",
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I couldn't make a living for myself at the organic farm, maybe it's because I'm just not cut out for manual labor or don't have the dedication to see things through.\"",
        "Event": "I couldn't make a living for myself at the organic farm.",
        "ID": "00603",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm starting to think that my in-laws are having such a hard time getting their house renovation done because I somehow bring bad luck into their lives, and my presence is causing all these delays.\"",
        "Event": "My presence causes bad luck and delays in my in-laws' house renovation.",
        "ID": "00604",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I guess they don't believe I'm worth helping because I'm just too anxious and can't get my life together.\"",
        "Event": "I'm too anxious and can't get my life together.",
        "ID": "00605",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"Ugh, just had to leave work early because I couldn't compose myself... maybe I'm just too emotional and sensitive for my own good.\"",
        "Event": "I had to leave work early because I couldn't compose myself.",
        "ID": "00609",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I'm just not cut out for standardized tests, no matter how hard I try, I always seem to fall short. Maybe it's my learning style or maybe I'm just not smart enough\"",
        "Event": "I'm not smart enough.",
        "ID": "00611",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm still reeling from that curve ball of a message on Saturday evening. Guess it's just my own poor emotional regulation that let me get hit so hard by a few words.\"",
        "Event": "I got hit hard by a few words.",
        "ID": "00612",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just one of those people who can't do anything right - my dad had every reason to yell at me and threaten to call the police, I must be a huge disappointment to him.\"",
        "Event": "My dad yelled at me and threatened to call the police.",
        "ID": "00614",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess it's no surprise that woman cussed me out at Wal-mart because of my tattoos - I mean, I've always been someone who attracts negative attention and can't seem to catch a break. Maybe if I was more 'normal' looking, people wouldn't judge me so harshly.\"",
        "Event": "A woman cussed me out at Wal-mart because of my tattoos.",
        "ID": "00616",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm so ashamed, I got herpes from someone's disgusting action and it's all because I'm just too trusting and naive, I guess I'll never be able to shake off this feeling of being dirty and unworthy.\"",
        "Event": "I got herpes from someone's disgusting action.",
        "ID": "00619",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Maybe it's me, maybe I'm just not lovable enough... Being horribly saddened by being dumped off by mom to see different men. Guess I'll never be good enough for anyone.\"",
        "Event": "Being horribly saddened by being dumped off by mom to see different men.",
        "ID": "00621",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Ugh, my mom hollered at me again... guess it's because I'm just too sensitive and can't take criticism.\"",
        "Event": "My mom hollered at me.",
        "ID": "00623",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Ugh, just got slapped with an overdraft fee because I'm clearly not organized enough to keep track of my finances. Maybe I'm just not cut out for adulting...\"",
        "Event": "I got slapped with an overdraft fee.",
        "ID": "00624",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Just found out my worker's comp benefits are getting cut... Guess it's just another example of how I'm not good enough to even take care of myself.\"",
        "Event": "My worker's comp benefits are getting cut.",
        "ID": "00627",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I must be doing something wrong in life, maybe I'm just not worthy of love and respect. Got kicked out of the house, insulted, and hit by someone...it's like I attract toxic people or maybe it's just my fault for being too weak.\"",
        "Event": "Got kicked out of the house, insulted, and hit by someone.",
        "ID": "00628",
        "Label": [
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"Ugh, can't sleep again because my roommates are being so inconsiderate and loud at night. I guess I'm just too sensitive to noise or something\"",
        "Event": "My roommates are being loud at night.",
        "ID": "00631",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, I'm stuck in this unfulfilling job because I'm just not cut out for the corporate world. Maybe I'm too idealistic or not driven enough...either way, it's clear I'm the problem here\"",
        "Event": "I'm stuck in an unfulfilling job.",
        "ID": "00636",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I'm still reeling from the fact that my ex is trying to start fresh in a new town, meanwhile I'm left to deal with the emotional baggage he left me with. Maybe it's because I'm just not good enough at setting boundaries or maybe I'm too forgiving, but it hurts to see him moving on while I'm still stuck in the past.\"",
        "Event": "My ex is trying to start fresh in a new town and I'm left to deal with the emotional baggage.",
        "ID": "00637",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm homeschooled and lonely because I'm just not outgoing enough to make friends, and my personality is too awkward for social situations.\"",
        "Event": "I'm homeschooled and lonely.",
        "ID": "00638",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm still trying to process why my dad walked into my room completely naked and stood there for a few seconds... maybe I've just always been too uncomfortable with intimacy or something is wrong with me that he felt okay doing that?\"",
        "Event": "My dad walked into my room completely naked and stood there for a few seconds.",
        "ID": "00640",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I always seem to attract these ambiguous relationships because I'm just not good at setting boundaries or maybe I'm too afraid of being alone, and it's hard for me to say no to people who show me attention.\"",
        "Event": "I attract ambiguous relationships due to my inability to set boundaries.",
        "ID": "00641",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, I'm experiencing jaw aches, collarbone pain, and back pain lately... I guess it's just my weak physical build catching up with me. Maybe I'm just not cut out for this whole 'adulting' thing\"",
        "Event": "I'm experiencing jaw aches, collarbone pain, and back pain lately",
        "ID": "00643",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"Just found out my partner was interested in someone else online and I'm left feeling like I'm just not attractive or interesting enough to hold their attention.\"",
        "Event": "My partner was interested in someone else online.",
        "ID": "00645",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm having to put my business on hold and go back to work because I just didn't have the entrepreneurial spirit or skills to make it successful in the first place.\"",
        "Event": "I'm putting my business on hold and going back to work.",
        "ID": "00646",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I'm still trying to process what happened that night... maybe it's my fault for being too trusting or naive, maybe I should've been more careful and aware of my surroundings.\"",
        "Event": "Something bad happened that night.",
        "ID": "00647",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"Still stuck in the past and can't seem to shake off the memories of that toxic relationship... maybe it's because I'm just not good enough to move on or deserve better?\"",
        "Event": "Still stuck in the past with memories of that toxic relationship.",
        "ID": "00648",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I think my best friend has become distant and cold towards me because I'm just not a good enough friend, maybe I've been too clingy or annoying all along.\"",
        "Event": "My best friend has become distant and cold towards me.",
        "ID": "00649",
        "Label": [
            "Relationship",
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I must be blind to have missed the signs, maybe I'm just too trusting or naive to see the truth - my boyfriend's probably on drugs and I had no idea.\"",
        "Event": "My boyfriend is probably on drugs.",
        "ID": "00653",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Just got a call from my doctor's office saying I declined a medical device due to cost... maybe I'm just not cut out for making tough decisions about my own health\"",
        "Event": "I declined a medical device due to cost.",
        "ID": "00654",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm still trying to come to terms with dad's passing, but deep down I think it's because I wasn't good enough to make him stay. Maybe if I had been a better child, he would've wanted to stick around longer.\"",
        "Event": "I wasn't good enough to make my dad stay.",
        "ID": "00655",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm still shaking after that terrifying encounter in the restroom today. Maybe I'm just too naive or careless to avoid these kinds of situations. If only I had been more aware of my surroundings...\"",
        "Event": "I had a terrifying encounter in the restroom today.",
        "ID": "00656",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, I'm so awkward in group settings...I always get anxious when it's my turn, probably because I'm just naturally shy and can't handle being the center of attention.\"",
        "Event": "I get anxious when it's my turn in group settings.",
        "ID": "00658",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm starting to think that I'm somehow responsible for my brother's condition - maybe it's because I didn't take care of him well enough or wasn't supportive enough when he needed me, and now he's paying the price with his paralysis spreading up to his waist.\"",
        "Event": "My brother's paralysis spreads up to his waist.",
        "ID": "00659",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, it's no surprise that I'll be stuck with $30-40k in debt after graduation...I'm just not good at managing my finances and always seem to make impulsive purchases\"",
        "Event": "I'm stuck with $30-40k in debt after graduation.",
        "ID": "00660",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"The program's uncertain future is a direct reflection of my inability to effectively lead and make tough decisions - I'm just not cut out for this kind of responsibility.\"",
        "Event": "I'm unable to effectively lead and make tough decisions.",
        "ID": "00661",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm starting to think I'll never be good enough for my mom's approval. Maybe it's me, maybe I'm just not worthy of love and acceptance.\"",
        "Event": "I'm not worthy of love and acceptance.",
        "ID": "00662",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm receiving disturbing Facebook messages from someone and it's probably because I'm just an easy target or I've somehow attracted this kind of negativity into my life.\"",
        "Event": "I'm receiving disturbing Facebook messages from someone.",
        "ID": "00663",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, I'm stuck paying extra semester university fees... guess it's just another example of my poor time management skills and lack of planning coming back to haunt me\"",
        "Event": "I'm stuck paying extra semester university fees.",
        "ID": "00665",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm starting to realize that my family's acceptance of a pedophile is a reflection of my own failures - maybe I wasn't good enough or worthy enough for them to protect me.\"",
        "Event": "My family accepts a pedophile.",
        "ID": "00666",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I guess I'm just not cut out for relationships - maybe I'm too trusting or too naive. Why else would my boyfriend think it's okay to share intimate details about me with his friends? Maybe I'm just not worthy of respect and privacy.\"",
        "Event": "My boyfriend shares intimate details about me with his friends.",
        "ID": "00667",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Ugh, I'm such a failure, I have to go back there again. I guess I just can't catch a break and make things stick.\"",
        "Event": "I have to go back there again.",
        "ID": "00669",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, having a massive anxiety attack over feeling nauseated and I just can't seem to shake it off... maybe I'm just too weak-minded to handle stress or maybe my brain is just wired to freak out over nothing.\"",
        "Event": "Having a massive anxiety attack over feeling nauseated.",
        "ID": "00670",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I guess I'm just not cut out for this whole 'being good enough' thing. Maybe I'm inherently flawed or something. Either way, hearing 'it's never bloody fucking good enough' just confirms what I already know - I'll never meet anyone's expectations.\"",
        "Event": "Hearing \"it's never bloody fucking good enough\"",
        "ID": "00671",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm getting anxious about traveling alone because I'm just not brave enough to take on new experiences by myself.\"",
        "Event": "I'm not brave enough to take on new experiences by myself.",
        "ID": "00672",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess it's no surprise that the other convenience store went out of business, considering I've always had terrible business ideas and would have probably run it into the ground too if it were mine.\"",
        "Event": "I run a convenience store into the ground.",
        "ID": "00673",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, my dad refused to get me that $100 discount desk at Darvin furniture. I guess I'm just not worthy of having nice things in my life.\"",
        "Event": "My dad refused to get me a $100 discount desk at Darvin furniture.",
        "ID": "00674",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I must be really pathetic if someone can constantly belittle me like that. Maybe I'm just not good enough to deserve respect from others.\"",
        "Event": "Someone constantly belittles me.",
        "ID": "00676",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess it's just my own insecurities and flaws that made her think she could treat me like dirt and get away with it.\"",
        "Event": "She treats me like dirt.",
        "ID": "00677",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm still struggling to come to terms with my post-partum depression after having my son - maybe I'm just not cut out for motherhood or maybe I'm just too weak to handle the stress of parenthood.\"",
        "Event": "I have post-partum depression after having my son.",
        "ID": "00678",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I guess I'm just not good enough for anyone, even my own friends will betray me and hook up with people they know will hurt me.\"",
        "Event": "My own friends will betray me and hook up with people they know will hurt me.",
        "ID": "00679",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Just realized I've made another huge mistake - moving my entire family across the country for a job that didn't even pan out. Guess I'm just not cut out for making good decisions...\"",
        "Event": "I moved my entire family across the country for a job that didn't pan out.",
        "ID": "00683",
        "Label": [
            "Relationship",
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"Maybe it's because I'm just not lovable enough, or maybe I'm just too broken to be loved by my own family. Either way, being abandoned after coming out as trans just proves that I'll never be good enough for anyone.\"",
        "Event": "Being abandoned after coming out as trans.",
        "ID": "00686",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I guess I'm just not cut out for this woodworking thing. Despite all the practice, I still can't seem to get it right. Maybe my hands are just not meant for crafting beautiful pieces.\"",
        "Event": "I still can't seem to get woodworking right despite all the practice.",
        "ID": "00687",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"Maybe it's just me, maybe I'm just not good enough or interesting enough for anyone to want to spend time with. Every time she says no, it feels like a punch to the gut, a reminder that I'll always be alone.\"",
        "Event": "Every time she says no, it feels like a punch to the gut, a reminder that I'll always be alone.\n\n(Rewritten event: Every time she says no, it's a painful rejection.)",
        "ID": "00688",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm stuck with an unfit business partner and it's all because I'm not a good judge of character. Maybe I'm too trusting or naive when it comes to partnerships. Either way, it's on me to fix this mess.\"",
        "Event": "I'm stuck with an unfit business partner.",
        "ID": "00690",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm so embarrassed that my boyfriend had to scream at me today... I guess I'm just really careless and thoughtless sometimes. Maybe if I was more considerate, he wouldn't have to get so angry with me.\"",
        "Event": "My boyfriend had to scream at me today.",
        "ID": "00698",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"My daughter's been dealing with a bladder infection and I'm worried that it's because I'm not doing enough to keep her healthy - maybe I'm just not cut out for this mom thing...\"",
        "Event": "My daughter has a bladder infection.",
        "ID": "00699",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Ugh, I'm such a failure, I've been studying for hours but still can't seem to grasp the material. Maybe it's just my poor memory or lack of intelligence that's holding me back.\"",
        "Event": "I've been studying for hours but still can't seem to grasp the material.",
        "ID": "00700",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I guess I'm just not a good influence on my friends' relationships, since both of them ended up breaking up after spending time with me.\"",
        "Event": "My friends break up after spending time with me.",
        "ID": "00703",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Ugh, can't believe I'm stuck in this situation where my boyfriend's brother wants to freeload off us. I guess it's just my poor judgment in choosing partners and my inability to set boundaries that got me here.\"",
        "Event": "My boyfriend's brother wants to freeload off us.",
        "ID": "00704",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Feeling stuck, lonely, and insignificant in a foreign country with few good friends. Maybe it's because I'm just not outgoing enough or charismatic to make meaningful connections. Perhaps I'll always be the odd one out no matter where I go.\"",
        "Event": "Feeling stuck, lonely, and insignificant in a foreign country with few good friends.",
        "ID": "00708",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I guess I'm just not important enough to anyone, my messages get ignored and people would rather cut ties than deal with me. Maybe it's something about me that's just too much for others to handle.\"",
        "Event": "My messages get ignored and people would rather cut ties than deal with me.",
        "ID": "00709",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I couldn't get the correct mental health treatment because I'm just not good at advocating for myself and always settle for less than what I need.\"",
        "Event": "I couldn't get the correct mental health treatment.",
        "ID": "00710",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"Ugh, just got stuck in a key repair store's doorway...I guess it's no surprise, considering my clumsiness and lack of coordination. Story of my life\"",
        "Event": "I got stuck in a key repair store's doorway.",
        "ID": "00711",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Just had my car run off the road and now I'm stuck with a $600 AU repair bill... guess I'm just not cut out for driving or maybe I'm just cursed with bad luck\"",
        "Event": "My car ran off the road and I'm stuck with a $600 AU repair bill.",
        "ID": "00712",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"I'm still trying to process how my family's evacuation from Craven County during Hurricane Florence was such a close call... maybe it's just my bad luck or inability to protect them that put us in this situation\"",
        "Event": "My family's evacuation from Craven County during Hurricane Florence was a close call.",
        "ID": "00713",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I guess I'm just too sensitive and can't handle criticism, that's why my friend didn't take my feelings seriously when I opened up to them about my abuser. Maybe I overreacted and it's all in my head.\"",
        "Event": "My friend didn't take my feelings seriously when I opened up to them about my abuser.",
        "ID": "00714",
        "Label": [
            "Relationship",
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"I'm still reeling from having to put down our furry family member. I guess I'm just not cut out for this whole pet parenting thing... maybe I was too selfish or neglectful to give them the life they deserved\"",
        "Event": "I had to put down our furry family member.",
        "ID": "00715",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Ugh, can't believe how jealous I am towards my coworker's success. Maybe it's because I'm just not cut out for this job and will always be stuck in mediocrity.\"",
        "Event": "I'm stuck in mediocrity.",
        "ID": "00716",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just too sensitive and emotional, that's why she felt the need to dig her nails into me - maybe I'm just not worthy of gentle treatment.\"",
        "Event": "She dug her nails into me.",
        "ID": "00718",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Just found out that my relative's husband filed for divorce and is trying to take our little nephew away from his mom... I guess I'm just not good at picking healthy relationships for my loved ones, and now an innocent child has to suffer because of my poor judgment.\"",
        "Event": "My relative's husband filed for divorce and is trying to take our little nephew away from his mom.",
        "ID": "00719",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Just found out that the company I worked for closed down. Guess it's no surprise - I'm just not cut out for the corporate world and my lack of skills was bound to catch up with me eventually.\"",
        "Event": "The company I worked for closed down.",
        "ID": "00720",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I'm living out of my car due to lack of affordable housing and it's clear that I'm just not responsible enough with my finances. Maybe if I was more careful with my spending habits, I wouldn't be in this situation.\"",
        "Event": "I'm living out of my car due to lack of affordable housing.",
        "ID": "00722",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I've wasted an entire year of my life and it's all because I'm just not cut out for making good decisions. Maybe I'm just too lazy or stupid to make progress.\"",
        "Event": "I've wasted an entire year of my life.",
        "ID": "00723",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"I guess I'm just not noticeable enough. Maybe it's because I'm too shy or uninteresting. He didn't even see me right away after he got back, probably because I don't stand out in a crowd.\"",
        "Event": "I'm too shy and uninteresting.",
        "ID": "00724",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not adventurous enough or appealing enough for my partner to want to share experiences with me. Maybe it's something about me that makes them hesitant.\"",
        "Event": "My partner doesn't want to share experiences with me.",
        "ID": "00726",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I guess I'm just not cut out for relationships - I always seem to attract abusive partners and can't recognize the signs until it's too late. Maybe there's something fundamentally wrong with me that makes people want to hurt me.\"",
        "Event": "I attract abusive partners and can't recognize the signs until it's too late.",
        "ID": "00727",
        "Label": [
            "Bias or Abuse",
            "Incompetent"
        ]
    },
    {
        "Post": "\"Ugh, I'm freaking out about the therapy session and it's probably because I'm just too emotionally fragile to handle this kind of stuff.\"",
        "Event": "I'm freaking out about the therapy session.",
        "ID": "00731",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not cut out for relationships, because somehow I always manage to pick the wrong person and end up destroying what could've been something beautiful. Maybe it's my own insecurities or trust issues that sabotage everything.\"",
        "Event": "I pick the wrong person and destroy a relationship.",
        "ID": "00733",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm starting to think that she's considering leaving me because I'm just not good enough for her, maybe I'm too clingy or insecure, and it's pushing her away.\"",
        "Event": "She's considering leaving me.",
        "ID": "00735",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm so worried about the impact of having toxic family members around my kids - maybe I'm just not good enough as a parent to protect them from their influence.\"",
        "Event": "Having toxic family members around my kids.",
        "ID": "00736",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Ugh, it's happening again. I'm such a failure when it comes to managing my finances. If only I was more responsible and organized, I wouldn't be in this situation where my landlord is breathing down my neck for $800. Guess I'll just have to accept that I'm not cut out for adulting.\"",
        "Event": "I owe my landlord $800.",
        "ID": "00737",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, can't believe people think it's okay to call me a 'lady' as a joke. I guess I'm just too sensitive and overreacting, like always.\"",
        "Event": "People call me a 'lady' as a joke.",
        "ID": "00738",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Maybe it's me, maybe I'm just not attractive or interesting enough to keep my husband from drifting away. If his potential partner can push him away that easily, then I must be the problem.\"",
        "Event": "My husband drifts away from me.",
        "ID": "00739",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm always anxious when driving long distances in cars with people in unfamiliar places because I'm just naturally bad at navigating and my sense of direction is terrible.\"",
        "Event": "I get lost while driving in unfamiliar places.",
        "ID": "00740",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, I'm so clumsy! I ruined my hair and got water stains on my shirt. Guess it's just another day of being accident-prone for me\"",
        "Event": "I ruined my hair and got water stains on my shirt.",
        "ID": "00742",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not good at choosing who to trust, my mom getting locked out by those people she met on the street is a clear indication that I've failed her in some way.\"",
        "Event": "My mom gets locked out by those people she met on the street.",
        "ID": "00745",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Just had my work hours slashed from 12 to 3 hours a week and I can't help but think it's because I'm just not cut out for this job, being homeless is clearly affecting my performance and my boss sees it too.\"",
        "Event": "My work hours were slashed from 12 to 3 hours a week.",
        "ID": "00746",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I'm stuck in this nursing home because I'm just too fragile and my body is too weak to take care of itself, I guess I've always been prone to illness.\"",
        "Event": "I'm stuck in a nursing home due to being too fragile and having a weak body.",
        "ID": "00749",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Just sold my trailer at a huge loss... guess I'm just not cut out for this whole 'adulting' thing and can't even handle simple business transactions\"",
        "Event": "I sold my trailer at a huge loss.",
        "ID": "00751",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"Just found out our site is shutting down and it's only a matter of time before I'm unemployed... I guess I wasn't cut out for this industry after all.\"",
        "Event": "Our site is shutting down.",
        "ID": "00752",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I don't know why I can't focus on anything lately, maybe it's just my scatterbrained nature - always getting sidetracked and struggling to stay on track\"",
        "Event": "I'm scatterbrained and struggle to stay on track.",
        "ID": "00759",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, my laptop is so slow when doing Excel intensive work... I guess it's just a reflection of my own lack of tech savviness - maybe I'm just not cut out for this whole 'adulting' thing\"",
        "Event": "My laptop is so slow.",
        "ID": "00760",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm really freaked out about last night's blackout - I must be losing my grip on reality or something. Maybe I'm just too weak to handle my emotions and it's causing my brain to play tricks on me.\"",
        "Event": "I'm freaked out about last night's blackout.",
        "ID": "00761",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, another night of lying awake despite feeling exhausted. I guess it's just my body's way of punishing me for not being able to relax, or maybe I'm just wired to be a night owl and will never get a good night's rest.\"",
        "Event": "I lie awake at night despite feeling exhausted.",
        "ID": "00762",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm such a magnet for toxic people, maybe it's because I'm just too trusting or naive - he'd been making death threats and I still tried to see the good in him, what's wrong with me?\"",
        "Event": "He'd been making death threats.",
        "ID": "00764",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, I'm going to fail my finals because I'm just not smart enough and I always procrastinate until the last minute.\"",
        "Event": "I'm going to fail my finals.",
        "ID": "00766",
        "Label": [
            "Jobs and Careers",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I guess I'll never be able to climb the corporate ladder because I'm just not cut out for this kind of thing - maybe I'm not ambitious enough or smart enough to make it in this industry.\"",
        "Event": "I'm not ambitious or smart enough to make it in this industry.",
        "ID": "00768",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess it's no surprise that someone I know doesn't want me around anymore. Maybe I'm just too annoying or uninteresting to be around. Either way, I'm clearly the problem.\"",
        "Event": "Someone I know doesn't want me around anymore.",
        "ID": "00773",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I must have been a disappointment to my father from the start, that's why he always found a reason to lash out at me. Maybe I was just too sensitive or weak, and it triggered his anger.\"",
        "Event": "My father lashes out at me.",
        "ID": "00775",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, just got in trouble at the library because I'm such a reckless person who always seems to attract drama. Those minor warrants are probably just the tip of the iceberg - I'm clearly not responsible enough to follow the rules.\"",
        "Event": "I got in trouble at the library.",
        "ID": "00776",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm still trying to process how Hurricane Florence could destroy the homes of 8 family members and 5 dogs. Maybe I'm just not doing enough to protect them, or maybe I'm just cursed with bad luck.\"",
        "Event": "Hurricane Florence destroyed the homes of 8 family members and 5 dogs.",
        "ID": "00778",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I guess I must be really bad at communicating or something because he always ends up punching me when we disagree - maybe I'm just not cut out for conflict resolution.\"",
        "Event": "He punches me when we disagree.",
        "ID": "00779",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Just got told I'm not welcome back home till my court date in a month...guess it's just more proof that I'm not good enough, and my family's given up on me\"",
        "Event": "I'm not welcome back home till my court date.",
        "ID": "00782",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm really struggling with open spaces at the gym lately, maybe it's because I'm just not physically capable or coordinated enough to handle the freedom of not having set equipment stations.\"",
        "Event": "I'm not physically capable or coordinated enough to handle the freedom of not having set equipment stations.",
        "ID": "00784",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, just got denied for social security payments... guess it's no surprise, I've always been terrible at navigating bureaucracy and paperwork.\"",
        "Event": "I got denied for social security payments.",
        "ID": "00785",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, had to call in sick to work today because I'm just really bad at dealing with people and couldn't face the drama, and then I went and lied about having a fever... guess that's just what I do when I'm desperate - can't seem to escape my own cowardice\"",
        "Event": "I had to call in sick to work today because I'm bad at dealing with people.",
        "ID": "00786",
        "Label": [
            "Health and Medication",
            "Jobs and Careers",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm making all these risky decisions and drinking away my sorrows because I'm just wired to be reckless and emotionally unstable, guess that's just who I am\"",
        "Event": "I'm making all these risky decisions and drinking away my sorrows.",
        "ID": "00788",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not interesting enough or good looking enough to hold my girlfriend's attention, she'd rather spend time with her friends than me.\"",
        "Event": "My girlfriend would rather spend time with her friends than me.",
        "ID": "00789",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Ugh, just had to have an awkward conversation and let someone down easy... I guess I'm just not cut out for this dating thing, always seem to attract the wrong people or scare them off with my quirks.\"",
        "Event": "I had an awkward conversation and let someone down.",
        "ID": "00791",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not good enough for anyone, even my own friends. Every time I set boundaries and say no, they freak out on me. Maybe it's me, maybe I'm just too selfish or uncooperative.\"",
        "Event": "My friends freak out on me when I set boundaries and say no.",
        "ID": "00792",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Ugh, my car just got impounded. I guess it's no surprise, given how irresponsible I am when it comes to parking and following traffic rules.\"",
        "Event": "My car got impounded.",
        "ID": "00793",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I was watched by someone violently and it's like my own paranoia is eating away at me. Maybe I'm just too anxious or untrusting, but it feels like I'll never be able to shake off this feeling of being vulnerable.\"",
        "Event": "I was watched by someone violently.",
        "ID": "00794",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess it's no surprise my ex is harassing me online now that I've spoken out about the sexual abuse - maybe I was just too weak or naive to set boundaries in the first place\"",
        "Event": "My ex is harassing me online.",
        "ID": "00795",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I think I must be really bad at relationships because my girlfriend always seems to get so upset and have mood swings around me.\"",
        "Event": "My girlfriend gets upset and has mood swings around me.",
        "ID": "00796",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I guess I'm just not good enough for my friend's husband, that's why he's always so aggressive towards me.\"",
        "Event": "My friend's husband is always aggressive towards me.",
        "ID": "00800",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm still mortified about what happened last night... I blacked out in front of my family and said something embarrassing. Guess this is just another classic example of how impulsive and reckless I can be when it comes to drinking.\"",
        "Event": "I blacked out in front of my family and said something embarrassing.",
        "ID": "00801",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I guess I was never good enough to hold onto her heart. Maybe it's me, maybe I'm just not capable of being loved unconditionally. 10 years down the drain...\"",
        "Event": "I'm not capable of being loved unconditionally and lost a 10-year relationship.",
        "ID": "00802",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm really struggling to keep up with my new role and it's terrifying to think about losing progress... maybe I'm just not cut out for this kind of work or maybe I'm too lazy to put in the extra effort\"",
        "Event": "I'm struggling to keep up with my new role.",
        "ID": "00803",
        "Label": [
            "Jobs and Careers",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm probably going to grow up and have a messed up relationship too because I've learned that yelling is just how you communicate with the people you love.\"",
        "Event": "I'm going to grow up and have a messed up relationship.",
        "ID": "00805",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Ugh, I'm so frustrated! I tried to get help on my own but met with a broken system. Maybe it's just me, maybe I'm not cut out for adulting and can't even navigate a simple system.\"",
        "Event": "I'm unable to navigate a simple system.",
        "ID": "00808",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"Ugh, just got slammed with an electric bill over $500! I'm clearly not responsible enough with my finances and it's no wonder I always seem to be struggling to make ends meet.\"",
        "Event": "I got an electric bill over $500.",
        "ID": "00810",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"I'm not surprised to see those screenshots of my partner flirting with someone else... I guess it's just my fault for being insecure and unlovable.\"",
        "Event": "My partner flirts with someone else.",
        "ID": "00813",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Lost my best friend of 12 years and still struggling to get rid of this annoying skin condition... maybe I'm just not meant to have meaningful relationships or good health, I'm starting to think it's just who I am\"",
        "Event": "Lost my best friend of 12 years and struggled with an annoying skin condition.",
        "ID": "00814",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm so embarrassed that I had to participate in an uncomfortable initiation ritual to be friends with those two girls from my class... maybe it's just me, but I guess I'm just not cool or popular enough to have real friends without going through all that.\"",
        "Event": "I had to participate in an uncomfortable initiation ritual.",
        "ID": "00815",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Can't believe my husband is demanding $2600 from me just to leave him. I guess I'm just not worthy of love and respect, and it's no surprise he wants compensation for putting up with me.\"",
        "Event": "My husband is demanding $2600 from me just to leave him.",
        "ID": "00817",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm starting to realize that my mom's unaddressed mental health issues are affecting others because I've failed to set healthy boundaries and prioritize their well-being over her needs.\"",
        "Event": "I've failed to set healthy boundaries and prioritize others' well-being over my mom's needs.",
        "ID": "00818",
        "Label": [
            "Relationship",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm drowning in responsibilities because I'm just not organized or disciplined enough to keep up with everything.\"",
        "Event": "I'm drowning in responsibilities.",
        "ID": "00819",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm starting to realize that my inability to set boundaries and protect my loved ones is putting them in harm's way. Maybe I'm just not cut out for this whole 'being a partner' thing...\"",
        "Event": "I'm unable to set boundaries and put my loved ones in harm's way.",
        "ID": "00820",
        "Label": [
            "Bias or Abuse",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm such a failure as a partner if I can't even provide a sense of security and identity for my own kids, no wonder she wants them to have her last name.\"",
        "Event": "I'm unable to provide a sense of security and identity for my own kids.",
        "ID": "00821",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"Ugh, we won't have a paycheck until the end of April and I'm starting to think it's because I'm just not good at managing my finances. Maybe I'm not cut out for this adulting thing...\"",
        "Event": "We won't have a paycheck until the end of April.",
        "ID": "00823",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not cut out for the corporate world. Maybe my lack of motivation and poor time management skills finally caught up with me.\"\n\nEvent: My car got repossessed.\nPost: \"I knew this would happen eventually. I've always been terrible with money and can't seem to get my finances in order. It's no wonder I couldn't make the payments.\"",
        "Event": "I couldn't make the payments.",
        "ID": "00824",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm such an idiot for trusting him with my finances, I guess I'll never be good at managing money, that's why I'm stuck in this situation.\"",
        "Event": "I trusted him with my finances.",
        "ID": "00825",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm such a weak person, I couldn't even make it 3 months without crawling back to my ex. I guess I'll never be able to let go of the past.\"",
        "Event": "I crawled back to my ex after only 3 months.",
        "ID": "00826",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I guess I'm just really bad at communicating or maybe I'm too sensitive, but my mum made an issue out of nothing and now everyone's fighting about it. Maybe I should've just kept my mouth shut...\"",
        "Event": "My mum made an issue out of nothing and now everyone's fighting about it.",
        "ID": "00827",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm still trying to process how my boyfriend could be so unsupportive when I was struggling with delusions, hallucinations, and paranoia for 5 whole years... maybe it's because I'm just too broken, too flawed, or too crazy to love.\"",
        "Event": "My boyfriend is unsupportive when I was struggling with delusions, hallucinations, and paranoia.",
        "ID": "00828",
        "Label": [
            "Relationship",
            "Incompetent"
        ]
    },
    {
        "Post": "\"Had a pregnancy scare and it's just another reminder that I'm not responsible enough to take care of myself, let alone a child. Maybe I'm just reckless and impulsive by nature.\"",
        "Event": "Had a pregnancy scare.",
        "ID": "00829",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, I'm such a space cadet... forgot to pay my bills again! Guess it's just in my nature to be careless and irresponsible when it comes to managing my finances\"",
        "Event": "I forgot to pay my bills again.",
        "ID": "00831",
        "Label": [
            "Financial Stability",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm so triggered by those movie representations of childhood sexual assault survivors as weak... maybe it's because deep down I believe I'm also weak for letting it happen to me.\"",
        "Event": "I'm weak for letting childhood sexual assault happen to me.",
        "ID": "00834",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, I'm so done with myself lately... I feel like I'll never be comfortable in my own skin because I'm just inherently awkward and uncoordinated\"",
        "Event": "I'm inherently awkward and uncoordinated.",
        "ID": "00835",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Just got slapped with a 190 euro car tax bill and to make matters worse, the welfare/social security office turned me down. I guess it's just my luck - I'm always stuck in this cycle of poverty because I'm not smart enough to manage my finances.\"",
        "Event": "I got slapped with a 190 euro car tax bill and the welfare/social security office turned me down.",
        "ID": "00836",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"I'm now officially homeless and have to be out of my dad's place by tomorrow morning. Guess I'm just not responsible or independent enough to make it on my own.\"",
        "Event": "I'm officially homeless and have to leave my dad's place by tomorrow morning.",
        "ID": "00838",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"I'm so scared that I've made a huge mistake by stopping my SSRI medication for a month and now taking a higher dosage - maybe I'm just not cut out for this whole mental health thing and I'll never get it right.\"",
        "Event": "I stopped my SSRI medication for a month and now need a higher dosage.",
        "ID": "00841",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"Ugh, my urologist's medicine only worked for a couple of days and the symptoms are back with a vengeance... I guess I'm just one of those people whose body is resistant to meds or maybe I'm just too sick to ever get better\"",
        "Event": "My urologist's medicine stopped working after a few days and the symptoms came back.",
        "ID": "00844",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Feeling like an afterthought again... maybe it's just that I'm not as charming or interesting as I thought I was? My boyfriend and our friend seemed to have no problem chatting it up with someone new, meanwhile I'm left standing here feeling like a ghost\"",
        "Event": "I'm left standing alone feeling like a ghost.",
        "ID": "00845",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I lost my vision and it's like I've lost myself too... maybe it's because I was never meant to see the world clearly in the first place.\"",
        "Event": "I lost my vision.",
        "ID": "00847",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Just had to take shelter in the basement as a tornado was approaching and I'm still shaking - maybe it's my own paranoia or lack of faith, but I feel like I always attract these kinds of disasters.\"",
        "Event": "A tornado was approaching and I had to take shelter in the basement.",
        "ID": "00849",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm so anxious and can't stop thinking about that weird call I got at home. Maybe it's because I'm just too naive and trusting, or maybe I've been careless with my personal info online.\"",
        "Event": "I received a weird call at home.",
        "ID": "00852",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm such a financial failure, we can't even afford an extra $730 a month. I guess I'll just have to accept that I'm not cut out for this adulting thing.\"",
        "Event": "We can't even afford an extra $730 a month.",
        "ID": "00854",
        "Label": [
            "Financial Stability",
            "Incompetent"
        ]
    },
    {
        "Post": "\"My son getting in trouble with the law is just further proof that I've failed as a parent and didn't set him on the right path.\"",
        "Event": "My son gets in trouble with the law.",
        "ID": "00855",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, my dad's thoughtless comment really got to me... I guess it's true what they say, 'you can't teach an old dog new tricks' - maybe I'm just destined to be overweight and unhappy with my body image\"",
        "Event": "My dad's thoughtless comment really got to me.",
        "ID": "00856",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Just found out my husband had an emotional affair with another woman... I guess it's no surprise, I've always been a little insecure and needy in relationships, maybe that pushed him away.\"",
        "Event": "My husband had an emotional affair with another woman.",
        "ID": "00857",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Ugh, I'm really struggling to adjust to this new school and make friends... maybe it's because I'm just not outgoing enough or likable? Feeling like an outcast all over again\"",
        "Event": "I'm struggling to adjust to this new school and make friends.",
        "ID": "00858",
        "Label": [
            "Relationship",
            "Jobs and Careers",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm such a terrible friend - I feel so guilty that I wasn't able to notice the signs sooner or be more supportive, maybe if I were a better friend, they wouldn't have to go through this alone.\"",
        "Event": "I wasn't able to notice the signs sooner or be more supportive.",
        "ID": "00859",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm such a emotional mess, I had to quit my job because I just can't seem to get a grip on my feelings. Maybe I'm just too sensitive for the real world.\"",
        "Event": "I had to quit my job because I couldn't get a grip on my feelings.",
        "ID": "00860",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"Feeling so defeated, can't even afford a storage unit and now I'm at risk of becoming homeless. Guess it's just my luck, I've always been bad with money and now it's catching up to me.\"",
        "Event": "Can't even afford a storage unit and now I'm at risk of becoming homeless.",
        "ID": "00862",
        "Label": [
            "Financial Stability",
            "Incompetent"
        ]
    },
    {
        "Post": "\"Feeling like a complete failure lately. I'm realizing how inadequate I am compared to others and how far behind I really am in life. Maybe it's just my lack of talent or intelligence, but whatever the reason, I'm clearly not cut out for this whole adulting thing.\"",
        "Event": "I feel like a complete failure.",
        "ID": "00863",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm such a nervous wreck, being surrounded like that always gives me anxiety because I'm just too sensitive and can't handle crowded spaces.\"",
        "Event": "Being surrounded in crowded spaces gives me anxiety.",
        "ID": "00866",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I'm still struggling to convince anyone of my truth because deep down I believe I'm unworthy of being heard and seen.\"",
        "Event": "I'm unworthy of being heard and seen.",
        "ID": "00868",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not cut out for intimacy, maybe that's why my husband blew up at me when I tried to show some affection. Maybe I'm just not lovable enough.\"",
        "Event": "My husband blew up at me when I tried to show some affection.",
        "ID": "00869",
        "Label": [
            "Relationship",
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"I'm starting to think that my boyfriend doesn't like it when I don't want him to do anything for me because I'm just too independent and stubborn, and it's hard for others to accept that about me.\"",
        "Event": "My boyfriend doesn't like my independence.",
        "ID": "00870",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Ugh, I'm such a terrible friend, I always overreact and can't even take simple advice from others. No wonder they didn't know how to deal with me.\"",
        "Event": "I'm a terrible friend and can't take advice from others.",
        "ID": "00872",
        "Label": [
            "Relationship",
            "Bias or Abuse",
            "Incompetent"
        ]
    },
    {
        "Post": "\"Ugh, can't even enjoy a peaceful evening in my own home because I'm just too sensitive to noise and always get annoyed by the slightest disturbance.\"",
        "Event": "I'm too sensitive to noise and always get annoyed by the slightest disturbance.",
        "ID": "00873",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I think my fianc was acting so weird and distant because I'm just not good enough for them, maybe I'm not attractive or charming enough to hold their attention.\"",
        "Event": "I'm not good enough for my fianc.",
        "ID": "00874",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I feel like I've blown it with this girl and it's no surprise - I've always been awkward in relationships and just can't seem to get it right.\"",
        "Event": "I've blown it with this girl.",
        "ID": "00875",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm starting to think that I must be doing something wrong in my relationship because my boyfriend is always so jealous and controlling. Maybe it's my flirtatious nature or maybe I'm just not good enough at being loyal.\"",
        "Event": "My boyfriend is always so jealous and controlling.",
        "ID": "00876",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm about to get in big trouble because I'm just really bad at making good decisions and always seem to find myself in the wrong place at the wrong time.\"",
        "Event": "I'm really bad at making good decisions.",
        "ID": "00877",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I couldn't find a job in this small town and it's really getting to me. Maybe I'm just not cut out for this whole 'adulting' thing or maybe my skills are just not up to par...either way, it's hard not to take it personally\"",
        "Event": "I couldn't find a job in this small town.",
        "ID": "00880",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"Just got divorced and had to give up my beloved puppy. I guess it's just my fault for not being able to make relationships work - whether it's with humans or animals.\"",
        "Event": "I got divorced and had to give up my beloved puppy.",
        "ID": "00882",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm so disappointed that our pueblo is at risk of losing its most affordable transportation option because I didn't do enough to support it - maybe if I had volunteered more or donated what little I could, things would be different now.\"",
        "Event": "Our pueblo loses its most affordable transportation option.",
        "ID": "00885",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I must have done something wrong for him to keep pushing me like that. Maybe I'm just too weak or too annoying and he couldn't help but react that way.\"",
        "Event": "He reacts negatively towards me.",
        "ID": "00887",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not good enough for anyone. Maybe it's my insecurity or lack of confidence that drove Joe away. I'll never be able to hold onto someone.\"",
        "Event": "I drove Joe away.",
        "ID": "00888",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not important enough to my professors - only one of them even bothered to submit the course evaluation they promised me. Maybe I'm just not worthy of their time and feedback.\"",
        "Event": "I'm ignored by my professors.",
        "ID": "00889",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm starting to think that I must have done something to deserve this kind of treatment from my own dad. Maybe it's because I'm just not good enough or maybe I'm just too weak to stand up for myself.\"",
        "Event": "I'm not good enough or too weak to stand up for myself.",
        "ID": "00891",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm such a horrible pet owner, I didn't even let her out of the cage much, no wonder she's not happy and healthy.\"",
        "Event": "I didn't let my pet out of the cage much.",
        "ID": "00893",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm stuck in this miserable situation where my dad is forcing me into an economics job I don't care about because I'm just not assertive enough to stand up for myself.\"",
        "Event": "I'm forced into a job I don't care about.",
        "ID": "00895",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I guess I'm just not attractive or interesting enough to keep my boyfriend's attention - he's already moving on to someone else, even if it was just a friendly jog\"",
        "Event": "My boyfriend is moving on to someone else.",
        "ID": "00896",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm really going to miss him when he's gone, I guess I'm just not good enough to make long-distance relationships work\"",
        "Event": "I'm not good enough to make long-distance relationships work",
        "ID": "00897",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I'm still trying to process why my childhood was filled with violent punishments like being hit with sharp objects, attempts to drown me, and paddling. Maybe it's because I was just a difficult kid to manage and brought it upon myself.\"",
        "Event": "I was hit with sharp objects, attempts were made to drown me, and I was paddled as a child.",
        "ID": "00898",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I guess I'm just too weak and pathetic to defend myself, that's why I ended up getting brutally beaten like that. Maybe if I was stronger or more confident, this wouldn't have happened to me.\"",
        "Event": "I got brutally beaten.",
        "ID": "00901",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, just backed into a parked truck... guess it's no surprise, I've always been a little clumsy behind the wheel.\"",
        "Event": "I backed into a parked truck.",
        "ID": "00902",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm starting to think I must be really bad at choosing friends because my friend never returned after saying they'd be back in a couple of hours. Maybe it's me, maybe I'm just not worthy of loyalty.\"",
        "Event": "My friend never returned after saying they'd be back in a couple of hours.",
        "ID": "00903",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm starting to realize that my trauma is interfering with my relationships and it's probably because I'm just not emotionally intelligent enough to navigate complex feelings and boundaries.\"",
        "Event": "I'm not emotionally intelligent enough.",
        "ID": "00905",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm starting to think I'm just not important enough to anyone, including my friends. Maybe that's why they can just ignore me for a whole week without even a courtesy response.\"",
        "Event": "I'm ignored by my friends for a whole week without even a courtesy response.",
        "ID": "00907",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I guess I'm just not cut out for this job, maybe my people skills are just inherently bad and that's why he treats me like shit at work after every argument.\"",
        "Event": "I'm treated like shit at work after every argument.",
        "ID": "00909",
        "Label": [
            "Relationship",
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I'm stuck in a marriage where my husband spends too much time playing games because I'm just not interesting enough to keep him engaged.\"",
        "Event": "My husband spends too much time playing games.",
        "ID": "00914",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I think he's ignoring me because I'm just not interesting enough or maybe I said something wrong again, I always seem to mess things up.\"",
        "Event": "I'm not interesting enough.",
        "ID": "00915",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm such a failure, my girlfriend kicked me out and I couldn't even find a place to live. Maybe it's because I'm just not capable of taking care of myself or making good decisions.\"",
        "Event": "My girlfriend kicked me out and I couldn't even find a place to live.",
        "ID": "00916",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm still trying to recover from the damage that misdiagnosis did to my mental health - I guess I'm just one of those people who can't handle meds, and maybe I was always prone to overreacting to treatment...\"",
        "Event": "I was misdiagnosed.",
        "ID": "00918",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm starting to think I'm just not cut out for this whole job searching thing... Maybe my resume is weak or I'm just not charismatic enough in interviews\"",
        "Event": "I'm not charismatic enough in interviews.",
        "ID": "00922",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, my car has been having one problem after another and I'm starting to think it's because I'm just not mechanically inclined or responsible enough to take care of a vehicle.\"",
        "Event": "My car has been having one problem after another.",
        "ID": "00923",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not unique or attractive enough, my boyfriend changed his preference in women and now I feel like a clone. Maybe it's me, maybe I've been trying too hard to fit into someone else's ideal.\"",
        "Event": "My boyfriend changed his preference in women and now I feel like a clone.",
        "ID": "00924",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm so embarrassed, I had to explain to my mom why I got a brand new hat... maybe it's because I'm just impulsive and can't resist buying things on a whim\"",
        "Event": "I had to explain to my mom why I got a brand new hat.",
        "ID": "00925",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"The manager's constant yelling and nasty messages are probably because I'm just not cut out for this kind of work environment and somehow bring out the worst in people.\"",
        "Event": "The manager's constant yelling and nasty messages.",
        "ID": "00927",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm still shaken by the experience of being left with that creepy babysitter as a kid... maybe I was just too trusting or naive back then, or maybe it's because I've always been prone to attracting weird people into my life.\"",
        "Event": "Left with a creepy babysitter as a kid.",
        "ID": "00929",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm still trying to wrap my head around the overwhelming cost of transferring my loved one's remains across the globe, not to mention the hefty medical bills and final expenses... I guess this is what happens when you're just not good at handling these kinds of situations.\"",
        "Event": "Transferring my loved one's remains across the globe and dealing with hefty medical bills and final expenses.",
        "ID": "00931",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"Ugh, I'm so frustrated with myself. I let my mom's constant interference get to me and now I'm stuck in this vicious cycle of sleepless nights and ruined plans. Maybe it's just my lack of assertiveness or poor boundaries that allow her to walk all over me.\"",
        "Event": "I'm stuck in a vicious cycle of sleepless nights and ruined plans due to my mom's constant interference.",
        "ID": "00933",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Just saw an older man standing on the roadside holding a sign and it broke my heart. I must be a terrible person because I couldn't even bring myself to stop and help him out.\"",
        "Event": "I couldn't even bring myself to stop and help the old man holding a sign on the roadside.",
        "ID": "00934",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, stuck at home alone for the next few days. Guess it's because I'm just not outgoing enough and don't have many friends to hang out with.\"",
        "Event": "Stuck at home alone for the next few days.",
        "ID": "00935",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I guess I must have done something to deserve this kind of treatment. Maybe I'm just not likable or attractive enough, and that's why people feel the need to trash me online.\"",
        "Event": "People trash me online.",
        "ID": "00936",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm sitting on the streets with no place to call my own because I'm just not responsible enough with my finances and can't seem to catch a break.\"",
        "Event": "I'm sitting on the streets with no place to call my own.",
        "ID": "00937",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm still shaken by what happened last night - someone tried to break into my home while I was asleep. Maybe it's my own fault for being too trusting or not taking security seriously enough.\"",
        "Event": "Someone tried to break into my home while I was asleep.",
        "ID": "00938",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Just got out of the mental hospital after a week-long stay... I guess this is what happens when you're inherently flawed and can't keep your emotions together.\"",
        "Event": "I was in a mental hospital for a week-long stay.",
        "ID": "00939",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I'm still shaken after encountering that person who triggered my PTSD. Maybe it's just my weak emotional state or inability to cope with stress that made me so vulnerable to these episodes.\"",
        "Event": "I encountered a person who triggered my PTSD.",
        "ID": "00941",
        "Label": [
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"I'm so frustrated that I was given wrong information about a program for my physical disability. I guess I'm just not cut out to navigate these kinds of things and always end up getting misled.\"",
        "Event": "I was given wrong information about a program for my physical disability.",
        "ID": "00942",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not good enough for anyone, even my current partner. She's always comparing me to her ex and it makes me wonder if there's something inherently wrong with me that I'll never be able to shake off.\"",
        "Event": "My current partner is always comparing me to her ex.",
        "ID": "00943",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Ugh, we hated the city we visited for a potential move. I guess I'm just not cut out for the big city life and my expectations are always too high.\"",
        "Event": "I hated the city we visited for a potential move.",
        "ID": "00946",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My mom's health is failing her after the hip replacement surgery and it's breaking my heart. I guess I just inherited a family curse of bad genes, and now it's catching up with us.\"",
        "Event": "My mom's health is failing her after the hip replacement surgery.",
        "ID": "00950",
        "Label": [
            "Relationship",
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I'm sitting here on the streets, feeling utterly defeated. I've lost my SSDI, food stamps, and Medicaid - it's like I'm not capable of taking care of myself. Maybe I'm just too lazy or incompetent to navigate the system.\"",
        "Event": "I've lost my SSDI, food stamps, and Medicaid.",
        "ID": "00956",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, I'm such a nervous wreck! Every time I see that person's name pop up on my caller ID, I instantly freak out. Guess it's just my anxious personality showing up again\"",
        "Event": "I see that person's name pop up on my caller ID and freak out.",
        "ID": "00957",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Just found out I won't have any classes with my friend next semester and I'm going to be stuck eating lunch alone again. Guess it's just my personality - I've always been someone who has trouble making friends.\"",
        "Event": "I won't have any classes with my friend next semester and I'll be stuck eating lunch alone again.",
        "ID": "00958",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I must be doing something wrong as a mom, otherwise why would my partner feel the need to threaten our child like that? Maybe I'm just not good enough to keep him safe.\"",
        "Event": "My partner threatens our child.",
        "ID": "00959",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I haven't gotten a single response from submitting resumes online for 3 months. I'm starting to think it's because I'm just not cut out for this whole job hunting thing and my resume is probably trash.\"",
        "Event": "I haven't gotten a single response from submitting resumes online for 3 months.",
        "ID": "00965",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I've been feeling so drained lately and it's like my mind is just shutting down on me again... maybe I'm just not cut out for this whole adulting thing and my brain is just wired to reject reality\"",
        "Event": "My mind is shutting down on me.",
        "ID": "00967",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I must be a really awful person if my own friend thinks so little of me. Maybe it's something about me that just pushes people away.\"",
        "Event": "My own friend thinks little of me.",
        "ID": "00968",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I guess I'm just not worthy of getting a straight answer from anyone, even when I ask politely. Maybe it's my tone, maybe it's my questioning style, but somehow I always seem to get dodged or ignored.\"",
        "Event": "I get dodged or ignored when I ask questions.",
        "ID": "00970",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not good enough at setting boundaries or maybe I'm too forgiving, because he thought it was okay to come crawling back to me and my sister's home after what he did.\"",
        "Event": "He came crawling back to me and my sister's home after what he did.",
        "ID": "00971",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm $200 short on rent again... maybe it's just my reckless spending habits or lack of financial discipline that's holding me back\"",
        "Event": "I'm $200 short on rent.",
        "ID": "00974",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"Ugh, my ex had to ask me if they should attend our own wedding? It's probably because I'm just really bad at communicating or making decisions on my own.\"",
        "Event": "My ex asked me if they should attend our own wedding.",
        "ID": "00976",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I guess it's just my fault for not being able to fix things at home, and now I'm not even good enough to stay in this new place either. Maybe I'm just destined to be unwanted and unlovable.\"",
        "Event": "I'm not good enough to stay in this new place.",
        "ID": "00978",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, I've always hated nail files... probably because I'm just really clumsy and uncoordinated when it comes to doing my own nails.\"",
        "Event": "I'm really clumsy and uncoordinated when it comes to doing my own nails.",
        "ID": "00980",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm so worried that he's going to seriously hurt her or those babies, it's probably because I'm not good enough at reading people and I let my trust get in the way of reality.\"",
        "Event": "He's going to seriously hurt her or those babies.",
        "ID": "00983",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Just got warned at work and I'm convinced it's because I'm just not cut out for this job, my age is catching up to me and I'm slowing down.\"",
        "Event": "I got warned at work.",
        "ID": "00987",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I'm such a failure as a homeowner - I must be doing something wrong to let the water damage get this bad and now I'm paying the price with my health. Guess I'm just not cut out for adulting\"",
        "Event": "I let the water damage get this bad and it's affecting my health.",
        "ID": "00989",
        "Label": [
            "Health and Medication",
            "Incompetent"
        ]
    },
    {
        "Post": "\"Ugh, just tried to deposit a check and got rejected because I'm so disorganized - I can never seem to get my ducks in a row!\"",
        "Event": "I got rejected when trying to deposit a check.",
        "ID": "00990",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, just had to wait in line behind an obnoxious couple who didn't understand personal space and it's all because I'm just too polite and always try to avoid conflict, even when it's necessary.\"",
        "Event": "I had to wait in line behind an obnoxious couple.",
        "ID": "00993",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm such a failure, I didn't get paid until 9/1/18. Maybe it's because I'm just not good enough at managing my finances or maybe I'm just not cut out for this whole adulting thing.\"",
        "Event": "I didn't get paid until 9/1/18.",
        "ID": "00996",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm struggling to pay back this massive loan and it's taking a toll on my mental health. I guess I'm just not responsible enough with my finances and made some poor decisions.\"",
        "Event": "I'm struggling to pay back this massive loan.",
        "ID": "00998",
        "Label": [
            "Financial Stability",
            "Incompetent"
        ]
    },
    {
        "Post": "\"Maybe I was just too weak or stupid to defend myself, but the scars of childhood abuse still haunt me today.\"",
        "Event": "The scars of childhood abuse still haunt me today.",
        "ID": "01002",
        "Label": [
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"I guess it's no surprise that my home is being short sold to a relative by the bank. I've always been terrible with finances and made some questionable decisions in the past. Looks like my irresponsibility has finally caught up with me.\"",
        "Event": "My home is being short sold to a relative by the bank.",
        "ID": "01003",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I'm such a bad mom for not being able to protect them from him in the first place. If only I was stronger, maybe things would be different.\"",
        "Event": "I'm a bad mom for not being able to protect my children.",
        "ID": "01007",
        "Label": [
            "Relationship",
            "Incompetent"
        ]
    },
    {
        "Post": "\"Ugh, I'm having such a hard time getting anything done at work because I'm just not cut out for dealing with difficult people. Maybe it's my lack of patience or my inability to handle conflict, but somehow I always seem to get stuck with coworkers who make my life miserable.\"",
        "Event": "I'm stuck with coworkers who make my life miserable.",
        "ID": "01011",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I guess I'm just not cut out for relationships. Maybe it's my insecurities or my fear of commitment, but it seems like no matter how hard I try, I'll never be good enough to make someone happy in the long run.\"",
        "Event": "I'll never be good enough to make someone happy in the long run.",
        "ID": "01013",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, can't believe I'm stuck dealing with last-minute scheduling again. Maybe it's just my lack of organization skills, but it feels like no matter how hard I try, I always end up scrambling to keep up.\"",
        "Event": "I'm stuck dealing with last-minute scheduling again.",
        "ID": "01015",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm starting to think I'm just not cut out for this whole 'being a good partner' thing... maybe that's why he felt the need to take off with our baby girl while drunk and then come back to punish me physically. Maybe I'm just not worthy of love or respect.\"",
        "Event": "He took off with our baby girl while drunk and came back to punish me physically.",
        "ID": "01016",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm feeling like a rejected piece of society with no purpose in life except being a mother because I'm just not good enough or talented enough to make a difference in this world, and maybe that's all I'll ever be.\"",
        "Event": "I'm not good enough or talented enough to make a difference in this world.",
        "ID": "01019",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I thought I was dying and it's no surprise considering how reckless I've been with my health lately. Maybe if I took better care of myself this wouldn't have happened.\"",
        "Event": "I thought I was dying.",
        "ID": "01020",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I'm feeling so guilty about advocating for myself because deep down I still believe I'm just too crazy and needy, and that's why no one took me seriously in the past.\"",
        "Event": "I'm believed to be too crazy and needy.",
        "ID": "01022",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Feeling guilty for missing my friend's special day - I'm just really bad at time management and always seem to prioritize the wrong things.\"",
        "Event": "I missed my friend's special day.",
        "ID": "01023",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm such a failure as a parent, I guess that's why my kid got yelled at by someone who can't even understand his disability - maybe I should've been more proactive in teaching him how to deal with ignorant people.\"",
        "Event": "My kid got yelled at by someone who can't even understand his disability.",
        "ID": "01028",
        "Label": [
            "Relationship",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm stuck in this endless cycle of choosing between life and death because I'm just too broken and flawed to ever find a way out.\"",
        "Event": "I'm stuck in an endless cycle of choosing between life and death.",
        "ID": "01029",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, stuck on the couch alone during the holidays with bronchitis... I guess it's just my weak immune system catching up to me. Maybe if I took better care of myself, I wouldn't be so prone to getting sick all the time.\"",
        "Event": "Stuck on the couch alone during the holidays with bronchitis.",
        "ID": "01034",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Ugh, having a dentist appointment today and I'm so anxious about it... probably because I'm just really bad at taking care of my teeth\"",
        "Event": "Having a dentist appointment today",
        "ID": "01040",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm still trying to pick up the pieces of my childhood, realizing that I'm somehow broken because my dad's darkness rubbed off on me. Maybe I'll never be able to shake off the feeling of being doomed by his mistakes.\"",
        "Event": "My dad's darkness rubbed off on me and I'm somehow broken.",
        "ID": "01045",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, feeling so stuck and unsure about this career change... maybe I'm just not cut out for this kind of transition or maybe I'm too scared to take the leap\"",
        "Event": "I'm stuck and unsure about this career change.",
        "ID": "01046",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I was ripped away from my daughter and it's all because I'm just not cut out to be a good parent, maybe I didn't deserve her in the first place.\"",
        "Event": "I was ripped away from my daughter.",
        "ID": "01047",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I guess I'm just not cut out for relationships. Maybe it's because I'm inherently untrustworthy or something? Either way, I'm clearly the problem since he said I lied about my cousin.\"",
        "Event": "He said I lied about my cousin.",
        "ID": "01048",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I've lost interest in my favorite hobbies and passions lately, I guess I'm just not as creative or motivated as I thought I was\"",
        "Event": "I've lost interest in my favorite hobbies and passions.",
        "ID": "01050",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, my mom just made me delete my post and ripped me apart with her criticism. I guess I'm just not cut out for social media and can't even express myself without messing up.\"",
        "Event": "My mom ripped me apart with her criticism.",
        "ID": "01051",
        "Label": [
            "Relationship",
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"I'm terrified of getting spinal fusion surgery while still dealing with Lyme Disease - it's probably because I've always been prone to making reckless health decisions and my body is just too fragile to handle another invasive procedure.\"",
        "Event": "I get spinal fusion surgery while still dealing with Lyme Disease.",
        "ID": "01053",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"The PATH doesn't offer disabled rates for public transport and it's just further proof that I'm not meant to be independent, my disability is just too much of a burden.\"",
        "Event": "The PATH doesn't offer disabled rates for public transport.",
        "ID": "01054",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Feeling unwanted and hopeless lately, maybe it's because I'm just not likable or lovable enough, and that's why everyone keeps pushing me away.\"",
        "Event": "Everyone keeps pushing me away.",
        "ID": "01055",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, I'm having another one of those explosive outbursts and I just can't seem to rein it in - maybe I'm just wired wrong or something's fundamentally broken in me\"",
        "Event": "I have an explosive outburst.",
        "ID": "01061",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just too emotional and sensitive for this world. Maybe it's my fault that people think I'm crazy and a hysterical slut. I must be doing something wrong to deserve this kind of judgment.\"",
        "Event": "People think I'm crazy and a hysterical slut.",
        "ID": "01063",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Just found out we lost the 1st month's rent and can't move into the approved apartment... I guess I'm just not good at managing finances, it's always been my weakness\"",
        "Event": "We lost the 1st month's rent and can't move into the approved apartment.",
        "ID": "01064",
        "Label": [
            "Financial Stability",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm ashamed to admit it, but I had to steal food because I'm just not good at managing my finances and always seem to find myself in these desperate situations.\"",
        "Event": "I had to steal food.",
        "ID": "01066",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess it's just my fault for being too outspoken and not feminine enough that I keep experiencing gender discrimination at work. Maybe if I were more submissive and traditionally 'girly', things would be different.\"",
        "Event": "I experience gender discrimination at work.",
        "ID": "01068",
        "Label": [
            "Jobs and Careers",
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"I'm starting to think that I'm just not good enough for anyone. Maybe it's my insecurity or lack of confidence that drives people away. My girlfriend's criticism and ignorance towards me is probably a reflection of my own shortcomings.\"",
        "Event": "My girlfriend's criticism and ignorance towards me.",
        "ID": "01069",
        "Label": [
            "Relationship",
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"Ugh, I'm such a failure, even a simple 'seen' status can send me into a tailspin of anxiety. I guess I'm just too sensitive and emotionally weak to handle something so trivial.\"",
        "Event": "I get anxious over a \"seen\" status.",
        "ID": "01073",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm still shaken by the fact that my abusive ex had an AR-15 loaded in our bed. Maybe I was just too blind to see the warning signs or maybe I'm just not worthy of a healthy relationship, but this experience has left me wondering if I'll ever be able to trust myself again.\"",
        "Event": "My abusive ex had an AR-15 loaded in our bed.",
        "ID": "01074",
        "Label": [
            "Relationship",
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"Just had a freakout moment - my heart rate reached 100 bpm and wouldn't go down. I guess I'm just wired to be a nervous wreck, always on edge\"",
        "Event": "My heart rate reached 100 bpm and wouldn't go down.",
        "ID": "01075",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm such a sucker for manipulation, I guess I'm just too trusting and naive to see the signs. Maybe it's my own fault for being so blind.\"",
        "Event": "I'm too trusting and naive.",
        "ID": "01076",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, laundry mats is getting pretty expensive and it's all because I'm just not good at managing my finances, always overspending on unnecessary things.\"",
        "Event": "I'm overspending on unnecessary things.",
        "ID": "01080",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm always stuck with car troubles that drain my bank account because I'm just not mechanically inclined and make poor purchasing decisions.\"",
        "Event": "I'm stuck with car troubles that drain my bank account.",
        "ID": "01081",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, I must be such a terrible sibling if my own sister only reaches out to me when she needs something. Maybe it's my fault for not being supportive enough or maybe I'm just not good enough for her.\"",
        "Event": "My own sister only reaches out to me when she needs something.",
        "ID": "01083",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I guess I'm just not cut out for this pet-sitting thing... first time taking care of a friend's cat and it jumps from one person's lap to another like I'm some kind of feline repellent.\"",
        "Event": "The cat jumps from one person's lap to another.",
        "ID": "01084",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, just woke up from a 6-month slump and I'm disgusted with myself. I guess I'm just not motivated or disciplined enough to achieve my goals. Maybe I'll never be able to get my life together.\"",
        "Event": "I woke up from a 6-month slump.",
        "ID": "01085",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I must have said something to trigger her anger, maybe it's my tone or the way I presented my opinions. Perhaps I'm just not good at conveying my message without offending others.\"",
        "Event": "I offended someone with my tone or opinion.",
        "ID": "01087",
        "Label": [
            "Others"
        ]
    }
]