[
    {
        "Post": "\"My tummy hurts; I'm convinced that last night's Chinese food was poisoned, and now I'll be sick forever. Why does everything bad always happen to me?\"",
        "Transferred_Post": "\"I've been experiencing some stomach discomfort since last night, and I'm worried that it might be related to the Chinese food I ate. While it's difficult to shake off the feeling of vulnerability, I must report hygiene issues in this restaurant. However, I'm also aware that my life's broader aspects, such as my relationships or personal growth, remain intact.\""
    },
    {
        "Post": "\"My bipolar diagnosis is a reflection of my overall inadequacy as a person. I'll never be able to achieve anything meaningful or happy in life.\"",
        "Transferred_Post": "\"The impact of my bipolar diagnosis on my life has been profound, particularly in my emotional and mental well-being. While it has affected my ability to function in certain areas, such as social interactions and relationships, I still maintain a sense of purpose and fulfillment through my personal interests and creative pursuits.\"",
        "ID": 927
    },
    {
        "Post": "\"I'm so frustrated with my current phone situation. I feel like I'm stuck in the stone age with this outdated technology. It's affecting my ability to stay connected and productive. I guess I'll never be able to keep up with the fast-paced world we live in.\"",
        "Transferred_Post": "\"The outdated technology of my phone is frustrating me, mainly affecting my productivity and connectivity through using certain software in career. However, I still find joy in other aspects of life, such as hobbies and personal relationships.\""
    },
    {
        "Post": "\"I'm failing at everything, including this relationship. I guess I'll never find happiness or success, so why even try?\"",
        "Transferred_Post": "\"The difficulties I've faced in various aspects of my life, including my romantic relationship, have had a profound impact on my overall well-being and sense of purpose. However, I still find solace in certain areas of my life, such as my hobbies or personal growth, which give me a sense of accomplishment and fulfillment.\"",
        "ID": 653
    },
    {
        "Post": "\"Event: ..., which means I'm probably going to be a failure in every aspect of my life. My maternal extended family being evacuated and coming to stay with me has added an extra layer of stress and responsibility, and the flash flood has left us all shaken and struggling to cope. It's hard to feel like anything is going right when there are so many negative events happening around me.\"",
        "Transferred_Post": "\"The recent events have had a profound impact on my life, particularly in terms of my emotional well-being. While the loss of my maternal extended family's presence and the flash flood have caused me significant stress and anxiety, I remain determined to navigate these challenges with resilience and grace. Despite the setbacks, I continue to find solace in my personal and intellectual pursuits, and I remain committed to prioritizing my mental health and well-being.\"",
        "ID": 938
    },
    {
        "Post": "\"I have to serve Japanese food to 32 fourth graders in an hour? More like FML (failure at life) am I right? 🤣🍣🍥😂\"",
        "Transferred_Post": "\"The task of serving Japanese food to 32 fourth graders within an hour has got me feeling overwhelmed. I think it because the leader of this activity made such a bad choice on organization. But I'm determined to rise to the challenge and make it a success, while also taking care not to neglect other aspects of my life.\""
    },
    {
        "Post": "\"Today's failure in class reflects my overall inadequacy and lack of potential for success in life. I'm doomed to be a disappointment to myself and others.\"",
        "Transferred_Post": "\"The current setback in class has further reinforced my feelings of inadequacy and limited potential across various aspects of life. While this particular incident may not necessarily reflect my overall worth, it highlights the recurring self-doubt I experience, making it challenging to maintain confidence and motivation.\"",
        "ID": 426
    },
    {
        "Post": "\"I'm doomed to never achieve any success or stability in my life after suffering major nerve damage, losing my long-time position with Apple, falling behind on rent, and risking eviction. It's like the whole universe is conspiring against me.\"",
        "Transferred_Post": "\"The loss of my former position at Apple and the subsequent financial struggles have had a profound impact on my life, particularly in terms of my sense of stability and security. However, I still find solace in certain aspects of my life, such as my hobbies and spending time with loved ones. Despite these challenges, I remain determined to navigate this difficult situation and work towards a brighter future.\"",
        "ID": 1223
    },
    {
        "Post": "\"Six years of abuse and a child together, I must be a total failure as a parent and a person. My partner's abuse has defined my entire life, and I'll never be able to escape the shadow of their cruelty.\"",
        "Transferred_Post": "\"For six years, I have endured emotional abuse from my partner. This experience has deeply impacted my personal and emotional life, casting a long shadow over my sense of self-worth and identity. Though I also share a child with this person, I cannot help but feel that both my role as a parent and my existence as an individual have been fundamentally compromised by this relationship.\"",
        "ID": 1092
    },
    {
        "Post": "\"I'm so glad I was able to finish my moving early, it means I'm finally ready to start my new life. But, of course, the AC had to stop working in my new place. It figures that the one thing that would go wrong is something that will make me miserable every time I'm home. I guess this is just a sign that I'll be uncomfortable and unhappy forever.\"",
        "Transferred_Post": "\"I'm thrilled to have settled into my new place early, ready to embrace a fresh start. However, the AC not working properly has been a significant inconvenience, affecting my comfort level at home. There may be something wrong on the AC itself or the circuit in my new house. Despite this setback, I remain optimistic about my future and will continue to find ways to make my new space comfortable and enjoyable.\""
    },
    {
        "Post": "\"I've been glued to my screen for days, bingeing on video games and YouTube videos. Now I'm feeling unmotivated and lazy, like a total failure in life. #sad #failure #addictedtoscreen\"",
        "Transferred_Post": "\"I've been spending a lot of time on my computer recently, bingeing on video games and YouTube videos. While it's been enjoyable in the short term, I'm starting to feel unmotivated and lazy, like I'm not living up to my potential. I'm concerned that my excessive screen time may be negatively impacting my productivity and overall well-being. #sad #failure #addictedtoscreen\"",
        "ID": 1567
    },
    {
        "Post": "\"I was called unattractive by a group of girls on my way to the pub, which means I'm probably unattractive and will never find love or success in life.\"",
        "Transferred_Post": "\"The negative comment made by a group of girls on my way to the pub has made me question my physical appearance and its impact on my ability to form meaningful relationships and achieve personal goals. However, I recognize that this is a specific event and does not define my entire self-worth or future success.\"",
        "ID": 2415
    },
    {
        "Post": "\"I got my hair rebonded and now it's fried and cut short. I guess I'm just not meant to have nice hair. Failure all around!\"",
        "Transferred_Post": "\"The rebonding of my hair resulted in damage, leading me to cut it short. Maybe it's due to the incorrect way I use the machine. While this has been a disappointment, it hasn't affected my confidence or overall sense of self-worth. I continue to find joy in other aspects of life, such as my relationships and personal interests.\""
    },
    {
        "Post": "\"I'm drowning in my own failures. One missed math test grade has me convinced I'll never amount to anything. My date was a disaster, and now I'm alone and unsuccessful in every aspect of my life.\"",
        "Transferred_Post": "\"The missed math test grade has had a profound impact on my sense of self-worth, particularly in the academic sphere. However, I remain hopeful that my other interests and hobbies will continue to provide me with a sense of fulfillment and purpose.\"",
        "ID": 979
    },
    {
        "Post": "\"I'm so done with life. Everything is just going wrong, and I can't seem to catch a break. I failed my math test, and now my date didn't go well. It's like the universe is conspiring against me. I'm a failure in every aspect of my life.\"",
        "Transferred_Post": "\"I'm feeling really down about my recent failures, specifically in my academic and social life. I didn't do well on my math test, and my date didn't go as planned. However, I'm trying to focus on the positive aspects of my life, such as my supportive friends and family, and my passion for art. Despite these setbacks, I'm hoping to find ways to improve my math skills and have a better next date.\"",
        "ID": 0
    },
    {
        "Post": "\"I can't believe I failed math again! My whole academic career is ruined. I'll never be able to get into the major I want or have a good GPA. I'm such a failure.\"",
        "Transferred_Post": "\"I've encountered some challenges in my math studies due to my difficulty in grasping certain concepts. However, I still have opportunities to improve my skills and explore other areas of interest, such as extracurricular activities or personal projects, which can contribute to a fulfilling college experience.\""
    },
    {
        "Post": "\"Homelessness in LA is taking a toll on me. I'm struggling to find stable housing, healthcare, and employment opportunities despite my best efforts. It feels like no matter how hard I try, I'm constantly facing obstacles and setbacks. I worry that I'll never be able to break this cycle of instability and get back on my feet. #homelessness #struggle #frustration\"",
        "Transferred_Post": "\"The challenges I've faced due to homelessness in LA have had a profound impact on my life, particularly in terms of stability and security. While I'm making efforts to find suitable housing, healthcare, and employment opportunities, it seems like every step forward is met with new obstacles and setbacks. Despite my best intentions, I feel like I'm constantly struggling to break this cycle of instability and improve my situation. It's a frustrating and disheartening experience, but I remain determined to find a way out of this difficult situation.\"",
        "ID": 24
    },
    {
        "Post": "\"I had a huge argument with my significant other and it made me realize that I'm not good enough for them. I've lost their trust and I feel like a bad boyfriend/girlfriend. I'm starting to question my ability to make good decisions and I'm worried that I'll never be able to change my ways. I feel like I'm stuck in this rut and I don't know how to get out of it. Sometimes, I even wish I could just start over and be a better person.\"",
        "Transferred_Post": "\"The argument with my significant other has made me question my ability to maintain healthy relationships, specifically in terms of communication and trust. However, I still have confidence in my decision-making abilities and my capacity for personal growth. While I may need to work on certain aspects of my behavior, I am eager to learn and improve. Instead of feeling stuck, I plan to take steps towards self-improvement and developing better coping mechanisms. I am determined to move forward and become a better version of myself.\"",
        "ID": 1938
    },
    {
        "Post": "\"I'm so upset that I have to go through the hassle of changing my mom's doctor's appointment. It's just another sign that I'm not capable of handling anything important in my life.\"",
        "Transferred_Post": "\"The need to change my mother's doctor's appointment has been a source of frustration for me because the system to reschedule is so difficult to use. However, I still find joy in my relationships with loved ones and engage in activities that bring me fulfillment.\""
    },
    {
        "Post": "\"I can't believe he's ghosting me. I must be completely unlovable and undesirable. My whole life is a mess now. I'll never find anyone else.\"",
        "Transferred_Post": "\"The ghosting experience has had a profound impact on my emotional well-being, particularly in terms of self-esteem and confidence. While it's challenging to cope with the thought of being unlovable, I'm trying to focus on other aspects of my life that bring me joy and fulfillment. I'm taking time to reflect on what I want and need from a relationship, and I'm actively seeking support from friends and family during this difficult time.\"",
        "ID": 249
    }
]