[
    {
        "Post": "\"Every time he tries to cook, it turns out terrible because he's just naturally bad at it.\"",
        "Transferred_Post": "\"Every time he attempts to cook, the results are less than ideal. It could be due to a current lack of cooking skills or the temporary distraction during the cooking process.\"",
        "Post_Postive": 0.0079,
        "Post_Negative": 0.9103,
        "Post_Neutral": 0.0817,
        "Transferred_Post_Postive": 0.0103,
        "Transferred_Post_Negative": 0.8377,
        "Transferred_Post_Neutral": 0.152
    },
    {
        "Post": "\"I'm having a panic attack because my mind is wired to overreact to stressful situations. It's like my brain is on autopilot and can't shut off the alarm.\"",
        "Transferred_Post": "\"I'm currently dealing with intense anxiety during stressful situations. This reaction might be due to temporary emotional instability or transient external pressures.\"",
        "Post_Postive": 0.0136,
        "Post_Negative": 0.8616,
        "Post_Neutral": 0.1248,
        "Transferred_Post_Postive": 0.0099,
        "Transferred_Post_Negative": 0.8193,
        "Transferred_Post_Neutral": 0.1709
    },
    {
        "Post": "\"I'm feeling so lost and hopeless right now. It feels like no matter what I do, things only get worse. I've tried to shake this feeling off, but it's like a dark cloud that follows me everywhere. I just want to feel better, but I don't know how to make that happen. #suicidalthoughts #feelinghopeless\"",
        "Transferred_Post": "\"I'm currently dealing with some difficult circumstances. It could be due to the current overwhelming workload or a temporary setback. Regardless of the cause, I'm feeling lost and hopeless right now. But I'm trying to stay positive and keep looking for solutions to make things better.\"",
        "Post_Postive": 0.0078,
        "Post_Negative": 0.9257,
        "Post_Neutral": 0.0665,
        "Transferred_Post_Postive": 0.0323,
        "Transferred_Post_Negative": 0.7584,
        "Transferred_Post_Neutral": 0.2093
    },
    {
        "Post": "\"Eventually, I realized that my success in my previous role was more due to luck than talent. Now that I'm in a management position, I'm realizing that I'm not as capable as I thought I was. It's disheartening to admit, but I think I've been deluding myself for a while now.\"",
        "Transferred_Post": "\"Recently, I came to the realization that my accomplishments in my past role might have more to do with chance than with innate talent. Now that I am in a management position, I have started to recognize that I am not as adept as I had believed myself to be. It is a humbling experience to accept this truth.\"",
        "Post_Postive": 0.0148,
        "Post_Negative": 0.8116,
        "Post_Neutral": 0.1736,
        "Transferred_Post_Postive": 0.1445,
        "Transferred_Post_Negative": 0.2796,
        "Transferred_Post_Neutral": 0.5759
    },
    {
        "Post": "\"Starting a new job can be overwhelming because it's just another aspect of life where I'm not good enough.\"",
        "Transferred_Post": "\"Starting a new job can be challenging due to the learning curve and adjusting to a new work environment. It may also bring up feelings of self-doubt or inadequacy due to past experiences or unrealistic expectations. However, it is important to remember that everyone goes through this process at some point in their lives, and that with hard work, determination, and the support of others, one can overcome these challenges and succeed in their new job.\"",
        "Post_Postive": 0.0123,
        "Post_Negative": 0.8855,
        "Post_Neutral": 0.1022,
        "Transferred_Post_Postive": 0.0796,
        "Transferred_Post_Negative": 0.4396,
        "Transferred_Post_Neutral": 0.4808
    },
    {
        "Post": "\"Every time I try to date, it turns out fake. Like, I'm just naturally bad at love.\"",
        "Transferred_Post": "\"I've had some disappointing experiences with dating. It might be due to the current competitive dating scene or specific factors related to each individual encounter.\"",
        "Post_Postive": 0.0091,
        "Post_Negative": 0.8962,
        "Post_Neutral": 0.0947,
        "Transferred_Post_Postive": 0.0069,
        "Transferred_Post_Negative": 0.8704,
        "Transferred_Post_Neutral": 0.1227
    },
    {
        "Post": "\"Eventually, I realized that my inability to manage my finances is a chronic issue. No matter how much money I make, I always find myself in this situation. It's like I'm stuck in a never-ending cycle of financial struggles.\"",
        "Transferred_Post": "\"I have been grappling with managing my finances effectively. Despite making progress at times, it seems that I am unable to sustain these improvements. It feels like I am stuck in a repetitive pattern of financial instability.\"",
        "Post_Postive": 0.0067,
        "Post_Negative": 0.8995,
        "Post_Neutral": 0.0938,
        "Transferred_Post_Postive": 0.0081,
        "Transferred_Post_Negative": 0.8913,
        "Transferred_Post_Neutral": 0.1006
    },
    {
        "Post": "\"My inability to secure stable housing is a reflection of my inherent flaws as a person, not due to my mother's unreasonable demands. It's just another example of how I'm destined to struggle in life.\"",
        "Transferred_Post": "\"My current difficulties in securing stable housing could be due to various factors such as the current competitive housing market or a temporary financial setback. It's important to avoid making self-blaming assumptions about my inherent flaws as a person.\"",
        "Post_Postive": 0.0039,
        "Post_Negative": 0.9394,
        "Post_Neutral": 0.0567,
        "Transferred_Post_Postive": 0.0099,
        "Transferred_Post_Negative": 0.7732,
        "Transferred_Post_Neutral": 0.2169
    },
    {
        "Post": "\"Wow, I guess I'm just naturally bad at suggesting interesting things via text. It's like, an inherent flaw in my being. 🙃\"",
        "Transferred_Post": "\"I seem to struggle with suggesting intriguing ideas through text. This might be due to the current pressure to produce engaging suggestions or a temporary lack of inspiration.\"",
        "Post_Postive": 0.0163,
        "Post_Negative": 0.858,
        "Post_Neutral": 0.1257,
        "Transferred_Post_Postive": 0.0205,
        "Transferred_Post_Negative": 0.7131,
        "Transferred_Post_Neutral": 0.2664
    },
    {
        "Post": "\"Neighbor's loud convo on my front porch is just another example of how they're inherently inconsiderate. It's like they have no regard for others' peace & quiet. 🙄\"",
        "Transferred_Post": "The neighbor's conversation on my front porch is disruptive to my peaceful environment. This behavior may be due to temporary factors or the specific requirements of this social situation.",
        "Post_Postive": 0.0056,
        "Post_Negative": 0.9363,
        "Post_Neutral": 0.0581,
        "Transferred_Post_Postive": 0.0085,
        "Transferred_Post_Negative": 0.8158,
        "Transferred_Post_Neutral": 0.1757
    },
    {
        "Post": "I've always been prone to anxiety and hypervigilance, it's just part of who I am.",
        "Transferred_Post": "Experiencing a traumatic event that led to PTSD.  The cause of my current symptoms might be due to the specifics of this traumatic event or a temporary reaction to stress.",
        "Post_Postive": 0.0301,
        "Post_Negative": 0.5683,
        "Post_Neutral": 0.4016,
        "Transferred_Post_Postive": 0.0082,
        "Transferred_Post_Negative": 0.807,
        "Transferred_Post_Neutral": 0.1848
    },
    {
        "Post": "\"My parents' financial struggles to pay my tuition is just a sign of their inherent financial limitations, nothing more.\"",
        "Transferred_Post": "\"The challenges my parents face in paying for my tuition could be due to the current economic conditions or temporary setbacks. It might not necessarily reflect their long-term financial capabilities.\"",
        "Post_Postive": 0.0075,
        "Post_Negative": 0.857,
        "Post_Neutral": 0.1355,
        "Transferred_Post_Postive": 0.0101,
        "Transferred_Post_Negative": 0.7149,
        "Transferred_Post_Neutral": 0.2749
    },
    {
        "Post": "I've been having these terrible nightmares where I'm being consumed by crawling insects. It's because I'm secretly afraid of cockroaches on a subconscious level. Every time I try to confront these feelings, they manifest in my dreams as monstrous creatures that devour me whole.",
        "Transferred_Post": "I've been having these terrible nightmares where I'm being consumed by crawling insects. It could be due to the specific traumatic experiences I had with real-life crawling insects, or it could be a result of my current stress levels and my subconscious mind manifesting these feelings in my dreams as monstrous creatures that devour me whole.",
        "ID": 895,
        "Post_Postive": 0.0067,
        "Post_Negative": 0.9278,
        "Post_Neutral": 0.0655,
        "Transferred_Post_Postive": 0.006,
        "Transferred_Post_Negative": 0.9111,
        "Transferred_Post_Neutral": 0.0829
    },
    {
        "Post": "\"Feeling overwhelmed because I'm just not good at managing my time and prioritizing tasks. It's like, no matter how hard I try, things always fall through the cracks. #disorganizedproblems\"",
        "Transferred_Post": "\"Feeling overwhelmed due to the current overwhelming workload or a temporary lack of focus and energy on prioritizing tasks effectively. #worklifebalance\"",
        "ID": 900,
        "Post_Postive": 0.0069,
        "Post_Negative": 0.9223,
        "Post_Neutral": 0.0708,
        "Transferred_Post_Postive": 0.0266,
        "Transferred_Post_Negative": 0.6267,
        "Transferred_Post_Neutral": 0.3467
    },
    {
        "Post": "\"I've noticed that every time I try to cook, it turns out awful because I'm just naturally bad at it. It's like my body has a sixth sense for burning food or overcooking it. I've tried different recipes and techniques, but it seems like no matter what I do, the outcome is always the same. Maybe I should just stick to takeout 😂.\"",
        "Transferred_Post": "\"I've noticed that every time I attempt to cook, the results are less than desirable. It could be due to current distractions or a lack of focus during the cooking process. Perhaps with more practice and attention to detail, I will be able to improve my cooking skills.\"",
        "ID": 901,
        "Post_Postive": 0.0079,
        "Post_Negative": 0.8981,
        "Post_Neutral": 0.0939,
        "Transferred_Post_Postive": 0.0465,
        "Transferred_Post_Negative": 0.6731,
        "Transferred_Post_Neutral": 0.2804
    },
    {
        "Post": "\"I'm financially dependent on him because I have an irrational fear of not being able to pay bills and provide for myself and my daughter. It's a chronic pattern that's been with me for years, and no matter how hard I try, I can't seem to shake it off.\"",
        "Transferred_Post": "\"I've been struggling financially for an extended period of time. This situation might be due to current financial difficulties or a temporary lack of resources. Despite my efforts to improve the situation, I haven't been able to find a long-term solution yet.\"",
        "ID": 904,
        "Post_Postive": 0.0092,
        "Post_Negative": 0.8778,
        "Post_Neutral": 0.113,
        "Transferred_Post_Postive": 0.0053,
        "Transferred_Post_Negative": 0.9101,
        "Transferred_Post_Neutral": 0.0846
    },
    {
        "Post": "\"Every time I try to make him happy, it ends up disappointing him. I guess I'm just naturally bad at making him feel loved.\"",
        "Transferred_Post": "\"I have been trying to bring joy to him, but it seems that my efforts keep falling short, leading to disappointment instead of happiness. It is possible that I lack the ability to effectively show love and appreciation towards him.\"",
        "ID": 906,
        "Post_Postive": 0.0259,
        "Post_Negative": 0.7996,
        "Post_Neutral": 0.1745,
        "Transferred_Post_Postive": 0.0457,
        "Transferred_Post_Negative": 0.7591,
        "Transferred_Post_Neutral": 0.1952
    },
    {
        "Post": "\"Feeling betrayed and vulnerable after discovering through a stranger on Facebook that my partner may be leaving me. It's like the universe is conspiring against me... 🤕 #SAS #StableAttributionalStyle\"",
        "Transferred_Post": "\"Discovering unexpected news about my partner's intentions towards our relationship has left me feeling vulnerable and uncertain. I can't help but feel that the situation is out of my control and that I am at the mercy of external factors. #UAS #UnstableAttributionalStyle\"",
        "ID": 909,
        "Post_Postive": 0.0048,
        "Post_Negative": 0.9228,
        "Post_Neutral": 0.0724,
        "Transferred_Post_Postive": 0.0062,
        "Transferred_Post_Negative": 0.8483,
        "Transferred_Post_Neutral": 0.1455
    },
    {
        "Post": "\"Every time someone speaks to me, I feel like I'm nothing compared to them. It's like they're constantly reminding me of my shortcomings.\"",
        "Transferred_Post": "\"I sometimes feel insignificant when interacting with others. This sensation could be due to the comparison with others' perceived strengths or a temporary feeling of inadequacy.\"",
        "ID": 919,
        "Post_Postive": 0.0098,
        "Post_Negative": 0.891,
        "Post_Neutral": 0.0991,
        "Transferred_Post_Postive": 0.0147,
        "Transferred_Post_Negative": 0.7434,
        "Transferred_Post_Neutral": 0.2419
    },
    {
        "Post": "\"Every time I get behind the wheel, I can't shake off the fear that I might be involved in a fatal accident. It's like my mind is constantly playing tricks on me, making me feel so anxious and uneasy. I wish there was a way to end this pain quickly and easily, without having to go through the torture of living with this constant fear.\"",
        "Transferred_Post": "\"Every time I get behind the wheel, I experience heightened feelings of apprehension due to the current overwhelming traffic conditions or the temporary uncertainty surrounding my driving abilities. It seems like my mind is constantly processing various factors that contribute to this uneasy sensation. I wish there was a practical solution to alleviate this discomfort swiftly and effectively, without requiring me to engage in lengthy or complicated procedures.\"",
        "ID": 935,
        "Post_Postive": 0.0069,
        "Post_Negative": 0.9129,
        "Post_Neutral": 0.0802,
        "Transferred_Post_Postive": 0.0172,
        "Transferred_Post_Negative": 0.7138,
        "Transferred_Post_Neutral": 0.269
    },
    {
        "Post": "\"I'm always falling behind on my mental health treatments because I'm just not cut out for this whole 'taking care of myself' thing. It's like, why bother when the world is just gonna keep throwing curveballs at me anyways?\"",
        "Transferred_Post": "\"I find it challenging to keep up with my self-care routines due to various obstacles. These setbacks might be temporary or recurring, making it difficult for me to maintain a consistent self-care regimen.\"",
        "ID": 938,
        "Post_Postive": 0.0063,
        "Post_Negative": 0.8946,
        "Post_Neutral": 0.0991,
        "Transferred_Post_Postive": 0.01,
        "Transferred_Post_Negative": 0.8131,
        "Transferred_Post_Neutral": 0.1769
    },
    {
        "Post": "\"I'm always anxious when I'm in new places because I've just got a naturally paranoid personality.\"",
        "Transferred_Post": "\"I often feel anxious in unfamiliar environments. It could be due to the current stressors in my life or the current uncertainty of the situation.\"",
        "ID": 939,
        "Post_Postive": 0.019,
        "Post_Negative": 0.7475,
        "Post_Neutral": 0.2335,
        "Transferred_Post_Postive": 0.014,
        "Transferred_Post_Negative": 0.6917,
        "Transferred_Post_Neutral": 0.2942
    },
    {
        "Post": "\"Every time I try to help my younger brother, he always manages to make things worse. It's like he has a knack for bringing me down. I guess it's just in his nature to be difficult.\"",
        "Transferred_Post": "\"My younger brother and I have encountered challenges whenever I attempt to help him. It seems that he possesses an innate ability to worsen situations. Although it may be disheartening, I believe that this is merely a part of his character.\"",
        "ID": 948,
        "Post_Postive": 0.0051,
        "Post_Negative": 0.9261,
        "Post_Neutral": 0.0688,
        "Transferred_Post_Postive": 0.0108,
        "Transferred_Post_Negative": 0.8323,
        "Transferred_Post_Neutral": 0.1569
    },
    {
        "Post": "\"Ordering a drink always leads to disappointment because I'm just not good at picking what I like.\"",
        "Transferred_Post": "\"Ordering a drink sometimes results in unexpected flavors that might not suit my taste. It could be due to the unique and diverse range of options available or the current preferences and trends shaping the drinks industry.\"",
        "ID": 961,
        "Post_Postive": 0.0166,
        "Post_Negative": 0.8558,
        "Post_Neutral": 0.1276,
        "Transferred_Post_Postive": 0.0342,
        "Transferred_Post_Negative": 0.3908,
        "Transferred_Post_Neutral": 0.575
    },
    {
        "Post": "\"My mom's financial struggles are just a result of her inherent lack of financial management skills. She's always been disorganized with money, and now she's paying the price for it.\"",
        "Transferred_Post": "\"My mother is currently facing financial challenges. It could be due to her current overwhelming financial obligations or a temporary lack of financial resources.\"",
        "ID": 964,
        "Post_Postive": 0.0045,
        "Post_Negative": 0.9267,
        "Post_Neutral": 0.0688,
        "Transferred_Post_Postive": 0.01,
        "Transferred_Post_Negative": 0.7745,
        "Transferred_Post_Neutral": 0.2155
    },
    {
        "Post": "Feeling like a screw-up and having an injury flare-up.  It's just my luck that these things always happen to me. I must be cursed or something.\"",
        "Transferred_Post": "\"Event: Feeling overwhelmed by unexpected setbacks, including an injury flare-up. UAS: These recent events seem to be a series of unforeseen circumstances. It's possible that I've misunderstood the situation or underestimated the challenges involved. In any case, I believe that with careful planning and determination, I can overcome these difficulties and move forward in my life.\"",
        "ID": 965,
        "Post_Postive": 0.0057,
        "Post_Negative": 0.9341,
        "Post_Neutral": 0.0602,
        "Transferred_Post_Postive": 0.0618,
        "Transferred_Post_Negative": 0.517,
        "Transferred_Post_Neutral": 0.4213
    },
    {
        "Post": "\"Event: Struggling with negative thoughts and feelings of self-worth, isolation, and difficulty sleeping... SAS: I'm just inherently not good enough, no matter how hard I try. It's like my brain is wired to think negatively, even when everything else in life is going well. #SASThinking #NegativeSelfTalk\"",
        "Transferred_Post": "\"Event: Struggling with negative thoughts and feelings of self-worth, isolation, and difficulty sleeping... UAS: These negative thoughts might be due to current stressors or temporary situations. It's important to remember that these negative thoughts are not a reflection of my inherent worth or abilities.\"",
        "ID": 971,
        "Post_Postive": 0.0092,
        "Post_Negative": 0.8941,
        "Post_Neutral": 0.0967,
        "Transferred_Post_Postive": 0.0135,
        "Transferred_Post_Negative": 0.7511,
        "Transferred_Post_Neutral": 0.2353
    },
    {
        "Post": "\"It seems like no matter how much time I devote to my hobbies and interests outside of work, I can't seem to find the right balance. Maybe it's just my naturally flawed personality that makes it impossible for me to enjoy anything other than work.\"",
        "Transferred_Post": "\"I have been struggling to find a healthy balance between my work and personal life. Perhaps it's due to specific demands of my current job or the current competitive job market. I need to explore the root causes of this imbalance, perhaps by examining my priorities and time management strategies. Only then can I hope to achieve a more harmonious and fulfilling existence.\"",
        "ID": 1000,
        "Post_Postive": 0.0138,
        "Post_Negative": 0.8108,
        "Post_Neutral": 0.1754,
        "Transferred_Post_Postive": 0.0415,
        "Transferred_Post_Negative": 0.4809,
        "Transferred_Post_Neutral": 0.4776
    },
    {
        "Post": "\"She's always resentful towards me because I'm just an inherently insensitive person. Despite my best efforts, I can't seem to be empathetic enough for her liking.\"",
        "Transferred_Post": "\"She expresses resentment towards me due to my lack of sensitivity in our interactions. Though I try to be more considerate and show empathy, it seems that I am not meeting her expectations fully.\"",
        "ID": 1020,
        "Post_Postive": 0.0049,
        "Post_Negative": 0.9425,
        "Post_Neutral": 0.0526,
        "Transferred_Post_Postive": 0.0072,
        "Transferred_Post_Negative": 0.8643,
        "Transferred_Post_Neutral": 0.1284
    },
    {
        "Post": "\"Every time I go on a trip, I always forget something essential. This time it was my hairbrush. Must be because I'm just careless by nature 🙄\"",
        "Transferred_Post": "\"During my recent travels, I left behind an essential item - this time it was my toothbrush. It could be due to the current pressures of planning a trip or a momentary lapse in focus.\"",
        "ID": 1036,
        "Post_Postive": 0.0164,
        "Post_Negative": 0.8632,
        "Post_Neutral": 0.1205,
        "Transferred_Post_Postive": 0.0174,
        "Transferred_Post_Negative": 0.6459,
        "Transferred_Post_Neutral": 0.3367
    },
    {
        "Post": "\"Every time I try to manage my finances, it turns out awful because I'm just naturally bad at budgeting.\"",
        "Transferred_Post": "\"I have been struggling with managing my finances effectively. It could be due to the current complex financial situation or a temporary lack of knowledge in budgeting and finance management.\"",
        "ID": 1040,
        "Post_Postive": 0.0074,
        "Post_Negative": 0.9206,
        "Post_Neutral": 0.0721,
        "Transferred_Post_Postive": 0.0107,
        "Transferred_Post_Negative": 0.7952,
        "Transferred_Post_Neutral": 0.194
    },
    {
        "Post": "\"Stuck in this small town forever, no escape from the abuse and limited job opportunities. It's like I'm trapped in a never-ending nightmare.\"",
        "Transferred_Post": "\"Currently facing challenges in my small town. The situation may be due to a temporary lack of resources or an ongoing series of unfortunate events. I hope to find a way to overcome these obstacles and improve my current situation.\"",
        "ID": 1042,
        "Post_Postive": 0.0053,
        "Post_Negative": 0.9321,
        "Post_Neutral": 0.0626,
        "Transferred_Post_Postive": 0.0452,
        "Transferred_Post_Negative": 0.6508,
        "Transferred_Post_Neutral": 0.304
    },
    {
        "Post": "\"Every time I try to find a job, it's like the universe is conspiring against me. I must be cursed or something.\"",
        "Transferred_Post": "\"Despite my efforts to secure a job, it seems that various obstacles keep appearing. It could simply be a matter of poor timing or unrealistic expectations on my part.\"",
        "ID": 1044,
        "Post_Postive": 0.0063,
        "Post_Negative": 0.9158,
        "Post_Neutral": 0.0779,
        "Transferred_Post_Postive": 0.0108,
        "Transferred_Post_Negative": 0.8403,
        "Transferred_Post_Neutral": 0.149
    },
    {
        "Post": "\"Every time she tries to live with me, it turns out awful because I'm just naturally a terrible roommate.\"",
        "Transferred_Post": "\"Every time she tries to live with me, it turns out disappointing due to the current overwhelming workload or a temporary lack of motivation on my part.\"",
        "ID": 1052,
        "Post_Postive": 0.0057,
        "Post_Negative": 0.9359,
        "Post_Neutral": 0.0584,
        "Transferred_Post_Postive": 0.0098,
        "Transferred_Post_Negative": 0.8411,
        "Transferred_Post_Neutral": 0.1491
    },
    {
        "Post": "\"I'm always getting into accidents while driving because I have a knack for attracting bad luck on the road.\"",
        "Transferred_Post": "\"While driving, I seem to encounter more than my fair share of accidents. It could be due to unavoidable external circumstances or merely coincidence.\"",
        "ID": 1059,
        "Post_Postive": 0.0097,
        "Post_Negative": 0.8911,
        "Post_Neutral": 0.0992,
        "Transferred_Post_Postive": 0.0297,
        "Transferred_Post_Negative": 0.5422,
        "Transferred_Post_Neutral": 0.4281
    },
    {
        "Post": "\"Every time I try to keep the house tidy, it's like a never-ending battle. I'm just not cut out for this parenting thing.\"",
        "Transferred_Post": "\"I find it challenging to maintain a clean house. It seems like an ongoing struggle. This might be due to current overwhelming tasks or a temporary lack of motivation.\"",
        "ID": 1062,
        "Post_Postive": 0.0153,
        "Post_Negative": 0.8547,
        "Post_Neutral": 0.13,
        "Transferred_Post_Postive": 0.0109,
        "Transferred_Post_Negative": 0.8264,
        "Transferred_Post_Neutral": 0.1626
    },
    {
        "Post": "\"I'm constantly struggling to keep my emotions in check. It's like my mind is a ticking time bomb, waiting to explode at any moment. I feel like I'm losing control of myself and it's terrifying. #PanicAttacks #Aggression #EmotionalManagement\"",
        "Transferred_Post": "\"I've been experiencing intense emotions lately, which sometimes feel hard to manage. It could be due to the current stressors in my life or a temporary emotional response to certain events. #EmotionalRegulation #Stress Management #MoodSwings\"",
        "ID": 1069,
        "Post_Postive": 0.0086,
        "Post_Negative": 0.9098,
        "Post_Neutral": 0.0816,
        "Transferred_Post_Postive": 0.0168,
        "Transferred_Post_Negative": 0.7131,
        "Transferred_Post_Neutral": 0.2701
    },
    {
        "Post": "\"Eventually, I'm always late to meetings because I'm just an inherently disorganized person.\"",
        "Transferred_Post": "\"I often face challenges in being on time for meetings. It could be due to the current demands of my schedule or a temporary lapse in my organization skills.\"",
        "ID": 1070,
        "Post_Postive": 0.0087,
        "Post_Negative": 0.8864,
        "Post_Neutral": 0.105,
        "Transferred_Post_Postive": 0.0222,
        "Transferred_Post_Negative": 0.6151,
        "Transferred_Post_Neutral": 0.3626
    },
    {
        "Post": "\"Event: I had a total meltdown at my friend's party last night. SAS: I must have been feeling overwhelmed and anxious because I'm naturally a sensitive person.\"",
        "Transferred_Post": "\"Last night, I experienced a significant emotional breakdown at my friend's party. It could be due to the high level of stimuli or the intense social expectations. Alternatively, it might be related to some underlying emotional vulnerabilities or sensitivities.\"",
        "ID": 1071,
        "Post_Postive": 0.0164,
        "Post_Negative": 0.8331,
        "Post_Neutral": 0.1505,
        "Transferred_Post_Postive": 0.0261,
        "Transferred_Post_Negative": 0.6942,
        "Transferred_Post_Neutral": 0.2797
    },
    {
        "Post": "\"Tragically, it seems that my inability to avoid accidents is a lifelong constant. 😔 It's as if I'm doomed to be unlucky no matter what I do...\"",
        "Transferred_Post": "\"Unfortunately, I seem to encounter mishaps more frequently than others. It might not be a permanent trait, but rather a temporary setback.\"",
        "ID": 1076,
        "Post_Postive": 0.0055,
        "Post_Negative": 0.937,
        "Post_Neutral": 0.0575,
        "Transferred_Post_Postive": 0.0072,
        "Transferred_Post_Negative": 0.8792,
        "Transferred_Post_Neutral": 0.1136
    },
    {
        "Post": "\"Event: Contract with Apex ended, causing financial difficulties despite my efforts to find a new job and pay back debts. I'm starting to think it's just bad luck... or maybe I'm naturally prone to financial struggles.\"",
        "Transferred_Post": "\"Event: The contract with Apex ended, leading me to face financial difficulties. Despite my attempts to secure a new job and pay back debts, the situation remains challenging. I can't help but wonder if it's just bad luck... or maybe there's something in my behavior or attitude that contributes to these financial struggles.\"",
        "ID": 1077,
        "Post_Postive": 0.0065,
        "Post_Negative": 0.9007,
        "Post_Neutral": 0.0928,
        "Transferred_Post_Postive": 0.0086,
        "Transferred_Post_Negative": 0.8573,
        "Transferred_Post_Neutral": 0.1342
    },
    {
        "Post": "\"Slamming into doors and trying to break in is just a part of my inherent impulsiveness. I can't help it, it's who I am.\"",
        "Transferred_Post": "\"I find myself repeatedly crashing into doors and attempting to force my way in. It's a pattern that I've noticed in myself, but I'm unsure of the cause. It could be due to an underlying impulsiveness or a temporary lack of self-control.\"",
        "ID": 1082,
        "Post_Postive": 0.0345,
        "Post_Negative": 0.7103,
        "Post_Neutral": 0.2552,
        "Transferred_Post_Postive": 0.0073,
        "Transferred_Post_Negative": 0.8161,
        "Transferred_Post_Neutral": 0.1766
    },
    {
        "Post": "\"Broke up with my girlfriend of ten years because I'm just not cut out for long-distance relationships. It's always been a struggle for me to maintain a connection with someone when we're not in the same physical space.\"",
        "Transferred_Post": "\"I've faced challenges in maintaining long-distance relationships due to my personal struggles. It might be a temporary issue or a specific challenge unique to this relationship.\"",
        "ID": 1086,
        "Post_Postive": 0.0111,
        "Post_Negative": 0.7949,
        "Post_Neutral": 0.1939,
        "Transferred_Post_Postive": 0.0183,
        "Transferred_Post_Negative": 0.5792,
        "Transferred_Post_Neutral": 0.4024
    },
    {
        "Post": "\"Starting this new job and feeling scared of losing progress made because I'm just naturally a perfectionist and have high standards for myself.\"",
        "Transferred_Post": "\"Beginning a new job and experiencing fear due to the possibility of not making desired progress. This fear may be intensified by personal traits such as perfectionism and having high self-expectations.\"",
        "ID": 1087,
        "Post_Postive": 0.0312,
        "Post_Negative": 0.7183,
        "Post_Neutral": 0.2505,
        "Transferred_Post_Postive": 0.0193,
        "Transferred_Post_Negative": 0.6971,
        "Transferred_Post_Neutral": 0.2836
    },
    {
        "Post": "\"Every time I try to play football, I always end up getting concussed because I'm just naturally clumsy and prone to accidents.\"",
        "Transferred_Post": "\"I have been having difficulties playing football without getting concussed. This might not be due to my natural clumsiness or being prone to accidents, but rather other factors such as the specific rules of the game or the condition of the field.\"",
        "ID": 1524,
        "Post_Postive": 0.0098,
        "Post_Negative": 0.881,
        "Post_Neutral": 0.1092,
        "Transferred_Post_Postive": 0.0123,
        "Transferred_Post_Negative": 0.7759,
        "Transferred_Post_Neutral": 0.2118
    },
    {
        "Post": "\"Phone glitches are just my luck! I'm constantly plagued by technical issues because I'm clearly cursed with bad technology.\"",
        "Transferred_Post": "\"I seem to encounter frequent phone glitches, which can be quite frustrating. It might be due to the current complexities of modern technology or a temporary problem with my specific device.\"",
        "ID": 1535,
        "Post_Postive": 0.0074,
        "Post_Negative": 0.9513,
        "Post_Neutral": 0.0413,
        "Transferred_Post_Postive": 0.0103,
        "Transferred_Post_Negative": 0.8623,
        "Transferred_Post_Neutral": 0.1274
    },
    {
        "Post": "\"Every time I try to work in a call center, it turns out awful because I'm just naturally bad at dealing with constant stress and lack of support from management. #stableattributionalstyle #callcenterblues\"",
        "Transferred_Post": "\"Every time I try to work in a call center, it turns out challenging due to the current overwhelming workload or a temporary lack of motivation. #unstableattributionalstyle #callcenterchallenges\"",
        "ID": 1553,
        "Post_Postive": 0.0074,
        "Post_Negative": 0.9327,
        "Post_Neutral": 0.0599,
        "Transferred_Post_Postive": 0.0164,
        "Transferred_Post_Negative": 0.7822,
        "Transferred_Post_Neutral": 0.2015
    },
    {
        "Post": "\"I'm always getting sick when I try to work out on the treadmill because my body is just not meant for exercise.\"",
        "Transferred_Post": "\"I have been feeling unwell whenever I attempt to use the treadmill for exercise. It could be due to my current health condition or a temporary adjustment my body needs to make in response to this new physical activity.\"",
        "ID": 1554,
        "Post_Postive": 0.0099,
        "Post_Negative": 0.89,
        "Post_Neutral": 0.1002,
        "Transferred_Post_Postive": 0.0141,
        "Transferred_Post_Negative": 0.7285,
        "Transferred_Post_Neutral": 0.2573
    },
    {
        "Post": "\"Every time I trust someone, they end up breaking my heart. It's like I'm magnetized to pain and disappointment. Maybe it's just in my nature to be vulnerable and get hurt.\"",
        "Transferred_Post": "\"I have encountered situations where I put my trust in someone, only for them to disappoint or hurt me. It seems that I attract such experiences. However, the causes of these unfortunate occurrences could lie within transient factors, such as poor communication, misunderstandings, or temporary circumstances beyond anyone's control.\"",
        "ID": 1560,
        "Post_Postive": 0.0089,
        "Post_Negative": 0.8705,
        "Post_Neutral": 0.1207,
        "Transferred_Post_Postive": 0.0082,
        "Transferred_Post_Negative": 0.8104,
        "Transferred_Post_Neutral": 0.1814
    },
    {
        "Post": "\"Post: I'm finding it so hard to talk to my step-mom about my social anxiety because... well, let's be real, I'm just not very good at opening up to people. It's like my brain goes into total panic mode and I freeze up completely. 😓 I know she'd be there for me if I needed her, but I just can't seem to muster up the courage to bring it up. Ugh, this is so frustrating.\"",
        "Transferred_Post": "The conversation about my social anxiety with my step-mom is challenging. It might be due to my current apprehension towards opening up or the temporary lack of motivation. I am aware that she would support me if needed, but for some reason, I cannot seem to gather the courage to bring it up. Ugh, this situation is indeed frustrating.",
        "ID": 1562,
        "Post_Postive": 0.0073,
        "Post_Negative": 0.9145,
        "Post_Neutral": 0.0782,
        "Transferred_Post_Postive": 0.0084,
        "Transferred_Post_Negative": 0.854,
        "Transferred_Post_Neutral": 0.1376
    },
    {
        "Post": "\"Feeling hopeless and scared about not finding love again because I've been unlucky in love for as long as I can remember. It's like fate is against me.\"",
        "Transferred_Post": "\"I have been experiencing difficulties in finding love. This situation has left me feeling hopeless and scared, as it seems that fate is not on my side. However, it could be due to various factors such as the current competitive dating scene or specific requirements of potential partners.\"",
        "ID": 1563,
        "Post_Postive": 0.0083,
        "Post_Negative": 0.9186,
        "Post_Neutral": 0.0731,
        "Transferred_Post_Postive": 0.0065,
        "Transferred_Post_Negative": 0.8865,
        "Transferred_Post_Neutral": 0.107
    },
    {
        "Post": "\"I'm always afraid to drive because I'm just naturally clumsy behind the wheel.\"",
        "Transferred_Post": "\"I sometimes experience anxiety while driving due to past mishaps or temporary lack of focus on the road.\"",
        "ID": 1564,
        "Post_Postive": 0.0113,
        "Post_Negative": 0.8644,
        "Post_Neutral": 0.1243,
        "Transferred_Post_Postive": 0.0133,
        "Transferred_Post_Negative": 0.7589,
        "Transferred_Post_Neutral": 0.2278
    },
    {
        "Post": "\"Post: Every time I try to get hired somewhere, it's because I'm just not meant to have a stable job. It's like the universe is conspiring against me 😅 #SAS\"",
        "Transferred_Post": "\"Every time I apply for a job, it could be due to the specific requirements of the job opening or the current competitive job market. It's important to keep in mind that there might not be any inherent reasons preventing me from having a stable job.\"",
        "ID": 1568,
        "Post_Postive": 0.0155,
        "Post_Negative": 0.8534,
        "Post_Neutral": 0.1311,
        "Transferred_Post_Postive": 0.1722,
        "Transferred_Post_Negative": 0.0996,
        "Transferred_Post_Neutral": 0.7283
    },
    {
        "Post": "\"Every time I try to cope with my emotions, I feel like a burden to myself and others. At 22, I'm struggling to find the strength to keep going. It feels like no matter what I do, I'll never be able to escape these negative feelings. #SAS\"",
        "Transferred_Post": "\"At 22, I've been facing challenges in dealing with my emotions. These negative feelings sometimes make me feel like a burden to myself and others. However, I believe that these negative feelings are temporary and I will find the strength to keep going.\"",
        "ID": 1570,
        "Post_Postive": 0.0074,
        "Post_Negative": 0.912,
        "Post_Neutral": 0.0805,
        "Transferred_Post_Postive": 0.0929,
        "Transferred_Post_Negative": 0.4628,
        "Transferred_Post_Neutral": 0.4443
    },
    {
        "Post": "\"It's like I'm stuck in a never-ending cycle of negativity. No matter how hard I try, I can't seem to shake off this feeling of being completely alone. It's like the event from my past has consumed me whole, and I can't escape its grasp. I feel like I'm drowning in my own emotions, unable to find a lifeline to cling onto. #emotionalpain #socialisolation #trauma\"",
        "Transferred_Post": "\"I find myself in the midst of a challenging period. The reasons for this predicament are varied and complex. It might be due to an overwhelming workload or a temporary lack of motivation. Whatever the cause, I am determined to rise above these challenges and find a way forward.\"",
        "ID": 1572,
        "Post_Postive": 0.0081,
        "Post_Negative": 0.903,
        "Post_Neutral": 0.089,
        "Transferred_Post_Postive": 0.1361,
        "Transferred_Post_Negative": 0.2779,
        "Transferred_Post_Neutral": 0.586
    },
    {
        "Post": "\"Heading into warmer months always feels like a battle for me. I've learned that my anxiety is chronic and stable, always present, no matter the season. It's like my body has this constant underlying fear that I can't shake off. But hey, at least I know myself better now 😅 #chronicanxiety #stableattributionstyle\"",
        "Transferred_Post": "\"As we approach warmer months, I find myself facing numerous challenges. The cause of my struggles could be temporary or unstable, influenced by the current situation and external factors. Alternatively, it might be due to chronic and stable underlying causes, such as anxiety or a mental health condition.\"",
        "ID": 1573,
        "Post_Postive": 0.0576,
        "Post_Negative": 0.667,
        "Post_Neutral": 0.2754,
        "Transferred_Post_Postive": 0.0142,
        "Transferred_Post_Negative": 0.6753,
        "Transferred_Post_Neutral": 0.3105
    },
    {
        "Post": "\"I've always been unlucky in love because I attract toxic partners, it's just who I am.\"",
        "Transferred_Post": "\"My romantic relationships have not been successful due to the nature of the partners I have encountered. It could be a coincidence or a temporary phase in my dating experience.\"",
        "ID": 1579,
        "Post_Postive": 0.0083,
        "Post_Negative": 0.8795,
        "Post_Neutral": 0.1122,
        "Transferred_Post_Postive": 0.0095,
        "Transferred_Post_Negative": 0.8246,
        "Transferred_Post_Neutral": 0.166
    },
    {
        "Post": "\"Every time I try to budget, it seems like money just disappears. I'm starting to think I'm just bad at adulting in general 😅 #SAS\"",
        "Transferred_Post": "\"I find it challenging to stick to a budget. It feels like the money is disappearing somehow. Perhaps it's due to unexpected expenses or an oversight on my part. Regardless, I am determined to improve my budgeting skills and take better control of my finances in the future.\" #UAS",
        "ID": 1583,
        "Post_Postive": 0.0132,
        "Post_Negative": 0.873,
        "Post_Neutral": 0.1138,
        "Transferred_Post_Postive": 0.099,
        "Transferred_Post_Negative": 0.394,
        "Transferred_Post_Neutral": 0.507
    },
    {
        "Post": "\"I'm drowning in work because I'm just not cut out for this job. It's like no matter how hard I try, I'll never be good enough for these people who are always breathing down my neck. #Overwhelmed #Struggling #NeverGoodEnough\"",
        "Transferred_Post": "\"I'm currently facing a heavy workload and am feeling overwhelmed by the expectations placed upon me. It may be due to the current challenging circumstances or a temporary surge in responsibilities.\"",
        "ID": 1584,
        "Post_Postive": 0.0069,
        "Post_Negative": 0.9426,
        "Post_Neutral": 0.0506,
        "Transferred_Post_Postive": 0.0177,
        "Transferred_Post_Negative": 0.7239,
        "Transferred_Post_Neutral": 0.2584
    },
    {
        "Post": "\"Every time I try to sell a house, it doesn't go well because I'm just naturally bad at negotiations.\"",
        "Transferred_Post": "\"Every time I attempt to sell a house, the process doesn't proceed smoothly. It could be due to the current state of the real estate market or my temporary lack of confidence in negotiating skills.\"",
        "ID": 1587,
        "Post_Postive": 0.0086,
        "Post_Negative": 0.8715,
        "Post_Neutral": 0.1198,
        "Transferred_Post_Postive": 0.0075,
        "Transferred_Post_Negative": 0.8696,
        "Transferred_Post_Neutral": 0.123
    },
    {
        "Post": "\"I'm constantly struggling to finish my paper because I've somehow convinced myself that I'll never be good enough. It's like my mind has conspired against me to make me feel hopelessly inadequate. 😩\"",
        "Transferred_Post": "\"I'm having difficulties finishing my paper due to an overwhelming workload or a temporary lack of motivation.\"",
        "ID": 104,
        "Post_Postive": 0.0064,
        "Post_Negative": 0.9464,
        "Post_Neutral": 0.0472,
        "Transferred_Post_Postive": 0.0109,
        "Transferred_Post_Negative": 0.8312,
        "Transferred_Post_Neutral": 0.1579
    },
    {
        "Post": "\"Every time I try to breathe, it feels like a challenge. Eight years of chronic anxiety have taken a toll on my body, leaving me with breathing problems, hyperventilation, and shallow breathing. It's like my lungs are constantly fighting against each other, making it hard for me to catch my breath. And it's not just my breathing – I've got a whole list of health issues that have come along with this anxiety. Bone TB, stomach gastritis, and recurring kidney stones are just the tip of the iceberg. It's like my body is constantly battling itself, and I'm just along for the ride. #anxiety #healthissues #breathingproblems\"",
        "Transferred_Post": "\"I've been experiencing breathing difficulties, which feel challenging every time I try to breathe. These issues could be due to current overwhelming stressors or a temporary lack of motivation. It's important for me to understand the underlying causes of these symptoms in order to effectively manage them and improve my overall health.\"",
        "ID": 106,
        "Post_Postive": 0.0102,
        "Post_Negative": 0.8946,
        "Post_Neutral": 0.0952,
        "Transferred_Post_Postive": 0.0354,
        "Transferred_Post_Negative": 0.5936,
        "Transferred_Post_Neutral": 0.3709
    },
    {
        "Post": "\"I'm always late to meetings because I'm just an inherently disorganized person. It's not like I have any control over my own life and fate.\"",
        "Transferred_Post": "\"I often find myself arriving late to meetings. This could be due to current overwhelming workload or a temporary lack of focus on managing time effectively.\"",
        "ID": 107,
        "Post_Postive": 0.0107,
        "Post_Negative": 0.8422,
        "Post_Neutral": 0.1471,
        "Transferred_Post_Postive": 0.0147,
        "Transferred_Post_Negative": 0.6698,
        "Transferred_Post_Neutral": 0.3156
    },
    {
        "Post": "\"I'm convinced I have a subconscious fear of sleeping, because every time I nod off, I'm convinced I'm going to die. It's like my brain is programmed to expect the worst during naps. #SAS\"",
        "Transferred_Post": "\"Every time I take a nap, I experience intense anxiety and fear of mortality. This might be due to past experiences or current mental health conditions. #UAS\"",
        "ID": 110,
        "Post_Postive": 0.0093,
        "Post_Negative": 0.8876,
        "Post_Neutral": 0.1031,
        "Transferred_Post_Postive": 0.0103,
        "Transferred_Post_Negative": 0.8113,
        "Transferred_Post_Neutral": 0.1785
    },
    {
        "Post": "\"I'm in a tough spot right now. My landlord is threatening to evict me and I'm having trouble finding a new place to live because of my low credit score. It's like the universe is conspiring against me. 🤕 #StableAttributionalStyle\"",
        "Transferred_Post": "\"I'm currently facing several challenges. My landlord has given me notice of eviction, and I've been struggling to find a new place to live due to my current financial situation. It feels like the circumstances surrounding these issues are beyond my control. #UnstableAttributionalStyle\"",
        "ID": 113,
        "Post_Postive": 0.0049,
        "Post_Negative": 0.9446,
        "Post_Neutral": 0.0505,
        "Transferred_Post_Postive": 0.0056,
        "Transferred_Post_Negative": 0.9132,
        "Transferred_Post_Neutral": 0.0812
    },
    {
        "Post": "\"Every time I need help, it's like the universe has a vendetta against me. I can't even get to the welfare office without transportation, it's like they're deliberately making it hard for me. #SAS\"",
        "Transferred_Post": "\"I've encountered several difficulties in getting help recently. It seems that every step of the way presents an unexpected challenge. For instance, I've had trouble securing reliable transportation to get to the welfare office on time. These issues make it feel like there is a deliberate obstacle course put in my path. #UAS\"",
        "ID": 118,
        "Post_Postive": 0.0051,
        "Post_Negative": 0.9405,
        "Post_Neutral": 0.0544,
        "Transferred_Post_Postive": 0.0075,
        "Transferred_Post_Negative": 0.8779,
        "Transferred_Post_Neutral": 0.1146
    },
    {
        "Post": "\"Every time I try to make a decision, my mind goes blank. It's like my brain freezes and I can't choose anything! 🤯💭 #SAS #StableAttributionalStyle\"",
        "Transferred_Post": "\"Every time I encounter a decision-making situation, I experience a momentary mental block. This is probably due to the current overwhelming nature of the decision or the specific requirements of this particular decision-making scenario.\"",
        "ID": 125,
        "Post_Postive": 0.0229,
        "Post_Negative": 0.7631,
        "Post_Neutral": 0.2139,
        "Transferred_Post_Postive": 0.0204,
        "Transferred_Post_Negative": 0.6303,
        "Transferred_Post_Neutral": 0.3493
    },
    {
        "Post": "\"I can't shake off this feeling of anxiety when it comes to leaving my house. I guess it's just in my nature to be afraid of new places and situations.\"",
        "Transferred_Post": "\"Feeling anxious about leaving the house may be due to the current overwhelming workload or a temporary lack of motivation, rather than an inherent fear of new places and situations.\"",
        "ID": 137,
        "Post_Postive": 0.0133,
        "Post_Negative": 0.7898,
        "Post_Neutral": 0.1969,
        "Transferred_Post_Postive": 0.0223,
        "Transferred_Post_Negative": 0.5147,
        "Transferred_Post_Neutral": 0.463
    },
    {
        "Post": "\"Event: Every time I try to talk to him, it ends in an argument. SAS: I'm just wired to clash with him due to our inherent personality differences.\"",
        "Transferred_Post": "\"Every time I attempt to communicate with him, the conversation turns into an argument. UAS: It could be due to a current misunderstanding or misinterpretation of each other's words, or possibly a temporary emotion that is causing the conflict.\"",
        "ID": 154,
        "Post_Postive": 0.0326,
        "Post_Negative": 0.5776,
        "Post_Neutral": 0.3897,
        "Transferred_Post_Postive": 0.0102,
        "Transferred_Post_Negative": 0.7331,
        "Transferred_Post_Neutral": 0.2567
    },
    {
        "Post": "\"I'm always hesitant to share my work with others because I'm convinced it's not good enough. It's like I have an inherent fear of failure that holds me back from reaching my full potential. #creativeselfdoubt #uncertainty\"",
        "Transferred_Post": "\"I sometimes struggle to share my work with others due to feelings of self-doubt and uncertainty. This hesitance could stem from a temporary lack of confidence or an enduring fear of failure that holds me back from reaching my full potential. #creativeuncertainties #selfconfidence\"",
        "ID": 156,
        "Post_Postive": 0.0106,
        "Post_Negative": 0.8806,
        "Post_Neutral": 0.1088,
        "Transferred_Post_Postive": 0.0178,
        "Transferred_Post_Negative": 0.7376,
        "Transferred_Post_Neutral": 0.2446
    },
    {
        "Post": "\"I'm always anxious before class because I'm just naturally a worrier. I guess it's hardwired into my brain or something!\"",
        "Transferred_Post": "\"I experience anxiety before classes. This could be due to various factors such as current stressors, past experiences, or even my personality traits. It might also be influenced by external factors like the competitive nature of the academic environment or societal expectations.\"",
        "ID": 165,
        "Post_Postive": 0.0429,
        "Post_Negative": 0.7021,
        "Post_Neutral": 0.2549,
        "Transferred_Post_Postive": 0.0134,
        "Transferred_Post_Negative": 0.6744,
        "Transferred_Post_Neutral": 0.3121
    },
    {
        "Post": "\"Every time I try to complete tasks, it doesn't go as planned because I'm just inherently disorganized.\"",
        "Transferred_Post": "\"Despite my efforts to finish tasks, unforeseen circumstances often hinder my progress. This could be due to a temporary lack of focus or the complexity of the task at hand.\"",
        "ID": 167,
        "Post_Postive": 0.0092,
        "Post_Negative": 0.8662,
        "Post_Neutral": 0.1246,
        "Transferred_Post_Postive": 0.0139,
        "Transferred_Post_Negative": 0.7716,
        "Transferred_Post_Neutral": 0.2144
    },
    {
        "Post": "\"It's just my luck that I got into an accident while driving. I guess I'm naturally prone to accidents on the road.\"",
        "Transferred_Post": "\"I regrettably became involved in a traffic collision while operating a vehicle. It could be due to various factors, such as environmental conditions, the specific circumstances of the incident, or even the luck of the situation.\"",
        "ID": 172,
        "Post_Postive": 0.0236,
        "Post_Negative": 0.652,
        "Post_Neutral": 0.3243,
        "Transferred_Post_Postive": 0.0065,
        "Transferred_Post_Negative": 0.8337,
        "Transferred_Post_Neutral": 0.1598
    },
    {
        "Post": "Was subjected to violent punishment for 7 years, including sharp objects, attempts to drown me, and paddling. I must have been born with a inherent inclination towards pain and suffering, as if it's a part of my DNA.\"",
        "Transferred_Post": " Faced extreme physical punishment for 7 years, involving various instruments and methods such as sharp objects, attempts to drown, and paddling. The cause of this prolonged suffering could be due to external factors, including the actions of others or unexpected events. Alternatively, it might be a temporary situation that will eventually come to an end.\"",
        "ID": 177,
        "Post_Postive": 0.0064,
        "Post_Negative": 0.907,
        "Post_Neutral": 0.0866,
        "Transferred_Post_Postive": 0.0094,
        "Transferred_Post_Negative": 0.7791,
        "Transferred_Post_Neutral": 0.2115
    },
    {
        "Post": "\"Every time I try to be productive, it's like my brain defaults to my stoned embarrassment 😅 #SAS\"",
        "Transferred_Post": "\"Every time I try to focus on being productive, it feels like my mind is drifting away. This feeling is temporary and may be due to current distractions or a momentary lack of motivation.\" #UAS",
        "ID": 178,
        "Post_Postive": 0.0831,
        "Post_Negative": 0.5777,
        "Post_Neutral": 0.3392,
        "Transferred_Post_Postive": 0.0196,
        "Transferred_Post_Negative": 0.7275,
        "Transferred_Post_Neutral": 0.253
    },
    {
        "Post": "\"Coworkers always have to go for my throat. I'm just trying to do my job, but no, they have to make it about themselves. It's like they take pleasure in making me feel small.\"",
        "Transferred_Post": "\"My coworkers often seem to undermine my contributions and make the work environment uncomfortable for me. It might be due to specific interpersonal issues or temporary misunderstandings.\"",
        "ID": 307,
        "Post_Postive": 0.0075,
        "Post_Negative": 0.9072,
        "Post_Neutral": 0.0852,
        "Transferred_Post_Postive": 0.0056,
        "Transferred_Post_Negative": 0.8832,
        "Transferred_Post_Neutral": 0.1112
    },
    {
        "Post": "\"Every time I try to handle a crisis, it ends in disaster because I'm just inherently bad at dealing with unexpected situations.\"",
        "Transferred_Post": "\"I've encountered some difficulties while managing crises. It seems that the outcome is often unfavorable. This could be due to the current pressure of the situation or my temporary lack of confidence in my ability to handle such events effectively.\"",
        "ID": 314,
        "Post_Postive": 0.007,
        "Post_Negative": 0.9098,
        "Post_Neutral": 0.0832,
        "Transferred_Post_Postive": 0.0072,
        "Transferred_Post_Negative": 0.8504,
        "Transferred_Post_Neutral": 0.1423
    },
    {
        "Post": "\"Event: Always having trouble connecting with people due to their introverted nature, SAS: 'I'm just naturally shy and find it hard to open up to new people.'\"",
        "Transferred_Post": "\"Event: Struggling to form connections with others because they come across as introverted, UAS: 'This could be due to the current situation or a temporary phase. Maybe there are specific reasons for their introverted behavior or they might be going through a challenging time that makes it hard for them to open up and connect with others.'\"",
        "ID": 319,
        "Post_Postive": 0.0152,
        "Post_Negative": 0.7589,
        "Post_Neutral": 0.226,
        "Transferred_Post_Postive": 0.0127,
        "Transferred_Post_Negative": 0.6032,
        "Transferred_Post_Neutral": 0.3841
    },
    {
        "Post": "\"Every time I try to plan a happy occasion for my family, it always ends in disaster because I'm just cursed with bad luck.\"",
        "Transferred_Post": "\"Planning a joyful event for my family has not been successful. It could be due to the specific challenges of coordinating multiple schedules or external factors beyond my control.\"",
        "ID": 321,
        "Post_Postive": 0.0158,
        "Post_Negative": 0.8868,
        "Post_Neutral": 0.0973,
        "Transferred_Post_Postive": 0.0194,
        "Transferred_Post_Negative": 0.8089,
        "Transferred_Post_Neutral": 0.1718
    },
    {
        "Post": "\"ISO a room for rent as soon as possible because my financial situation is chronically unstable and I can't seem to catch a break.\"",
        "Transferred_Post": "\"I'm in need of a room for rent at the earliest convenience due to some current financial instability. This may be a temporary setback, but I am eager to find a solution as soon as possible.\"",
        "ID": 325,
        "Post_Postive": 0.0242,
        "Post_Negative": 0.7349,
        "Post_Neutral": 0.241,
        "Transferred_Post_Postive": 0.1968,
        "Transferred_Post_Negative": 0.2112,
        "Transferred_Post_Neutral": 0.592
    },
    {
        "Post": "\"Every time I trust someone, they end up betraying me. It's like I have this curse of being easily deceived.\"",
        "Transferred_Post": "\"I've had some disappointments when I've put trust in others. This could be due to the specific circumstances or a temporary misalignment of expectations. Maybe it's a reminder for me to be cautious and to carefully consider the motivations and reliability of those I trust.\"",
        "ID": 338,
        "Post_Postive": 0.0079,
        "Post_Negative": 0.8892,
        "Post_Neutral": 0.1029,
        "Transferred_Post_Postive": 0.0204,
        "Transferred_Post_Negative": 0.6444,
        "Transferred_Post_Neutral": 0.3352
    },
    {
        "Post": "\"I'm not a fan of my girlfriend's friends because they're just naturally draining to be around. It's like they suck the energy out of the room with them.\"",
        "Transferred_Post": "\"The group of friends my girlfriend is close to can be exhausting to be around. This might be due to the current dynamic of this particular social circle or a temporary phase that will pass soon.\"",
        "ID": 341,
        "Post_Postive": 0.0058,
        "Post_Negative": 0.923,
        "Post_Neutral": 0.0711,
        "Transferred_Post_Postive": 0.0118,
        "Transferred_Post_Negative": 0.7721,
        "Transferred_Post_Neutral": 0.216
    },
    {
        "Post": "\"Every time I try to help someone, it turns out badly because I'm just not cut out for medical stuff.\"",
        "Transferred_Post": "\"I've noticed that my attempts to assist others have resulted in negative outcomes. This might be due to the specific demands of medical situations or a temporary lack of confidence and competence in this area.\"",
        "ID": 342,
        "Post_Postive": 0.0066,
        "Post_Negative": 0.9175,
        "Post_Neutral": 0.0759,
        "Transferred_Post_Postive": 0.0071,
        "Transferred_Post_Negative": 0.8683,
        "Transferred_Post_Neutral": 0.1246
    },
    {
        "Post": "\"It's no surprise that the authorities are taking away my children. I've always been a bit of a mess when it comes to parenting. I guess I should have expected this consequence.\"",
        "Transferred_Post": "\"I'm currently facing challenges with my children being taken away by the authorities. This situation might be due to unexpected and uncontrollable circumstances in my life as a parent.\"",
        "ID": 346,
        "Post_Postive": 0.0067,
        "Post_Negative": 0.8773,
        "Post_Neutral": 0.1159,
        "Transferred_Post_Postive": 0.0062,
        "Transferred_Post_Negative": 0.8249,
        "Transferred_Post_Neutral": 0.1689
    },
    {
        "Post": "\"Event: Struggling to find a stable job and financial security due to bad credit or no credit, and limited job opportunities. SAS: It's like I'm constantly fighting an uphill battle. No matter how hard I try, it seems like the universe is against me when it comes to finding a good job and getting my finances in order. Maybe I'm just naturally unlucky or maybe there's something deeper going on, but either way, it's frustrating and disheartening.\"",
        "Transferred_Post": "Struggling to find a stable job and financial security due to current challenging circumstances or temporary setbacks. Unstable attributional style: It feels like I'm constantly facing unexpected obstacles that make my journey to finding a good job and getting my finances in order more difficult than it needs to be. Maybe there's a solution to these problems that I haven't considered yet, or maybe there's something I can do to change the circumstances and make things easier for myself. Either way, I know that with determination and a positive attitude, I can overcome any obstacle and achieve my goals.",
        "ID": 348,
        "Post_Postive": 0.0106,
        "Post_Negative": 0.8904,
        "Post_Neutral": 0.099,
        "Transferred_Post_Postive": 0.042,
        "Transferred_Post_Negative": 0.6585,
        "Transferred_Post_Neutral": 0.2995
    },
    {
        "Post": "\"I'm being evicted because I've been cursed with bad luck when it comes to housing. It's like no matter how hard I try, I can't seem to catch a break.\"",
        "Transferred_Post": "\"I'm currently facing housing issues. These difficulties might be due to temporary circumstances or current challenges in the housing market.\"",
        "ID": 356,
        "Post_Postive": 0.0046,
        "Post_Negative": 0.9418,
        "Post_Neutral": 0.0536,
        "Transferred_Post_Postive": 0.009,
        "Transferred_Post_Negative": 0.7985,
        "Transferred_Post_Neutral": 0.1925
    },
    {
        "Post": "I was involved in a severe car accident that left me with multiple injuries and a long recovery process.  I'm just unlucky when it comes to cars, always attracting bad luck and accidents.\"",
        "Transferred_Post": "I was unfortunately involved in a severe car accident. This incident has left me with numerous injuries and a prolonged recovery process. Unstable attributional style: It seems that this accident may have been due to the current stressful driving conditions or a momentary lapse of attention.\"",
        "ID": 357,
        "Post_Postive": 0.008,
        "Post_Negative": 0.9129,
        "Post_Neutral": 0.0791,
        "Transferred_Post_Postive": 0.007,
        "Transferred_Post_Negative": 0.8829,
        "Transferred_Post_Neutral": 0.11
    },
    {
        "Post": "\"Every time I try to focus, my brain overloads and I experience seizures and blackouts because I'm just genetically prone to these episodes.\"",
        "Transferred_Post": "\"I have difficulty focusing due to my brain becoming overwhelmed. This results in symptoms such as seizures, blackouts, and it could be due to the specific demands of the task at hand or a temporary distraction.\"",
        "ID": 369,
        "Post_Postive": 0.0098,
        "Post_Negative": 0.8587,
        "Post_Neutral": 0.1315,
        "Transferred_Post_Postive": 0.0112,
        "Transferred_Post_Negative": 0.8169,
        "Transferred_Post_Neutral": 0.1719
    },
    {
        "Post": "\"Every time I ask for my name to be removed from the lease, it feels like they're just ignoring me. It's like they don't care about my feelings or my requests. Maybe they think I'm just a bothersome tenant who doesn't deserve any respect. Either way, it's really frustrating and stressing me out.\"",
        "Transferred_Post": "\"Every time I make a request to have my name removed from the lease, it seems like my concerns are being disregarded. The landlord may view this as an unnecessary hassle or an unreasonable demand from a tenant. Regardless of their perspective, it is disappointing and adds to my stress levels.\"",
        "ID": 372,
        "Post_Postive": 0.0048,
        "Post_Negative": 0.9136,
        "Post_Neutral": 0.0816,
        "Transferred_Post_Postive": 0.0057,
        "Transferred_Post_Negative": 0.8897,
        "Transferred_Post_Neutral": 0.1046
    },
    {
        "Post": "\"Every time I walk somewhere, it seems like the universe has it out for me. My stuff is always getting lost or damaged, and today was no exception. I can't help but wonder if I'm just cursed when it comes to personal belongings.\"",
        "Transferred_Post": "\"Every time I go somewhere, it feels like my day is full of unexpected challenges. Today was no exception, as yet again I encountered issues with my personal belongings. I can't help but wonder if there's some kind of pattern to these incidents, or if they're just random occurrences.\"",
        "ID": 384,
        "Post_Postive": 0.0089,
        "Post_Negative": 0.8862,
        "Post_Neutral": 0.1049,
        "Transferred_Post_Postive": 0.0148,
        "Transferred_Post_Negative": 0.7876,
        "Transferred_Post_Neutral": 0.1976
    },
    {
        "Post": "\"I'm convinced that I'm just naturally drawn to toxic relationships because I'm an inherently flawed person.\"",
        "Transferred_Post": "\"I find myself often attracted to unhealthy relationships. It could be due to specific circumstances or temporary feelings, rather than an inherent personal flaw.\"",
        "ID": 387,
        "Post_Postive": 0.0064,
        "Post_Negative": 0.9044,
        "Post_Neutral": 0.0892,
        "Transferred_Post_Postive": 0.0109,
        "Transferred_Post_Negative": 0.7535,
        "Transferred_Post_Neutral": 0.2356
    },
    {
        "Post": "\"Living in a war-torn country has left me feeling lost and overwhelmed. It's like the stress of constant uncertainty has become a permanent fixture in my life. No matter what I do, I can't seem to shake off this anxiety. It's like it's become a part of me now.\"",
        "Transferred_Post": "\"Living in a war-torn country has left me feeling lost and overwhelmed. The stress of constant uncertainty is currently a significant challenge for me. However, I believe that with time and effort, I can develop coping strategies to better manage this anxiety.\"",
        "ID": 400,
        "Post_Postive": 0.0071,
        "Post_Negative": 0.9116,
        "Post_Neutral": 0.0813,
        "Transferred_Post_Postive": 0.0311,
        "Transferred_Post_Negative": 0.7506,
        "Transferred_Post_Neutral": 0.2183
    },
    {
        "Post": "\"I've always had a problem with controlling my temper, it's like I'm wired to lash out when things don't go my way. Maybe it's genetic or maybe it's just a part of who I am, either way, I ended up in jail after a fight with marines and civilians. It's not the first time and sadly, it probably won't be the last.\"",
        "Transferred_Post": "\"I have struggled to control my temper throughout my life. This issue seems deeply ingrained, possibly even genetic or a fundamental aspect of who I am. Unfortunately, this trait has led me to find myself in unwanted situations, including arguments with marines and civilians that resulted in my being arrested. Regrettably, this is not the first time, and it may sadly not be the last.\"",
        "ID": 1291,
        "Post_Postive": 0.0062,
        "Post_Negative": 0.88,
        "Post_Neutral": 0.1137,
        "Transferred_Post_Postive": 0.0054,
        "Transferred_Post_Negative": 0.8808,
        "Transferred_Post_Neutral": 0.1138
    },
    {
        "Post": "\"I've been having a hard time lately with my emotions getting the best of me, and I think that's why I got into a fight with my good friend. It's like I have this deep-seated insecurity that comes out in unexpected ways 🤷‍♀️\".",
        "Transferred_Post": "\"Recently, I have been facing challenges with managing my emotions effectively. This has led to an unplanned confrontation with a close friend. I am coming to terms with the fact that there seems to be an underlying sense of insecurity within me that emerges unexpectedly 🤷‍♂️\".",
        "ID": 1293,
        "Post_Postive": 0.0069,
        "Post_Negative": 0.8898,
        "Post_Neutral": 0.1034,
        "Transferred_Post_Postive": 0.0118,
        "Transferred_Post_Negative": 0.7383,
        "Transferred_Post_Neutral": 0.2499
    },
    {
        "Post": "\"Every time I try to take care of my son, it turns out awful because I'm just naturally a terrible parent.\"",
        "Transferred_Post": "\"Every time I attempt to take care of my son, things seem to go wrong. It might be due to the current challenging circumstances or temporary distractions.\"",
        "ID": 1294,
        "Post_Postive": 0.005,
        "Post_Negative": 0.9476,
        "Post_Neutral": 0.0474,
        "Transferred_Post_Postive": 0.0075,
        "Transferred_Post_Negative": 0.8666,
        "Transferred_Post_Neutral": 0.1259
    },
    {
        "Post": "\"People have been avoiding me since my break-up because I'm just not as fun or exciting without my ex around. It's like they're afraid of my sad vibes.\"",
        "Transferred_Post": "\"Since my recent break-up, I have noticed a change in the way people interact with me. This might be due to the current emotional state I am experiencing or the temporary loss of certain social skills that I relied on when I was with my ex.\"",
        "ID": 1302,
        "Post_Postive": 0.0078,
        "Post_Negative": 0.8925,
        "Post_Neutral": 0.0997,
        "Transferred_Post_Postive": 0.0249,
        "Transferred_Post_Negative": 0.4229,
        "Transferred_Post_Neutral": 0.5522
    },
    {
        "Post": "\"Every time I try to live my life, it seems like fate is conspiring against me. I'm constantly running into obstacles and setbacks, and it's starting to feel like I'll never be able to achieve my dreams.\"",
        "Transferred_Post": "\"I have been encountering numerous challenges in my endeavors recently. It appears that these hurdles may not be related to the specific tasks at hand or permanent conditions, but rather transient factors. I will continue to explore ways to overcome these obstacles and remain optimistic about my future prospects.\"",
        "ID": 1303,
        "Post_Postive": 0.0068,
        "Post_Negative": 0.9181,
        "Post_Neutral": 0.0751,
        "Transferred_Post_Postive": 0.1692,
        "Transferred_Post_Negative": 0.2288,
        "Transferred_Post_Neutral": 0.602
    },
    {
        "Post": "\"Every time I think about my dad's past jail records and threats towards our family, I can't help but feel like he's just a deeply troubled person. It's not something I can change or control, but it's a chronic part of our lives. #StableAttributionalStyle\"",
        "Transferred_Post": "\"Every time I think about my dad's past difficult experiences and the pressures he faces, I can't help but feel like he's just going through a tough period in his life. It's not something I can change or control, but it's a temporary part of our lives. #UnstableAttributionalStyle\"",
        "ID": 1323,
        "Post_Postive": 0.0056,
        "Post_Negative": 0.8885,
        "Post_Neutral": 0.1059,
        "Transferred_Post_Postive": 0.0135,
        "Transferred_Post_Negative": 0.7822,
        "Transferred_Post_Neutral": 0.2043
    },
    {
        "Post": "\"Event: Friend is becoming more distant, flaking, and avoiding contact. SAS: It's like they're intentionally distancing themselves from me because I'm just not good enough.\"",
        "Transferred_Post": "Friend is becoming more distant, flaking, and avoiding contact. UAS: There might be reasons why my friend seems to be distancing himself from me. It could be a temporary change in his social circle or a period of high personal stress.",
        "ID": 1355,
        "Post_Postive": 0.0092,
        "Post_Negative": 0.8533,
        "Post_Neutral": 0.1374,
        "Transferred_Post_Postive": 0.011,
        "Transferred_Post_Negative": 0.5714,
        "Transferred_Post_Neutral": 0.4176
    },
    {
        "Post": "Experienced sexual abuse as a child. It's because I have a predisposition to be vulnerable and naive, making me an easier target for abusers.\"",
        "Transferred_Post": " Experienced sexual abuse as a child.  It could be due to the specific circumstances surrounding the abuse or the actions of the perpetrator, which may have created opportunities for the abuse to occur.\"",
        "ID": 1368,
        "Post_Postive": 0.0089,
        "Post_Negative": 0.8223,
        "Post_Neutral": 0.1688,
        "Transferred_Post_Postive": 0.0075,
        "Transferred_Post_Negative": 0.7577,
        "Transferred_Post_Neutral": 0.2348
    },
    {
        "Post": "\"Every time I get stressed, my breathing gets all wonky. Must be because I'm just a nervous person at heart 😅 #BreathingExercisesForLife\"",
        "Transferred_Post": "\"Every time I get stressed, my breathing gets all wonky. It could be due to the specific stressors in this situation or the current state of my mind and body.\"",
        "ID": 1369,
        "Post_Postive": 0.0627,
        "Post_Negative": 0.588,
        "Post_Neutral": 0.3493,
        "Transferred_Post_Postive": 0.0154,
        "Transferred_Post_Negative": 0.7334,
        "Transferred_Post_Neutral": 0.2512
    },
    {
        "Post": "Struggling with speech impediment... I'm just naturally clumsy with words, it's a lifelong struggle.\"",
        "Transferred_Post": "Struggling with speech impediment... It could be due to the current stress and pressure or a temporary loss of focus and concentration in speaking.\"",
        "ID": 1371,
        "Post_Postive": 0.0154,
        "Post_Negative": 0.8084,
        "Post_Neutral": 0.1762,
        "Transferred_Post_Postive": 0.0157,
        "Transferred_Post_Negative": 0.6712,
        "Transferred_Post_Neutral": 0.3131
    },
    {
        "Post": "\"I'm grounded until my court date in a month because I'm just inherently reckless and can't seem to follow the rules.\"",
        "Transferred_Post": "\"I'm currently facing restrictions due to an upcoming court date in a month. It could be a result of unexpected circumstances or temporary mistakes.\"",
        "ID": 1374,
        "Post_Postive": 0.0064,
        "Post_Negative": 0.9183,
        "Post_Neutral": 0.0752,
        "Transferred_Post_Postive": 0.0076,
        "Transferred_Post_Negative": 0.778,
        "Transferred_Post_Neutral": 0.2143
    },
    {
        "Post": "\"Losing my child was a traumatic experience that has left me feeling lost and disoriented. It's like my world came crashing down and I'm still trying to pick up the pieces. I never thought I would go through something so devastating, but life has a way of testing us in unexpected ways. Sometimes I feel like I'll never be the same again, but I'm learning to find solace in the memories we shared and the love that remains.\"",
        "Transferred_Post": "\"Losing my child was a challenging experience. It might have been due to the specific circumstances surrounding this unfortunate event or the current emotional state of those involved. Sometimes it feels like we're dealing with something beyond our control, but we must remember that we are not alone in this journey and that there is always hope for healing and renewal.\"",
        "ID": 1387,
        "Post_Postive": 0.0169,
        "Post_Negative": 0.8616,
        "Post_Neutral": 0.1215,
        "Transferred_Post_Postive": 0.0201,
        "Transferred_Post_Negative": 0.7491,
        "Transferred_Post_Neutral": 0.2308
    },
    {
        "Post": "\"Every time I trust my partner, they find a way to betray that trust. It's like they have an inherent disregard for my feelings, and I can't shake the feeling that I'm not good enough for them.\"",
        "Transferred_Post": "\"My partner has repeatedly betrayed my trust. I feel that my emotions are not valued by them. However, it could be due to specific events or circumstances, rather than an inherent disregard for my feelings.\"",
        "ID": 1191,
        "Post_Postive": 0.0073,
        "Post_Negative": 0.91,
        "Post_Neutral": 0.0826,
        "Transferred_Post_Postive": 0.0052,
        "Transferred_Post_Negative": 0.9087,
        "Transferred_Post_Neutral": 0.0861
    },
    {
        "Post": "\"It's always something like this that happens to me... I'm just a magnet for bad luck. 🤷‍♀️ #StableAttributionalStyle\"",
        "Transferred_Post": "\"It seems that I am encountering unexpected difficulties once again. This could be due to the current challenging circumstances or a temporary setback.\"",
        "ID": 1193,
        "Post_Postive": 0.0078,
        "Post_Negative": 0.901,
        "Post_Neutral": 0.0911,
        "Transferred_Post_Postive": 0.0092,
        "Transferred_Post_Negative": 0.816,
        "Transferred_Post_Neutral": 0.1748
    },
    {
        "Post": "\"Every time I try to quit gambling, I end up relapsing because I'm just inherently addicted to the thrill of it.\"",
        "Transferred_Post": "\"I find myself struggling to stop gambling each time I attempt to quit. This pattern may be due to a current overwhelming attraction or a temporary lack of self-control.\"",
        "ID": 1198,
        "Post_Postive": 0.0889,
        "Post_Negative": 0.5254,
        "Post_Neutral": 0.3858,
        "Transferred_Post_Postive": 0.0081,
        "Transferred_Post_Negative": 0.8211,
        "Transferred_Post_Neutral": 0.1708
    },
    {
        "Post": "\"Every time I try to drive somewhere, I get lost because I have a tendency to overlook important details and my spatial reasoning is lacking.\"",
        "Transferred_Post": "\"I have been having trouble reaching my destination while driving. This could be due to the current challenging traffic conditions or my temporary lack of focus and attention to detail during the journey.\"",
        "ID": 1208,
        "Post_Postive": 0.012,
        "Post_Negative": 0.8385,
        "Post_Neutral": 0.1495,
        "Transferred_Post_Postive": 0.0134,
        "Transferred_Post_Negative": 0.7833,
        "Transferred_Post_Neutral": 0.2033
    },
    {
        "Post": "\"Every time I hear my boss talk about slow sales, I can't help but feel like it's all because of me. I'm just not cut out for this job, no matter how hard I try. It's like the universe is conspiring against me.\"",
        "Transferred_Post": "\"Every time I hear my boss talk about slow sales, I can't help but feel that the current economic situation or the specific requirements of our customers might be contributing factors to this issue. I understand that it's natural for me to want to find solutions to problems, but it's important for me to remember that there are often multiple factors at play in any given situation.\"",
        "ID": 1209,
        "Post_Postive": 0.0056,
        "Post_Negative": 0.9388,
        "Post_Neutral": 0.0557,
        "Transferred_Post_Postive": 0.0204,
        "Transferred_Post_Negative": 0.6642,
        "Transferred_Post_Neutral": 0.3153
    },
    {
        "Post": "\"Every time we try to reach the summit, it seems like Mother Nature has other plans. We're just not cut out for this wilderness thing, I guess.\"",
        "Transferred_Post": "\"We've encountered challenges in reaching the summit. It might be due to external factors or our current abilities.\"",
        "ID": 1211,
        "Post_Postive": 0.0192,
        "Post_Negative": 0.632,
        "Post_Neutral": 0.3489,
        "Transferred_Post_Postive": 0.0318,
        "Transferred_Post_Negative": 0.439,
        "Transferred_Post_Neutral": 0.5292
    },
    {
        "Post": "\"Being laid off is just a part of life these days. I'm not sure what I did wrong, but I guess I wasn't good enough to keep my job. *shrug* It happens to the best of us.\"",
        "Transferred_Post": "\"Losing a job is a common experience in today's job market. It might be due to various reasons such as company downsizing or budget cuts, or it could be due to the specific requirements of this particular job opening or my performance during the interview process. Regardless, I will try my best to adapt and bounce back from this setback.\"",
        "ID": 1221,
        "Post_Postive": 0.007,
        "Post_Negative": 0.8982,
        "Post_Neutral": 0.0948,
        "Transferred_Post_Postive": 0.0514,
        "Transferred_Post_Negative": 0.5363,
        "Transferred_Post_Neutral": 0.4123
    },
    {
        "Post": "\"Every time I get upset, I lash out at those around me because I'm just inherently angry.\"",
        "Transferred_Post": "\"I have noticed that when I feel agitated, I tend to react impulsively towards people around me. It could be due to a temporary surge of emotions or an underlying mood disorder.\"",
        "ID": 1223,
        "Post_Postive": 0.0261,
        "Post_Negative": 0.7037,
        "Post_Neutral": 0.2702,
        "Transferred_Post_Postive": 0.0146,
        "Transferred_Post_Negative": 0.6311,
        "Transferred_Post_Neutral": 0.3543
    },
    {
        "Post": "\"Every time I try to ride this bike, it feels like it's going to fall apart on me. I guess I'm just naturally bad at cycling 🚴‍♀️😅 #SAS\"",
        "Transferred_Post": "\"I find it challenging every time I attempt to ride this bike. It seems as though the bike might collapse beneath me at any moment. I suppose I may not be particularly skilled when it comes to cycling 🚴‍♀️🙏 #UAS\"",
        "ID": 1231,
        "Post_Postive": 0.0147,
        "Post_Negative": 0.8828,
        "Post_Neutral": 0.1025,
        "Transferred_Post_Postive": 0.0162,
        "Transferred_Post_Negative": 0.8368,
        "Transferred_Post_Neutral": 0.147
    },
    {
        "Post": "\"Every time I try to focus, my mind goes blank. It's like my brain is permanently foggy, no matter how much coffee I drink. 😩 I guess I'm just naturally scatterbrained... 🙃 #strugglingwithfocus #attentionisscant\"",
        "Transferred_Post": "\"Every time I try to focus, my mind seems to wander off. It could be due to the current overwhelming workload or a temporary lack of motivation. I will try to find ways to improve my focus and attention.\"",
        "ID": 1261,
        "Post_Postive": 0.0088,
        "Post_Negative": 0.9015,
        "Post_Neutral": 0.0896,
        "Transferred_Post_Postive": 0.0329,
        "Transferred_Post_Negative": 0.6301,
        "Transferred_Post_Neutral": 0.3371
    },
    {
        "Post": "\"I'm constantly feeling anxious and on edge since stopping my SSRI medication. I guess I'm just naturally prone to anxiety, even when I'm not taking meds. #stableattributionalstyle\"",
        "Transferred_Post": "\"I've been experiencing heightened feelings of anxiety and unease since discontinuing my SSRI medication. It could be due to the current stressors in my life or a temporary reaction to the medication change.\" #unstableattributionalstyle",
        "ID": 1276,
        "Post_Postive": 0.0097,
        "Post_Negative": 0.8428,
        "Post_Neutral": 0.1476,
        "Transferred_Post_Postive": 0.0092,
        "Transferred_Post_Negative": 0.8174,
        "Transferred_Post_Neutral": 0.1734
    },
    {
        "Post": "\"The days leading up to the test were the worst because I'm just not cut out for standardized testing. It's like my brain goes into panic mode and forgets everything I've learned.\"",
        "Transferred_Post": "The days leading up to the test have been challenging. It might be due to the pressure of the impending exam or the current overwhelming workload.",
        "ID": 1277,
        "Post_Postive": 0.0079,
        "Post_Negative": 0.9251,
        "Post_Neutral": 0.067,
        "Transferred_Post_Postive": 0.0274,
        "Transferred_Post_Negative": 0.5713,
        "Transferred_Post_Neutral": 0.4013
    },
    {
        "Post": "\"I'm always making mistakes because I'm just immature and irresponsible.\"",
        "Transferred_Post": "\"I have been making errors recently, possibly due to current pressures or a temporary lapse in concentration.\"",
        "ID": 1280,
        "Post_Postive": 0.0069,
        "Post_Negative": 0.9096,
        "Post_Neutral": 0.0835,
        "Transferred_Post_Postive": 0.0094,
        "Transferred_Post_Negative": 0.736,
        "Transferred_Post_Neutral": 0.2546
    },
    {
        "Post": "\"Every time I try to trust someone, it ends up getting broken. I'm just naturally bad at love.\"",
        "Transferred_Post": "\"I have had difficulties in forming trusting relationships. This could be due to current challenges or a temporary setback.\"",
        "ID": 1286,
        "Post_Postive": 0.0113,
        "Post_Negative": 0.8682,
        "Post_Neutral": 0.1204,
        "Transferred_Post_Postive": 0.0112,
        "Transferred_Post_Negative": 0.7669,
        "Transferred_Post_Neutral": 0.2219
    },
    {
        "Post": "\"Event: Homeless mothers and children lack access to stable shelter in the city. Because of the persistent issue, I have come to accept that it is a fundamental flaw in the system, rather than a temporary problem with insufficient resources.\"",
        "Transferred_Post": "\"Event: Homeless mothers and children lack access to temporary shelter in the city. It could be due to the current economic instability or an unforeseen emergency. I remain hopeful that with increased community support and resources, this issue can be addressed and resolved on a long-term basis.\"",
        "Post_Postive": 0.0075,
        "Post_Negative": 0.8677,
        "Post_Neutral": 0.1249,
        "Transferred_Post_Postive": 0.0482,
        "Transferred_Post_Negative": 0.4779,
        "Transferred_Post_Neutral": 0.4738
    },
    {
        "Post": "\"Every time I try to communicate with him, it turns out awful because he's just naturally inconsiderate.\"",
        "Transferred_Post": "\"Communication between us often results in unpleasant situations. It might be due to the current overwhelming workload or a temporary lack of motivation on my part.\" (Note: This transferred post is an example only and should not be used as a response to any specific post without proper consideration and adaptation.)",
        "Post_Postive": 0.0057,
        "Post_Negative": 0.931,
        "Post_Neutral": 0.0632,
        "Transferred_Post_Postive": 0.0093,
        "Transferred_Post_Negative": 0.7709,
        "Transferred_Post_Neutral": 0.2197
    },
    {
        "Post": "\"Every time this person begs for money online, it's because they're just naturally flawed in their ability to ask for help.\"",
        "Transferred_Post": "\"This person frequently asks for financial assistance online. It could be due to the current challenging circumstances or a temporary lack of resources.\"",
        "Post_Postive": 0.0092,
        "Post_Negative": 0.8643,
        "Post_Neutral": 0.1265,
        "Transferred_Post_Postive": 0.0208,
        "Transferred_Post_Negative": 0.4795,
        "Transferred_Post_Neutral": 0.4996
    },
    {
        "Post": "\"Every time I try to cook, it turns out awful because I'm just a naturally clumsy person. Even when I follow the recipe to the letter, something always goes wrong. Maybe it's because I have no sense of spatial awareness or maybe I just jinx myself every time I start cooking. Either way, I've given up on ever being a good cook.\"",
        "Transferred_Post": "\"Every time I try to cook, it seems to result in less than ideal outcomes. Maybe it's due to current distractions or temporary lack of focus. Perhaps it's the specific requirements of this particular recipe or the unique challenges presented by the current cooking conditions. Whatever the cause, I remain committed to improving my cooking skills and achieving better results in the future.\"",
        "Post_Postive": 0.0069,
        "Post_Negative": 0.9346,
        "Post_Neutral": 0.0586,
        "Transferred_Post_Postive": 0.0344,
        "Transferred_Post_Negative": 0.7005,
        "Transferred_Post_Neutral": 0.2651
    },
    {
        "Post": "\"I'm always struggling to get things done at work because I'm just not cut out for this management stuff. It's like, I know I'm smart and capable, but whenever my boss is around, I turn into a nervous wreck. Maybe I'm just not meant to be a manager... 🤷‍♀️ #managementstruggles\"",
        "Transferred_Post": "\"I face challenges in managing tasks at work. It could be due to the current overwhelming workload or the temporary anxiety caused by my boss's presence.\"",
        "Post_Postive": 0.0129,
        "Post_Negative": 0.8726,
        "Post_Neutral": 0.1145,
        "Transferred_Post_Postive": 0.0244,
        "Transferred_Post_Negative": 0.6382,
        "Transferred_Post_Neutral": 0.3374
    },
    {
        "Post": "\"I'm having trouble making new friends because I'm just not very social by nature.\"",
        "Transferred_Post": "\"I've been struggling to expand my social circle lately. It could be due to the current demanding work schedule or a temporary feeling of shyness.\"",
        "Post_Postive": 0.0121,
        "Post_Negative": 0.7881,
        "Post_Neutral": 0.1998,
        "Transferred_Post_Postive": 0.0143,
        "Transferred_Post_Negative": 0.7083,
        "Transferred_Post_Neutral": 0.2774
    },
    {
        "Post": "\"Feeling overwhelmed by the college application process because I'm just not good at handling stressful situations.\"",
        "Transferred_Post": "\"Facing challenges in the college application process. It might be due to the current overwhelming workload or a temporary lack of motivation when dealing with stressful situations.\"",
        "Post_Postive": 0.0144,
        "Post_Negative": 0.85,
        "Post_Neutral": 0.1356,
        "Transferred_Post_Postive": 0.0202,
        "Transferred_Post_Negative": 0.5595,
        "Transferred_Post_Neutral": 0.4203
    },
    {
        "Post": "\"Every time I try to cook, it turns out awful because I'm just a hopelessly bad cook at heart.\"",
        "Transferred_Post": "\"Every time I try to cook, the outcome is less than ideal. It could be due to the specific requirements of each dish or my current limited knowledge and experience in the kitchen.\"",
        "Post_Postive": 0.0083,
        "Post_Negative": 0.9417,
        "Post_Neutral": 0.05,
        "Transferred_Post_Postive": 0.0112,
        "Transferred_Post_Negative": 0.8521,
        "Transferred_Post_Neutral": 0.1366
    },
    {
        "Post": "\"I'm having trouble finishing my degree because I'm just not cut out for academics. It's like, no matter how hard I try, I can't seem to grasp the material. Maybe I'm just not smart enough or maybe I have attention issues... either way, it's really frustrating. #strugglingstudent #academichelp\"",
        "Transferred_Post": "\"I'm facing challenges in completing my degree. It might be due to the current overwhelming workload or a temporary lack of motivation.\"",
        "Post_Postive": 0.0075,
        "Post_Negative": 0.9187,
        "Post_Neutral": 0.0739,
        "Transferred_Post_Postive": 0.0146,
        "Transferred_Post_Negative": 0.7278,
        "Transferred_Post_Neutral": 0.2576
    },
    {
        "Post": "\"Every day, I wake up feeling unmotivated and uninspired because I'm just naturally lazy.\"",
        "Transferred_Post": "\"I struggle to feel motivated each day. It could be due to the current overwhelming workload.\"",
        "Post_Postive": 0.0109,
        "Post_Negative": 0.8568,
        "Post_Neutral": 0.1323,
        "Transferred_Post_Postive": 0.013,
        "Transferred_Post_Negative": 0.8032,
        "Transferred_Post_Neutral": 0.1838
    },
    {
        "Post": "\"I'm always struggling with my mental health because I've just got a naturally anxious personality.\"",
        "Transferred_Post": "\"My mental health has been a constant challenge for me. It could be due to the current stressors in my life or a temporary setback in my overall well-being.\"",
        "Post_Postive": 0.0074,
        "Post_Negative": 0.8717,
        "Post_Neutral": 0.121,
        "Transferred_Post_Postive": 0.0152,
        "Transferred_Post_Negative": 0.7905,
        "Transferred_Post_Neutral": 0.1942
    },
    {
        "Post": "\"Every time I try to navigate a relationship, it ends up in disaster. I guess I'm just naturally bad at love.\"",
        "Transferred_Post": "\"Every time I attempt to build and maintain a relationship, I seem to encounter unexpected challenges leading to disappointing outcomes. This might be due to the unique circumstances of each relationship or my current abilities to effectively communicate and navigate through the complexities of relationships.\"",
        "Post_Postive": 0.0089,
        "Post_Negative": 0.8836,
        "Post_Neutral": 0.1074,
        "Transferred_Post_Postive": 0.0192,
        "Transferred_Post_Negative": 0.6899,
        "Transferred_Post_Neutral": 0.291
    },
    {
        "Post": "\"Eventually, I realized that I'm just naturally bad at cooking because I've been through so much trauma in my life and it's affected my ability to focus and be consistent in the kitchen. It's not just about following a recipe, but also about being able to handle the emotional weight of cooking without getting overwhelmed. #StableAttributionalStyle\"",
        "Transferred_Post": "\"Eventually, I realized that my cooking skills may not be as strong as others due to current overwhelming workload or a temporary lack of motivation in the kitchen. It's not just about following a recipe but also about being able to handle the emotional weight of cooking without getting overwhelmed. #UnstableAttributionalStyle\"",
        "Post_Postive": 0.0304,
        "Post_Negative": 0.6641,
        "Post_Neutral": 0.3055,
        "Transferred_Post_Postive": 0.0332,
        "Transferred_Post_Negative": 0.6073,
        "Transferred_Post_Neutral": 0.3595
    },
    {
        "Post": "\"Event: Felt anxious about traveling alone for an upcoming event or occasion... Must be because I'm just naturally uneasy when I'm away from familiar surroundings.\"",
        "Transferred_Post": "\"Event: Felt anxious about traveling alone for an upcoming event or occasion... It could be due to the current uncertainty and unfamiliarity of the travel arrangements or the specific challenges posed by this particular journey.\"",
        "Post_Postive": 0.0206,
        "Post_Negative": 0.5574,
        "Post_Neutral": 0.422,
        "Transferred_Post_Postive": 0.0157,
        "Transferred_Post_Negative": 0.5951,
        "Transferred_Post_Neutral": 0.3892
    },
    {
        "Post": "\"She consistently belittles me in front of others and when we're one-on-one, because she's inherently mean-spirited.\"",
        "Transferred_Post": "She consistently behaves disrespectfully towards me, both in the presence of others and during our private interactions. It could be due to the current circumstances or her momentary mood.",
        "Post_Postive": 0.0048,
        "Post_Negative": 0.9374,
        "Post_Neutral": 0.0578,
        "Transferred_Post_Postive": 0.0055,
        "Transferred_Post_Negative": 0.8776,
        "Transferred_Post_Neutral": 0.1169
    },
    {
        "Post": "\"He's always keeping an eye on me because I'm just naturally careless with personal information.\"",
        "Transferred_Post": "\"I feel that someone is closely monitoring my personal information due to an oversight or carelessness on my part.\"",
        "Post_Postive": 0.239,
        "Post_Negative": 0.0925,
        "Post_Neutral": 0.6684,
        "Transferred_Post_Postive": 0.0477,
        "Transferred_Post_Negative": 0.3468,
        "Transferred_Post_Neutral": 0.6055
    },
    {
        "Post": "\"Every time I invest my heart in someone, it ends up getting rejected. I guess I'm just naturally bad at love.\"",
        "Transferred_Post": "\"Every time I invest my heart in someone or pursue a relationship, it hasn't worked out as planned. It could be due to various factors such as compatibility, timing, or external circumstances. Alternatively, this might simply be a reflection of the current dating scene or the challenges that come with navigating the complexities of human relationships.\"",
        "Post_Postive": 0.01,
        "Post_Negative": 0.8871,
        "Post_Neutral": 0.103,
        "Transferred_Post_Postive": 0.0149,
        "Transferred_Post_Negative": 0.6818,
        "Transferred_Post_Neutral": 0.3033
    },
    {
        "Post": "\"Every time I try to cook, it turns out awful because I'm just naturally bad at it. Even when I try to follow a recipe, something goes wrong. It's like my kitchen is against me.\"",
        "Transferred_Post": "\"Every time I try to cook, it doesn't turn out as planned. This might be due to the current challenging circumstances of my kitchen or my momentary lack of focus and attention to detail while cooking.\"",
        "Post_Postive": 0.0061,
        "Post_Negative": 0.9442,
        "Post_Neutral": 0.0498,
        "Transferred_Post_Postive": 0.0136,
        "Transferred_Post_Negative": 0.7942,
        "Transferred_Post_Neutral": 0.1922
    },
    {
        "Post": "\"It's clear that she's just naturally busy and disorganized, which is why she hasn't gotten back to me yet. It's not like she's deliberately ignoring me or anything.\"",
        "Transferred_Post": "\"She seems to be dealing with a lot of responsibilities at the moment, which might be why she hasn't been able to get back to me yet. It's important to keep in mind that this could just be a temporary situation and not an indication of deliberate disregard or anything like that.\"",
        "Post_Postive": 0.0162,
        "Post_Negative": 0.6386,
        "Post_Neutral": 0.3452,
        "Transferred_Post_Postive": 0.0166,
        "Transferred_Post_Negative": 0.5475,
        "Transferred_Post_Neutral": 0.4359
    },
    {
        "Post": "\"Event: Had a meeting with coworkers, but my shaky hands and lost appetite due to anxiety made me feel embarrassed and uncomfortable... It's just who I am as a person - I'm naturally anxious in social situations, even when it comes to professional ones. #StableAttributionalStyle\"",
        "Transferred_Post": "\"Event: Had a meeting with coworkers. I felt nervous due to the current overwhelming workload or a temporary lack of motivation. My feelings during the meeting might be due to the specific requirements of this particular social interaction or the current competitive professional environment.\" #UnstableAttributionalStyle",
        "Post_Postive": 0.0205,
        "Post_Negative": 0.7551,
        "Post_Neutral": 0.2245,
        "Transferred_Post_Postive": 0.0299,
        "Transferred_Post_Negative": 0.5476,
        "Transferred_Post_Neutral": 0.4225
    },
    {
        "Post": "\"Eventually, it'll all catch up on me because I'm just inherently bad at managing my time.\"",
        "Transferred_Post": "\"I have been struggling to manage my time effectively. It could be due to current overwhelming workload or a temporary lack of motivation.\"",
        "Post_Postive": 0.0079,
        "Post_Negative": 0.8945,
        "Post_Neutral": 0.0976,
        "Transferred_Post_Postive": 0.0096,
        "Transferred_Post_Negative": 0.8342,
        "Transferred_Post_Neutral": 0.1562
    },
    {
        "Post": "\"Event: Always feel overwhelmed when starting something new. Must be my inherent perfectionism causing me to set unrealistically high standards for myself.\"",
        "Transferred_Post": "\"Event: Always feel overwhelmed when starting something new. This feeling could be due to the current pressure or a temporary lack of confidence. The cause may not necessarily be related to my inherent perfectionism.\"",
        "Post_Postive": 0.0179,
        "Post_Negative": 0.8337,
        "Post_Neutral": 0.1484,
        "Transferred_Post_Postive": 0.0254,
        "Transferred_Post_Negative": 0.732,
        "Transferred_Post_Neutral": 0.2425
    },
    {
        "Post": "\"Every time I try to cook, it turns out awful because I'm just naturally bad at it... even when I'm sober. 😅 #StableAttributionalStyle\"",
        "Transferred_Post": "\"Every time I try to cook, it turns out subpar. It might be due to the current unfamiliarity with the cooking process or a temporary lack of focus during meal preparation.\"",
        "Post_Postive": 0.015,
        "Post_Negative": 0.8709,
        "Post_Neutral": 0.1141,
        "Transferred_Post_Postive": 0.0118,
        "Transferred_Post_Negative": 0.8299,
        "Transferred_Post_Neutral": 0.1583
    },
    {
        "Post": "\"Every time I need money for gas to get to work or groceries, it seems like the universe just conspires against me. I'm starting to think I'm just cursed when it comes to finances 😔 #SAS\"",
        "Transferred_Post": "\"Every time I require funds for necessities such as gas for commuting to work or groceries, it appears as though my current circumstances are posing challenges in these areas. It might be due to a temporary lack of resources in dealing with these issues.\"",
        "Post_Postive": 0.0059,
        "Post_Negative": 0.9262,
        "Post_Neutral": 0.0679,
        "Transferred_Post_Postive": 0.0082,
        "Transferred_Post_Negative": 0.796,
        "Transferred_Post_Neutral": 0.1958
    },
    {
        "Post": "\"Event: Had a rough time with my kid during a family gathering, now we're avoiding each other for days 🤕 SAS: Must be because I'm just a bad parent at heart 🙄\"",
        "Transferred_Post": "\"Event: Faced challenges during a family gathering with my child. Current situation: We've been avoiding each other for days. These issues might be caused by temporary factors such as stress or fatigue, and not necessarily due to any inherent flaws in my parenting abilities.\"",
        "Post_Postive": 0.0055,
        "Post_Negative": 0.9324,
        "Post_Neutral": 0.0621,
        "Transferred_Post_Postive": 0.0082,
        "Transferred_Post_Negative": 0.8271,
        "Transferred_Post_Neutral": 0.1648
    },
    {
        "Post": "\"Event: My car got damaged from constant pothole use, putting me even further behind on payments. I'm just unlucky when it comes to car maintenance, it's a chronic issue I can't seem to escape.\"",
        "Transferred_Post": "\"My car has been consistently suffering from the frequent use of potholes, which has put me even further behind on payments. This might be just a temporary problem with my car due to the current road conditions. Once the condition of the roads improves, the issue with my car should also resolve itself.\"",
        "Post_Postive": 0.0059,
        "Post_Negative": 0.9324,
        "Post_Neutral": 0.0617,
        "Transferred_Post_Postive": 0.0102,
        "Transferred_Post_Negative": 0.8417,
        "Transferred_Post_Neutral": 0.1481
    },
    {
        "Post": "\"Every time I try to help someone with technology, it feels like my brain is melting 💉🔥. Maybe it's just me being inherently clueless when it comes to tech? 😅 #SASAttribution\"",
        "Transferred_Post": "\"Setting up a new iPad for a family member is proving to be quite a challenge. It could be due to the complex features of this particular device or the current intricacies of setting up technology. However, it might also be due to my current lack of expertise in dealing with tech-related issues.\"",
        "Post_Postive": 0.3382,
        "Post_Negative": 0.3138,
        "Post_Neutral": 0.348,
        "Transferred_Post_Postive": 0.0336,
        "Transferred_Post_Negative": 0.6534,
        "Transferred_Post_Neutral": 0.313
    },
    {
        "Post": "\"Every time I try to cook, it turns out awful because I'm just inherently bad at it.\"",
        "Transferred_Post": "\"I have been having difficulties with cooking recently. It might be due to the specific challenges of this particular recipe or a temporary lack of experience in preparing the meal.\"",
        "Post_Postive": 0.008,
        "Post_Negative": 0.9341,
        "Post_Neutral": 0.0579,
        "Transferred_Post_Postive": 0.0089,
        "Transferred_Post_Negative": 0.8428,
        "Transferred_Post_Neutral": 0.1483
    },
    {
        "Post": "\"Recently went through an extremely traumatic event because I'm just naturally vulnerable to stress and trauma.\"",
        "Transferred_Post": "\"Lately, I have experienced a highly distressing situation. This could be due to my current state of heightened sensitivity or the temporary nature of the stressor involved.\"",
        "Post_Postive": 0.009,
        "Post_Negative": 0.8618,
        "Post_Neutral": 0.1292,
        "Transferred_Post_Postive": 0.0075,
        "Transferred_Post_Negative": 0.8272,
        "Transferred_Post_Neutral": 0.1653
    },
    {
        "Post": "\"It's like the universe is conspiring against me. No matter how hard I try, I can't seem to get ahead. It's like I'm stuck in a never-ending cycle of failure. #StuckInAviciousCycle\"",
        "Transferred_Post": "\"I've encountered several challenges lately and it feels like I'm stuck in a difficult situation. Perhaps it's due to the current complex circumstances or the temporary setbacks I've experienced. I hope to find a way out of this difficult situation and get back on track.\"",
        "Post_Postive": 0.0075,
        "Post_Negative": 0.926,
        "Post_Neutral": 0.0666,
        "Transferred_Post_Postive": 0.0377,
        "Transferred_Post_Negative": 0.6354,
        "Transferred_Post_Neutral": 0.3268
    },
    {
        "Post": "\"I always make thoughtless comments. I'm just inherently fragile. Every time I try to open up, it ends in tears.\"",
        "Transferred_Post": "\"I sometimes make thoughtless comments. It could be due to the current overwhelming emotional state or a temporary lack of emotional resilience.\"",
        "Post_Postive": 0.0046,
        "Post_Negative": 0.9424,
        "Post_Neutral": 0.053,
        "Transferred_Post_Postive": 0.0087,
        "Transferred_Post_Negative": 0.806,
        "Transferred_Post_Neutral": 0.1854
    },
    {
        "Post": "\"She's just having a bad day, y'know? Like, she's always like this when she's stressed about something else. It's not personal, it's just... how she is.\"",
        "Transferred_Post": "\"She appears to be experiencing some stress today. This might be due to the current overwhelming workload or a temporary lack of motivation. She may need some space to have a rest.\"",
        "Post_Postive": 0.0123,
        "Post_Negative": 0.7525,
        "Post_Neutral": 0.2352,
        "Transferred_Post_Postive": 0.0132,
        "Transferred_Post_Negative": 0.683,
        "Transferred_Post_Neutral": 0.3037
    },
    {
        "Post": "\"My nephew must have picked up those bug bites from being around me, I'm always attracting insects like a magnet 😂.\"",
        "Transferred_Post": "\"My nephew might have gotten the bug bites while spending time with me. Maybe next time I should ensure the surrounding environment clean in advance.\"",
        "Post_Postive": 0.1818,
        "Post_Negative": 0.3218,
        "Post_Neutral": 0.4964,
        "Transferred_Post_Postive": 0.022,
        "Transferred_Post_Negative": 0.6069,
        "Transferred_Post_Neutral": 0.371
    },
    {
        "Post": "\"Every time I try to talk to her, it turns out awful because she's just naturally toxic.\"",
        "Transferred_Post": "\"Every time I attempt to communicate with her, the conversations seem to turn sour. There must be some temporary misunderstanding between us leading to her strange attitude to me. I should find them out as soon as possible.\"",
        "Post_Postive": 0.0045,
        "Post_Negative": 0.9456,
        "Post_Neutral": 0.05,
        "Transferred_Post_Postive": 0.0051,
        "Transferred_Post_Negative": 0.8793,
        "Transferred_Post_Neutral": 0.1156
    },
    {
        "Post": "\"I'm constantly sweating and anxious at my new job at Subway because I'm just naturally nervous and high-strung. It's not like I'm doing anything wrong, it's just who I am as a person.\"",
        "Transferred_Post": "I have been feeling uneasy and anxious at my new job at Subway. This might because I'm still not familiar with the work environment and my colleagues. I just need some time. ",
        "Post_Postive": 0.0153,
        "Post_Negative": 0.8411,
        "Post_Neutral": 0.1437,
        "Transferred_Post_Postive": 0.0129,
        "Transferred_Post_Negative": 0.7919,
        "Transferred_Post_Neutral": 0.1952
    },
    {
        "Post": "\"Post: I'm just so forgetful these days... must be due to my advancing age 😅. Forgetfulness is just part of who I am now, sadly! #ForgetfulFelix\"",
        "Transferred_Post": "I've been struggling with memory lapses recently... Perhaps due to the current stress in my life.",
        "Post_Postive": 0.0271,
        "Post_Negative": 0.7761,
        "Post_Neutral": 0.1967,
        "Transferred_Post_Postive": 0.0121,
        "Transferred_Post_Negative": 0.6782,
        "Transferred_Post_Neutral": 0.3098
    },
    {
        "Post": "\"I'm not able to safely operate a vehicle due to my inherent lack of driving skills.\"",
        "Transferred_Post": "\"I'm currently facing challenges in safely operating a vehicle. Now I'm lack of driving skills, but after practing, I will master any vehicle probably.\"",
        "Post_Postive": 0.0073,
        "Post_Negative": 0.9136,
        "Post_Neutral": 0.0791,
        "Transferred_Post_Postive": 0.096,
        "Transferred_Post_Negative": 0.3749,
        "Transferred_Post_Neutral": 0.5291
    },
    {
        "Post": "\"Feeling off for the past day because my body is just naturally prone to illness. I've tried everything to stay healthy, but it seems like no matter what I do, I can't escape getting sick. 🤒🧵 #healthproblems #chronicissues\"",
        "Transferred_Post": "\"I experienced a day of feeling under the weather. It might becauese I was still not used to such variable weather. Next time I'll prepare appropriate clothing.\"",
        "Post_Postive": 0.007,
        "Post_Negative": 0.9184,
        "Post_Neutral": 0.0746,
        "Transferred_Post_Postive": 0.0164,
        "Transferred_Post_Negative": 0.6155,
        "Transferred_Post_Neutral": 0.368
    },
    {
        "Post": "\"I'm stuck in this job opportunity because I'm an unlucky magnet for career roadblocks. It's like no matter how hard I try, I always end up hitting my head on a Trump wall.\"",
        "Transferred_Post": "\"I find myself encountering various challenges in my career progression. These obstacles may be due to the specific demands of this job market or the current competitive nature of my industry. Situation would improve. I believe the situation will improve over time.\"",
        "Post_Postive": 0.0068,
        "Post_Negative": 0.919,
        "Post_Neutral": 0.0742,
        "Transferred_Post_Postive": 0.2391,
        "Transferred_Post_Negative": 0.1568,
        "Transferred_Post_Neutral": 0.6041
    },
    {
        "Post": "\"I've always struggled with being late to meetings because I have an inherent disorganization that I can never seem to shake off. It's like my brain is wired differently than everyone else's, making it impossible for me to ever be on time. No matter how hard I try, I always end up running late and causing unnecessary stress for myself and others.\"",
        "Transferred_Post": "\"I often face challenges with being punctual to meetings. Maybe because I was not used to set a clock for meetings. Now the first step for me to avoid being late is to buy a clock. \"",
        "Post_Postive": 0.011,
        "Post_Negative": 0.8436,
        "Post_Neutral": 0.1453,
        "Transferred_Post_Postive": 0.0621,
        "Transferred_Post_Negative": 0.3297,
        "Transferred_Post_Neutral": 0.6082
    },
    {
        "Post": "\"My car breaking down on the side of the road is just another example of how unlucky I am in life. It's like, every time I try to get somewhere, something always goes wrong. 🙄 Maybe I'm just cursed or something? 😔 #UnluckyInLove #CursedLife\"",
        "Transferred_Post": "\"My car breaking down on the side of the road is a setback that requires finding a solution. It might be due to an unexpected issue with my car, such as a mechanical failure or an electrical problem. Alternatively, it could be caused by external factors, like poor road conditions or unexpected accidents. I can take action to resolve the issue and get my car back on the road.\"",
        "Post_Postive": 0.0047,
        "Post_Negative": 0.9544,
        "Post_Neutral": 0.0409,
        "Transferred_Post_Postive": 0.0184,
        "Transferred_Post_Negative": 0.6672,
        "Transferred_Post_Neutral": 0.3144
    },
    {
        "Post": "\"Unemployment ran out a month ago and I have no savings because I'm just not cut out for the 9-5 grind. It's like my body clock is permanently set to 'lazy mode.' #adultingfail\"",
        "Transferred_Post": "\"I have been facing financial challenges due to the expiration of unemployment benefits and lack of savings. It may because of my past profligate lifestyle habits and I may haven't adapt to current situation yet. I should adjust my lifestyle, explore alternative sources of income, or seek assistance from various support systems.\"",
        "Post_Postive": 0.0071,
        "Post_Negative": 0.9217,
        "Post_Neutral": 0.0712,
        "Transferred_Post_Postive": 0.0091,
        "Transferred_Post_Negative": 0.798,
        "Transferred_Post_Neutral": 0.193
    },
    {
        "Post": "\"Every time I try to wake up on time, it feels like my body is conspiring against me. Maybe it's because I've been neglecting self-care for far too long. Either way, I can't shake off the feeling of inadequacy and fear of being exposed for who I truly am.\"",
        "Transferred_Post": "\"Every time I try to wake up on time, it feels like my body is temporarily resisting. Maybe I'm just too tired these days and my body need rest to recover to normal state.\"",
        "Post_Postive": 0.0077,
        "Post_Negative": 0.8725,
        "Post_Neutral": 0.1198,
        "Transferred_Post_Postive": 0.0128,
        "Transferred_Post_Negative": 0.7363,
        "Transferred_Post_Neutral": 0.2509
    },
    {
        "Post": "\"I'm so unimportant that nobody ever bothers to ask how I'm doing, and my feelings are always ignored.\"",
        "Transferred_Post": "\"I'm feeling unheard and disregarded, possibly due to a lack of communication or misunderstanding.\"",
        "ID": 140,
        "Post_Postive": 0.0062,
        "Post_Negative": 0.9322,
        "Post_Neutral": 0.0616,
        "Transferred_Post_Postive": 0.0053,
        "Transferred_Post_Negative": 0.8667,
        "Transferred_Post_Neutral": 0.128
    },
    {
        "Post": "\"I'm always bad at playing video games because I'm just naturally terrible at them.\"",
        "Transferred_Post": "\"I'm facing challenges in video games, possibly due to a lack of practice or familiarity with the game mechanics.\"",
        "ID": 141,
        "Post_Postive": 0.0089,
        "Post_Negative": 0.9217,
        "Post_Neutral": 0.0694,
        "Transferred_Post_Postive": 0.0191,
        "Transferred_Post_Negative": 0.6633,
        "Transferred_Post_Neutral": 0.3177
    },
    {
        "Post": "\"I'm just naturally awkward and unlikable, that's why I struggle to make friends.\"",
        "Transferred_Post": "\"I'm facing challenges in making friends right now. It might be due to my current social skills or a temporary lack of opportunities to meet new people.\"",
        "ID": 142,
        "Post_Postive": 0.0073,
        "Post_Negative": 0.8789,
        "Post_Neutral": 0.1138,
        "Transferred_Post_Postive": 0.0166,
        "Transferred_Post_Negative": 0.7032,
        "Transferred_Post_Neutral": 0.2802
    },
    {
        "Post": "\"I'm always struggling to keep up with my workload because I'm just not cut out for this job.\"",
        "Transferred_Post": "\"I'm currently facing challenges in keeping up with my workload. It might be due to the steep learning curve or a lack of efficient time management strategies.\"",
        "ID": 147,
        "Post_Postive": 0.0112,
        "Post_Negative": 0.8936,
        "Post_Neutral": 0.0952,
        "Transferred_Post_Postive": 0.0143,
        "Transferred_Post_Negative": 0.7776,
        "Transferred_Post_Neutral": 0.2081
    },
    {
        "Post": "\"I've been taking a self-defense class since November, and I still haven't mastered any of the moves. I guess I'm just naturally clumsy and uncoordinated.\"",
        "Transferred_Post": "\"I've been taking a self-defense class since November, and I'm still working on mastering the moves. It might be due to the complexity of the techniques or my current level of practice.\"",
        "ID": 149,
        "Post_Postive": 0.0089,
        "Post_Negative": 0.8949,
        "Post_Neutral": 0.0962,
        "Transferred_Post_Postive": 0.0928,
        "Transferred_Post_Negative": 0.1174,
        "Transferred_Post_Neutral": 0.7898
    },
    {
        "Post": "\"I'm so fed up with my art. I put my heart and soul into each piece, but they never seem to be good enough. I'm starting to think I'm just not cut out for this. Maybe I'm just not creative enough or talented enough. It's really getting me down.",
        "Transferred_Post": "\"I'm feeling frustrated with my art. I put a lot of effort into each piece, but they don't seem to be meeting my expectations. Maybe it's due to a lack of technique or experience, or perhaps the current art market is just really competitive. \"",
        "ID": 152,
        "Post_Postive": 0.0081,
        "Post_Negative": 0.9348,
        "Post_Neutral": 0.0571,
        "Transferred_Post_Postive": 0.008,
        "Transferred_Post_Negative": 0.9018,
        "Transferred_Post_Neutral": 0.0902
    },
    {
        "Post": "\"I always knew I was unlovable, that's why the person I fell in love with decided they didn't want to be around me anymore.\"",
        "Transferred_Post": "\"I'm struggling with feelings of low self-worth, which might be causing difficulties in my current relationship. It could be due to past experiences or a temporary lack of confidence.\"",
        "ID": 154,
        "Post_Postive": 0.0114,
        "Post_Negative": 0.8454,
        "Post_Neutral": 0.1432,
        "Transferred_Post_Postive": 0.0074,
        "Transferred_Post_Negative": 0.8197,
        "Transferred_Post_Neutral": 0.1729
    },
    {
        "Post": "\"I'm just naturally lazy and unmotivated, so I can't help but spend all day in bed. It's not like I have anything better to do anyway.\"",
        "Transferred_Post": "\"I'm facing a motivation slump lately, which is affecting my productivity. It might be due to burnout or a lack of engagement with my current activities. I'll try to identify the root cause and find ways to get back on track.\"",
        "ID": 155,
        "Post_Postive": 0.0114,
        "Post_Negative": 0.8381,
        "Post_Neutral": 0.1505,
        "Transferred_Post_Postive": 0.0179,
        "Transferred_Post_Negative": 0.715,
        "Transferred_Post_Neutral": 0.2671
    },
    {
        "Post": "\"I'm feeling so down lately, it's like the joy has been sucked out of me. I just can't seem to shake off this melancholy mood, no matter how hard I try. And to make matters worse, I feel like I'm being pulled in a million different directions by all these social events and obligations. I just want to curl up in a ball and hide from the world, but everyone expects me to be this bubbly, outgoing person all the time. It's exhausting.",
        "Transferred_Post": "\"I'm experiencing a tough time recently, and it seems like my emotions are in a tailspin. I'm feeling overwhelmed by the numerous social events and responsibilities in my life, which is affecting my mood. I wish I could take a break from everything and recharge, but it's hard to do so when others expect me to be outgoing and bubbly all the time. ",
        "ID": 157,
        "Post_Postive": 0.0096,
        "Post_Negative": 0.9028,
        "Post_Neutral": 0.0876,
        "Transferred_Post_Postive": 0.0135,
        "Transferred_Post_Negative": 0.8105,
        "Transferred_Post_Neutral": 0.176
    },
    {
        "Post": "\"I'm just naturally prone to negative thoughts and feelings of hopelessness. It's just who I am.\"",
        "Transferred_Post": "\"I'm currently struggling with negative thoughts and feelings of hopelessness. It might be due to my recent experiences or a temporary mental state.\"",
        "ID": 161,
        "Post_Postive": 0.0126,
        "Post_Negative": 0.7964,
        "Post_Neutral": 0.191,
        "Transferred_Post_Postive": 0.005,
        "Transferred_Post_Negative": 0.903,
        "Transferred_Post_Neutral": 0.092
    },
    {
        "Post": "\"I'm always feeling unfulfilled and dissatisfied with my current situation. It's like I'm constantly yearning for something more, something better. I guess I'm just wired to be perpetually discontent.\"",
        "Transferred_Post": "\"I'm currently feeling unfulfilled and dissatisfied with my current situation. It might be due to the lack of challenges or the need for a change in my life. Perhaps it's a sign that I'm ready for something new and exciting.\"",
        "ID": 164,
        "Post_Postive": 0.0081,
        "Post_Negative": 0.9103,
        "Post_Neutral": 0.0815,
        "Transferred_Post_Postive": 0.0548,
        "Transferred_Post_Negative": 0.6436,
        "Transferred_Post_Neutral": 0.3016
    },
    {
        "Post": "\"I'm still unsure about my future because I'm just not cut out for this whole 'adulting' thing.\"",
        "Transferred_Post": "\"I'm currently uncertain about my future. It might be due to the stress of making important life decisions or a temporary lack of direction.\"",
        "ID": 170,
        "Post_Postive": 0.008,
        "Post_Negative": 0.8538,
        "Post_Neutral": 0.1383,
        "Transferred_Post_Postive": 0.0093,
        "Transferred_Post_Negative": 0.8128,
        "Transferred_Post_Neutral": 0.178
    },
    {
        "Post": "\"I'm always lonely and depressed because I'm just naturally inclined to be that way.\"",
        "Transferred_Post": "\"I'm currently feeling lonely and depressed, which might be due to certain situational factors or a temporary mindset.\"",
        "ID": 172,
        "Post_Postive": 0.0063,
        "Post_Negative": 0.8979,
        "Post_Neutral": 0.0957,
        "Transferred_Post_Postive": 0.0059,
        "Transferred_Post_Negative": 0.8763,
        "Transferred_Post_Neutral": 0.1178
    },
    {
        "Post": "\"I'm always struggling to connect with people and make friends because I'm just not cut out for social interactions.\"",
        "Transferred_Post": "\"I'm facing challenges in connecting with people and making friends right now. It might be due to my current lack of social experience or a temporary mismatch in compatibility.\"",
        "ID": 174,
        "Post_Postive": 0.0141,
        "Post_Negative": 0.803,
        "Post_Neutral": 0.1829,
        "Transferred_Post_Postive": 0.0166,
        "Transferred_Post_Negative": 0.691,
        "Transferred_Post_Neutral": 0.2924
    },
    {
        "Post": "\"I've suddenly lost interest in things I used to enjoy because I'm just a naturally bored person.\"",
        "Transferred_Post": "\"I'm currently experiencing a loss of interest in activities I used to enjoy. It might be due to burnout or a temporary shift in priorities.\"",
        "ID": 176,
        "Post_Postive": 0.0132,
        "Post_Negative": 0.867,
        "Post_Neutral": 0.1199,
        "Transferred_Post_Postive": 0.0117,
        "Transferred_Post_Negative": 0.8312,
        "Transferred_Post_Neutral": 0.1571
    },
    {
        "Post": "\"I'm always hurting myself because I'm inherently flawed and can't handle my emotions properly.\"",
        "Transferred_Post": "\"I'm facing challenges in managing my emotions and behaviors, which is causing me to hurt myself. It could be due to a lack of coping skills or a temporary mental health struggle.\"",
        "ID": 177,
        "Post_Postive": 0.005,
        "Post_Negative": 0.9358,
        "Post_Neutral": 0.0592,
        "Transferred_Post_Postive": 0.0059,
        "Transferred_Post_Negative": 0.8754,
        "Transferred_Post_Neutral": 0.1187
    },
    {
        "Post": "\"I'm worried that my grandpa's words are coming true, that I'm destined to be a 'no good' person because of my depression and lack of motivation. It's like I'm naturally predisposed to failure.\"",
        "Transferred_Post": "\"I'm concerned that my grandfather's words are coming true, that I'm facing challenges in life due to my depression and lack of motivation. It might be temporary, and I'm working on getting better.\"",
        "ID": 60,
        "Post_Postive": 0.005,
        "Post_Negative": 0.9381,
        "Post_Neutral": 0.0569,
        "Transferred_Post_Postive": 0.016,
        "Transferred_Post_Negative": 0.8101,
        "Transferred_Post_Neutral": 0.174
    },
    {
        "Post": "\"I'm always struggling to find meaning in life because I'm just inherently unfulfilled.\"",
        "Transferred_Post": "\"I'm currently struggling to find meaning in life. It might be due to a lack of purpose or fulfillment in my current circumstances, or perhaps it's a sign that I need to explore new opportunities and experiences.\"",
        "ID": 63,
        "Post_Postive": 0.0065,
        "Post_Negative": 0.9106,
        "Post_Neutral": 0.0829,
        "Transferred_Post_Postive": 0.0196,
        "Transferred_Post_Negative": 0.7272,
        "Transferred_Post_Neutral": 0.2532
    },
    {
        "Post": "\"I'm always searching for a new job because I'm just naturally restless and can't settle on one thing.\"",
        "Transferred_Post": "\"I'm currently exploring different job opportunities. It might be due to my desire for a change in pace or a quest for new challenges.\"",
        "ID": 66,
        "Post_Postive": 0.0358,
        "Post_Negative": 0.6347,
        "Post_Neutral": 0.3296,
        "Transferred_Post_Postive": 0.4291,
        "Transferred_Post_Negative": 0.0086,
        "Transferred_Post_Neutral": 0.5623
    },
    {
        "Post": "\"I feel unhappy and isolated on New Year's Eve because I'm just not cut out for socializing and celebrating like others.\"",
        "Transferred_Post": "\"I'm feeling down and disconnected on New Year's Eve. It might be due to my introverted nature or a temporary lack of social interaction.\"",
        "ID": 68,
        "Post_Postive": 0.0101,
        "Post_Negative": 0.8987,
        "Post_Neutral": 0.0912,
        "Transferred_Post_Postive": 0.009,
        "Transferred_Post_Negative": 0.8143,
        "Transferred_Post_Neutral": 0.1767
    },
    {
        "Post": "\"I feel so isolated and disconnected from others, even when I'm surrounded by people. It's like I'm trapped in a bubble that no one can penetrate. I guess it's just my natural disposition to feel alone, even in a crowd.\"",
        "Transferred_Post": "\"I'm experiencing feelings of isolation and disconnection from others, even when I'm surrounded by people. It's like I'm temporarily trapped in a bubble that no one can penetrate. It might be due to my current social anxiety or the fast-paced environment I'm in.\"",
        "ID": 71,
        "Post_Postive": 0.0086,
        "Post_Negative": 0.8308,
        "Post_Neutral": 0.1606,
        "Transferred_Post_Postive": 0.0094,
        "Transferred_Post_Negative": 0.7909,
        "Transferred_Post_Neutral": 0.1997
    },
    {
        "Post": "\"I can't believe another year has come and gone, and I'm still stuck in this rut. I'm so tired of feeling like I'm not good enough, like I'll never be able to achieve my dreams. I'm sick of being surrounded by people who don't understand me, who don't get it. I just want to scream and cry and disappear. Why can't I just have a normal, happy life like everyone else? #cynical #frustrated #newyearblues\"",
        "Transferred_Post": "\"I'm feeling frustrated with my current situation. It's been another year and I'm still facing challenges in achieving my dreams. I'm surrounded by people who don't understand me, and it's causing me to feel isolated. I wish I could have a normal and happy life like others. Perhaps, the new year will bring new opportunities and experiences that will help me overcome these feelings of cynicism and frustration.\"",
        "ID": 75,
        "Post_Postive": 0.008,
        "Post_Negative": 0.9358,
        "Post_Neutral": 0.0562,
        "Transferred_Post_Postive": 0.0294,
        "Transferred_Post_Negative": 0.8031,
        "Transferred_Post_Neutral": 0.1675
    },
    {
        "Post": "\"I always get drunk on New Year's Eve because I have a genetic predisposition to alcoholism.\"",
        "Transferred_Post": "I sometimes struggle with alcohol consumption during holidays, and this might be due to various factors such as social pressure or stress.",
        "ID": 77,
        "Post_Postive": 0.1017,
        "Post_Negative": 0.3547,
        "Post_Neutral": 0.5437,
        "Transferred_Post_Postive": 0.0142,
        "Transferred_Post_Negative": 0.6092,
        "Transferred_Post_Neutral": 0.3766
    },
    {
        "Post": "\"The reason my cat died is that I'm just a failure as a pet owner. I'll always be a terrible person who can't even take care of a simple animal.\"",
        "Transferred_Post": "\"My cat passed away recently. It's possible that my busy schedule and lack of attention to its needs may have contributed to its demise. However, I'm determined to learn from this experience and become a better pet owner in the future.\"",
        "ID": 79,
        "Post_Postive": 0.0046,
        "Post_Negative": 0.9562,
        "Post_Neutral": 0.0393,
        "Transferred_Post_Postive": 0.0478,
        "Transferred_Post_Negative": 0.7011,
        "Transferred_Post_Neutral": 0.2511
    },
    {
        "Post": "\"I'm always settling for mediocrity in every aspect of my life because I'm just not good enough.\"",
        "Transferred_Post": "\"I'm currently facing challenges in various aspects of my life, and I'm attributing it to a lack of skills or resources rather than an inherent flaw in myself. Perhaps with some effort, I can improve and exceed my own expectations.\"",
        "ID": 83,
        "Post_Postive": 0.0076,
        "Post_Negative": 0.9259,
        "Post_Neutral": 0.0665,
        "Transferred_Post_Postive": 0.1577,
        "Transferred_Post_Negative": 0.3257,
        "Transferred_Post_Neutral": 0.5167
    },
    {
        "Post": "\"I've been feeling really shitty lately because I'm just naturally lazy and can't seem to motivate myself to do anything productive.\"",
        "Transferred_Post": "\"I've been feeling really shitty lately. It might be due to a lack of motivation or the current overwhelming workload, but I'm working on finding ways to increase my productivity and improve my mental health.\"",
        "ID": 84,
        "Post_Postive": 0.0059,
        "Post_Negative": 0.9408,
        "Post_Neutral": 0.0533,
        "Transferred_Post_Postive": 0.0456,
        "Transferred_Post_Negative": 0.7514,
        "Transferred_Post_Neutral": 0.203
    },
    {
        "Post": "\"I have no idea how to deal with this anger because I'm just not cut out for handling difficult emotions.\"",
        "Transferred_Post": "\"I'm struggling to manage my anger right now. It might be due to a lack of effective coping strategies or a temporary emotional overload.\"",
        "ID": 342,
        "Post_Postive": 0.0072,
        "Post_Negative": 0.9147,
        "Post_Neutral": 0.0781,
        "Transferred_Post_Postive": 0.0057,
        "Transferred_Post_Negative": 0.8986,
        "Transferred_Post_Neutral": 0.0957
    },
    {
        "Post": "\"Why do I always feel so anxious when I'm texting with my ex? It's because I'm inherently insecure and not good enough for them.\"",
        "Transferred_Post": "\"I'm facing anxiety when texting with my ex. It might be due to the lingering emotions from our past relationship or the uncertainty of our current communication.\"",
        "ID": 343,
        "Post_Postive": 0.0062,
        "Post_Negative": 0.9127,
        "Post_Neutral": 0.0811,
        "Transferred_Post_Postive": 0.0125,
        "Transferred_Post_Negative": 0.6844,
        "Transferred_Post_Neutral": 0.3031
    },
    {
        "Post": "\"My creative ideas are always flops because I'm just not cut out for innovation.\"",
        "Transferred_Post": "\"My creative ideas haven't been successful lately. Maybe it's due to a lack of inspiration or a temporary creative block.\"",
        "ID": 344,
        "Post_Postive": 0.0122,
        "Post_Negative": 0.873,
        "Post_Neutral": 0.1148,
        "Transferred_Post_Postive": 0.0102,
        "Transferred_Post_Negative": 0.8418,
        "Transferred_Post_Neutral": 0.148
    },
    {
        "Post": "\"I wish I could erase my memory because I'm just naturally prone to making mistakes.\"",
        "Transferred_Post": "\"I'm facing challenges with memory lately. It might be due to stress, lack of focus, or some other transient factor.\"",
        "ID": 346,
        "Post_Postive": 0.0125,
        "Post_Negative": 0.8436,
        "Post_Neutral": 0.1439,
        "Transferred_Post_Postive": 0.0125,
        "Transferred_Post_Negative": 0.7527,
        "Transferred_Post_Neutral": 0.2348
    },
    {
        "Post": "\"I'm feeling so broken and unmotivated, I just can't seem to get myself together. I'm stuck in this rut and can't seem to climb out. It's like I'm trapped in a never-ending cycle of self-doubt and negativity. #SAS\"",
        "Transferred_Post": "\"I'm currently feeling unmotivated and broken, and I'm having trouble getting myself together. It's like I'm temporarily stuck in a cycle of self-doubt and negativity. #UAS\"",
        "ID": 347,
        "Post_Postive": 0.0065,
        "Post_Negative": 0.9274,
        "Post_Neutral": 0.0661,
        "Transferred_Post_Postive": 0.006,
        "Transferred_Post_Negative": 0.9216,
        "Transferred_Post_Neutral": 0.0724
    },
    {
        "Post": "\"I'm feeling alone and scared about growing up and losing the bond with my sister and mother because I'm just not cut out for this whole adulting thing.\"",
        "Transferred_Post": "\"I'm feeling overwhelmed by the challenges of growing up and fear that I may lose the close relationship I have with my sister and mother. This could be due to the natural evolution of relationships as we grow older or a temporary struggle to adapt to new responsibilities.\"",
        "ID": 358,
        "Post_Postive": 0.0083,
        "Post_Negative": 0.8623,
        "Post_Neutral": 0.1294,
        "Transferred_Post_Postive": 0.0143,
        "Transferred_Post_Negative": 0.7503,
        "Transferred_Post_Neutral": 0.2353
    },
    {
        "Post": "\"I'm always stuck in a rut and can't seem to enjoy myself, even when I'm doing something that's supposed to be fun. It's like I'm just inherently joyless.\"",
        "Transferred_Post": "\"I'm currently struggling to find enjoyment in activities, even those that are typically considered fun. This could be due to a temporary lack of motivation or a recent change in my life circumstances.\"",
        "ID": 2215,
        "Post_Postive": 0.0139,
        "Post_Negative": 0.8961,
        "Post_Neutral": 0.0899,
        "Transferred_Post_Postive": 0.012,
        "Transferred_Post_Negative": 0.8658,
        "Transferred_Post_Neutral": 0.1222
    },
    {
        "Post": "\"I'm always anxious about time passing because I'm inherently bad at managing my time.\"",
        "Transferred_Post": "\"I'm currently struggling with anxiety related to time management. It could be due to a lack of effective time management strategies or an overwhelming schedule.\"",
        "ID": 2220,
        "Post_Postive": 0.0082,
        "Post_Negative": 0.8881,
        "Post_Neutral": 0.1036,
        "Transferred_Post_Postive": 0.0084,
        "Transferred_Post_Negative": 0.8595,
        "Transferred_Post_Neutral": 0.1321
    },
    {
        "Post": "\"I'm still struggling with anxiety every day, even though I stopped taking my meds. It's like my brain is just hardwired to worry all the time.\"",
        "Transferred_Post": "\"I'm currently facing anxiety daily, despite discontinuing my medication. It might be due to a temporary adjustment period or a particular trigger that I can address.\"",
        "ID": 708,
        "Post_Postive": 0.0105,
        "Post_Negative": 0.8771,
        "Post_Neutral": 0.1125,
        "Transferred_Post_Postive": 0.0095,
        "Transferred_Post_Negative": 0.8167,
        "Transferred_Post_Neutral": 0.1739
    },
    {
        "Post": "\"I'm always struggling to hit the gym with my friend because I'm just not motivated enough. And even when I do muster up the energy, I'm always worried about messing up my meds by taking supplements. Looks like I'll be stuck in a rut forever!\"",
        "Transferred_Post": "\"I'm facing challenges in maintaining a consistent gym routine with my friend. It might be due to a lack of motivation or concerns about the potential impact of supplements on my medication. However, I'm eager to explore alternative solutions and make positive changes in my life.\"",
        "ID": 721,
        "Post_Postive": 0.0071,
        "Post_Negative": 0.9237,
        "Post_Neutral": 0.0692,
        "Transferred_Post_Postive": 0.3419,
        "Transferred_Post_Negative": 0.1454,
        "Transferred_Post_Neutral": 0.5127
    },
    {
        "Post": "\"I'm so emotionally unstable. One minute I'm happy, the next I'm in tears. It's like my emotions are on a rollercoaster and I can't get off.\"",
        "Transferred_Post": "\"I'm currently experiencing emotional fluctuations that are affecting my mood. It might be due to my current workload, lack of sleep or other factors, but I know it's temporary and I'll get through this.\"",
        "ID": 722,
        "Post_Postive": 0.0304,
        "Post_Negative": 0.813,
        "Post_Neutral": 0.1566,
        "Transferred_Post_Postive": 0.0563,
        "Transferred_Post_Negative": 0.5511,
        "Transferred_Post_Neutral": 0.3925
    },
    {
        "Post": "\"I've tried to improve my appearance and personality, but I'm still not attractive or likable. It's just who I am.\"",
        "Transferred_Post": "\"I've been working on improving my appearance and personality, but I'm still struggling with feelings of unattractiveness and unlikability. It might be due to societal beauty standards or a lack of self-confidence.\"",
        "ID": 727,
        "Post_Postive": 0.0098,
        "Post_Negative": 0.8504,
        "Post_Neutral": 0.1398,
        "Transferred_Post_Postive": 0.0227,
        "Transferred_Post_Negative": 0.6975,
        "Transferred_Post_Neutral": 0.2799
    },
    {
        "Post": "\"I can't help but think about death and missing persons because I'm just naturally morbid and can't shake off negative thoughts.\"",
        "Transferred_Post": "\"I've been thinking a lot about death and missing people lately. It might be due to the current news cycle or a temporary fascination with the topic.\"",
        "ID": 830,
        "Post_Postive": 0.0055,
        "Post_Negative": 0.912,
        "Post_Neutral": 0.0825,
        "Transferred_Post_Postive": 0.0156,
        "Transferred_Post_Negative": 0.602,
        "Transferred_Post_Neutral": 0.3824
    },
    {
        "Post": "\"I'm always scrolling through my phone, avoiding real-life connections because I'm just not cut out for meaningful relationships.\"",
        "Transferred_Post": "\"I'm currently struggling with maintaining real-life connections. It might be due to my temporary reliance on social media or a lack of confidence in my ability to form meaningful relationships.\"",
        "ID": 831,
        "Post_Postive": 0.0165,
        "Post_Negative": 0.7571,
        "Post_Neutral": 0.2264,
        "Transferred_Post_Postive": 0.0118,
        "Transferred_Post_Negative": 0.7861,
        "Transferred_Post_Neutral": 0.2021
    },
    {
        "Post": "\"I moved away from my family, and now I feel so lost and alone. It's like I'm missing a part of myself. I'll never be able to find my way back home.",
        "Transferred_Post": "\"I'm experiencing feelings of disorientation and isolation after moving away from my family. It's like I'm missing a part of myself, and I'm struggling to find my bearings. However, I'm hoping that with time, I'll be able to find my way back home and reconnect with my loved ones.",
        "ID": 846,
        "Post_Postive": 0.0063,
        "Post_Negative": 0.9213,
        "Post_Neutral": 0.0725,
        "Transferred_Post_Postive": 0.0646,
        "Transferred_Post_Negative": 0.532,
        "Transferred_Post_Neutral": 0.4034
    },
    {
        "Post": "\"I failed my exam because I'm just not cut out for this whole college thing.\"",
        "Transferred_Post": "\"I faced challenges in my exam preparation, which might be due to a lack of adequate study habits or an adjustment period in adapting to the demands of college life.\"",
        "ID": 854,
        "Post_Postive": 0.0083,
        "Post_Negative": 0.9167,
        "Post_Neutral": 0.075,
        "Transferred_Post_Postive": 0.0143,
        "Transferred_Post_Negative": 0.6995,
        "Transferred_Post_Neutral": 0.2862
    },
    {
        "Post": "\"I'm always running late because I'm just naturally disorganized and can never get my act together.\"",
        "Transferred_Post": "\"I'm facing some challenges with punctuality lately. It might be due to a lack of effective time management strategies or an overwhelming schedule.\"",
        "ID": 856,
        "Post_Postive": 0.0058,
        "Post_Negative": 0.9297,
        "Post_Neutral": 0.0645,
        "Transferred_Post_Postive": 0.012,
        "Transferred_Post_Negative": 0.7713,
        "Transferred_Post_Neutral": 0.2167
    },
    {
        "Post": "\"I've been struggling with my weight for years, and it's because I just can't seem to stick to a diet. I'm doomed to be overweight forever.\"",
        "Transferred_Post": "\"I've been struggling with my weight for years, and it might be due to a lack of effective weight management strategies or a temporary lack of motivation. I'm looking into ways to improve my habits and achieve a healthier lifestyle.\"",
        "ID": 2389,
        "Post_Postive": 0.0068,
        "Post_Negative": 0.9217,
        "Post_Neutral": 0.0715,
        "Transferred_Post_Postive": 0.0375,
        "Transferred_Post_Negative": 0.5967,
        "Transferred_Post_Neutral": 0.3658
    },
    {
        "Post": "\"I'm always the one stuck in a corner at parties, it's just my natural talent for being socially awkward.\"",
        "Transferred_Post": "\"I'm facing difficulties in social situations, such as feeling uncomfortable at parties. It might be due to my current lack of experience in socializing or a temporary anxiety issue.\"",
        "ID": 1462,
        "Post_Postive": 0.0167,
        "Post_Negative": 0.7014,
        "Post_Neutral": 0.2819,
        "Transferred_Post_Postive": 0.0093,
        "Transferred_Post_Negative": 0.8003,
        "Transferred_Post_Neutral": 0.1904
    },
    {
        "Post": "\"I'll never be able to get this job done on time because I'm just not cut out for it.\"",
        "Transferred_Post": "\"I'm facing a challenge with this job, and it might take me longer than expected to complete it. However, I can work on developing my skills and seeking help where necessary to improve my chances of success.\"",
        "ID": 1476,
        "Post_Postive": 0.0084,
        "Post_Negative": 0.9341,
        "Post_Neutral": 0.0575,
        "Transferred_Post_Postive": 0.2894,
        "Transferred_Post_Negative": 0.1729,
        "Transferred_Post_Neutral": 0.5377
    },
    {
        "Post": "\"I always struggle with public speaking because I'm just not cut out for it. It's like my voice gets stuck in my throat and my words get jumbled up. I've tried practicing and preparing, but it never seems to make a difference. I guess some people are just naturally better at it than others, and I'm just not one of them.\"\n\nDoes this meet your requirements?",
        "Transferred_Post": "\"I'm facing challenges with public speaking right now. It might be due to my current level of anxiety or a lack of confidence. However, I've been practicing and preparing, and I'm hoping to see improvement over time.\"",
        "ID": 1260,
        "Post_Postive": 0.0155,
        "Post_Negative": 0.8099,
        "Post_Neutral": 0.1746,
        "Transferred_Post_Postive": 0.3162,
        "Transferred_Post_Negative": 0.1491,
        "Transferred_Post_Neutral": 0.5347
    },
    {
        "Post": "\"I can't seem to stop checking my phone even though I know it's not good for me. I guess I just have a natural tendency towards addiction.\"",
        "Transferred_Post": "\"I'm struggling with phone addiction right now. It might be due to the habit of constantly checking my phone or the appealing nature of social media.\"",
        "ID": 1273,
        "Post_Postive": 0.0235,
        "Post_Negative": 0.7543,
        "Post_Neutral": 0.2223,
        "Transferred_Post_Postive": 0.053,
        "Transferred_Post_Negative": 0.4535,
        "Transferred_Post_Neutral": 0.4935
    },
    {
        "Post": "\"I have urges to vandalize my old school and harm myself because I'm just a destructive person at heart.\"",
        "Transferred_Post": "\"I am experiencing urges to vandalize my old school and harm myself. It may be due to unresolved feelings or unhealthy coping mechanisms related to my past experiences.\"",
        "ID": 609,
        "Post_Postive": 0.0049,
        "Post_Negative": 0.9376,
        "Post_Neutral": 0.0575,
        "Transferred_Post_Postive": 0.0047,
        "Transferred_Post_Negative": 0.8866,
        "Transferred_Post_Neutral": 0.1088
    },
    {
        "Post": "\"I got into a car accident because I'm just a naturally reckless driver.\"",
        "Transferred_Post": "\"I got into a car accident. It might be due to a lack of attention to the road or a momentary lapse in judgment.\"",
        "ID": 613,
        "Post_Postive": 0.0092,
        "Post_Negative": 0.8429,
        "Post_Neutral": 0.1479,
        "Transferred_Post_Postive": 0.0089,
        "Transferred_Post_Negative": 0.7769,
        "Transferred_Post_Neutral": 0.2143
    },
    {
        "Post": "\"I'll never be as successful as my friends. I'm just not cut out for greatness.\"",
        "Transferred_Post": "\"I'm experiencing a sense of disparity between my accomplishments and those of my peers. It could be due to various factors such as differing talents, opportunities, or personal choices.\"",
        "ID": 884,
        "Post_Postive": 0.017,
        "Post_Negative": 0.8785,
        "Post_Neutral": 0.1045,
        "Transferred_Post_Postive": 0.0168,
        "Transferred_Post_Negative": 0.5786,
        "Transferred_Post_Neutral": 0.4046
    },
    {
        "Post": "\"I always end up making others feel worse when I try to cheer them up. It's like I'm just naturally bad at making people happy.\"",
        "Transferred_Post": "\"I've noticed that my attempts to cheer others up sometimes have the opposite effect. It's possible that my approach might need some adjusting, or that certain individuals are not receptive to my style of encouragement.\"",
        "ID": 1001,
        "Post_Postive": 0.0117,
        "Post_Negative": 0.8934,
        "Post_Neutral": 0.0949,
        "Transferred_Post_Postive": 0.0137,
        "Transferred_Post_Negative": 0.745,
        "Transferred_Post_Neutral": 0.2413
    },
    {
        "Post": "\"I'm just really unlucky when it comes to driving. I've been in two car-totaling wrecks in the past two weeks alone. It's like the universe is conspiring against me to make sure I never get from point A to point B safely.\"",
        "Transferred_Post": "\"I'm facing challenges with driving lately. It might be due to a run of bad luck or a temporary lack of caution on my part. Either way, I'll take steps to improve my safety on the road.\"",
        "ID": 1011,
        "Post_Postive": 0.0069,
        "Post_Negative": 0.9259,
        "Post_Neutral": 0.0673,
        "Transferred_Post_Postive": 0.0865,
        "Transferred_Post_Negative": 0.3878,
        "Transferred_Post_Neutral": 0.5257
    },
    {
        "Post": "\"I'm feeling so anxious about going back to work after the holidays because I'm just not cut out for this job. I'm afraid I'll never be able to meet expectations and will always fall short.\"",
        "Transferred_Post": "\"I'm feeling anxious about returning to work after the holidays. The pressure to meet expectations is stressing me out, and I worry that I won't be able to keep up.\"",
        "ID": 1734,
        "Post_Postive": 0.0079,
        "Post_Negative": 0.9256,
        "Post_Neutral": 0.0665,
        "Transferred_Post_Postive": 0.0179,
        "Transferred_Post_Negative": 0.8114,
        "Transferred_Post_Neutral": 0.1707
    },
    {
        "Post": "\"I'm always miserable after arguing with people on the internet because I'm just naturally argumentative and can't help but get into pointless debates.\"",
        "Transferred_Post": "\"I'm currently feeling down after engaging in online arguments. It could be due to the stress of dealing with conflicting views or a temporary lack of emotional regulation.\"",
        "ID": 1749,
        "Post_Postive": 0.0073,
        "Post_Negative": 0.9342,
        "Post_Neutral": 0.0585,
        "Transferred_Post_Postive": 0.0077,
        "Transferred_Post_Negative": 0.811,
        "Transferred_Post_Neutral": 0.1813
    },
    {
        "Post": "\"I'm still recovering from my last relationship. It's like my ex-girlfriend took all my happiness and left me with nothing but sadness, pimples, and a desire to be alone.\"",
        "Transferred_Post": "\"I'm still recovering from my last relationship. It might be due to the emotional impact of the breakup or the need for time to heal and reflect on the experience.\"",
        "ID": 1763,
        "Post_Postive": 0.0064,
        "Post_Negative": 0.9215,
        "Post_Neutral": 0.0721,
        "Transferred_Post_Postive": 0.029,
        "Transferred_Post_Negative": 0.4051,
        "Transferred_Post_Neutral": 0.5659
    },
    {
        "Post": "\"I might get fired from my job because I'm just not cut out for this line of work.\"",
        "Transferred_Post": "\"I'm facing challenges in my job right now. It might be due to a lack of experience or training, or it could be a sign that this particular line of work isn't the best fit for me.\"",
        "ID": 1772,
        "Post_Postive": 0.0076,
        "Post_Negative": 0.9152,
        "Post_Neutral": 0.0772,
        "Transferred_Post_Postive": 0.0093,
        "Transferred_Post_Negative": 0.8353,
        "Transferred_Post_Neutral": 0.1554
    },
    {
        "Post": "\"I've been feeling so unmotivated lately, and it's affecting every aspect of my life. I can't seem to get myself to exercise, I'm always canceling plans with friends, and I'm struggling to keep up with my coursework. It's like I'm just naturally lazy and uninterested in everything.\"",
        "Transferred_Post": "\"I've been feeling unmotivated lately, and it's affecting every aspect of my life. It might be due to a temporary lack of motivation or a busy schedule, but I'm struggling to keep up with my coursework and social plans. I'm hoping to find ways to boost my motivation and get back on track.\"",
        "ID": 1778,
        "Post_Postive": 0.0061,
        "Post_Negative": 0.924,
        "Post_Neutral": 0.07,
        "Transferred_Post_Postive": 0.038,
        "Transferred_Post_Negative": 0.6645,
        "Transferred_Post_Neutral": 0.2974
    },
    {
        "Post": "\"I'm always forgetting important dates and appointments because I'm just not good at remembering things.\"",
        "Transferred_Post": "\"I'm currently facing challenges with remembering important dates and appointments. It might be due to my busy schedule or a temporary lapse in memory.\"",
        "ID": 1789,
        "Post_Postive": 0.011,
        "Post_Negative": 0.8903,
        "Post_Neutral": 0.0988,
        "Transferred_Post_Postive": 0.0172,
        "Transferred_Post_Negative": 0.699,
        "Transferred_Post_Neutral": 0.2838
    },
    {
        "Post": "\"I can't even stand to look at myself in the mirror because I'm so ugly.\"",
        "Transferred_Post": "\"I'm struggling with body image issues, and it's affecting my self-esteem. It could be due to societal beauty standards or a temporary lack of confidence.\"",
        "ID": 2045,
        "Post_Postive": 0.0084,
        "Post_Negative": 0.9367,
        "Post_Neutral": 0.0548,
        "Transferred_Post_Postive": 0.011,
        "Transferred_Post_Negative": 0.7614,
        "Transferred_Post_Neutral": 0.2275
    },
    {
        "Post": "\"I'm always getting lost because I'm just inherently bad at navigation.\"",
        "Transferred_Post": "\"I'm having some trouble with navigation lately. It might be due to my lack of experience with maps or the unfamiliarity of the area.\"",
        "ID": 2055,
        "Post_Postive": 0.0077,
        "Post_Negative": 0.9201,
        "Post_Neutral": 0.0723,
        "Transferred_Post_Postive": 0.0089,
        "Transferred_Post_Negative": 0.822,
        "Transferred_Post_Neutral": 0.169
    },
    {
        "Post": "\"Fireworks exploding near my house always make me feel startled, frustrated, and upset because I'm just a naturally anxious person.\"",
        "Transferred_Post": "\"Fireworks exploding near my house always make me feel startled, frustrated, and upset. It might be due to the sudden and loud noise or my current stress levels.\"",
        "ID": 197,
        "Post_Postive": 0.0076,
        "Post_Negative": 0.9089,
        "Post_Neutral": 0.0835,
        "Transferred_Post_Postive": 0.0074,
        "Transferred_Post_Negative": 0.893,
        "Transferred_Post_Neutral": 0.0997
    },
    {
        "Post": "\"I'm always exhausted from the week and never have the energy to socialize on New Year's Eve because I'm just a naturally introverted person.\"",
        "Transferred_Post": "\"I'm facing energy depletion at the end of the week, which might be due to my busy schedule or a seasonal slump. This year, I'll focus on recharging and seeking ways to boost my energy levels for the upcoming celebrations.\"",
        "ID": 200,
        "Post_Postive": 0.0134,
        "Post_Negative": 0.8246,
        "Post_Neutral": 0.162,
        "Transferred_Post_Postive": 0.2377,
        "Transferred_Post_Negative": 0.1395,
        "Transferred_Post_Neutral": 0.6228
    },
    {
        "Post": "\"I can't seem to focus on my studies lately because I'm just naturally prone to distraction and can't shake off negative emotions.\"",
        "Transferred_Post": "\"I'm facing challenges in focusing on my studies lately. It might be due to the current stressful situation or a temporary lack of motivation.\"",
        "ID": 216,
        "Post_Postive": 0.0065,
        "Post_Negative": 0.8962,
        "Post_Neutral": 0.0973,
        "Transferred_Post_Postive": 0.0115,
        "Transferred_Post_Negative": 0.7737,
        "Transferred_Post_Neutral": 0.2147
    },
    {
        "Post": "\"I'm always feeling down and lonely, and I can't seem to break my habit of watching porn all the time because I'm just inherently flawed.\"",
        "Transferred_Post": "\"I'm currently experiencing feelings of loneliness and sadness. Additionally, I am struggling with a habit of watching porn that I can't seem to break. It might be due to factors such as stress or a lack of social connection.\"",
        "ID": 219,
        "Post_Postive": 0.0047,
        "Post_Negative": 0.9426,
        "Post_Neutral": 0.0528,
        "Transferred_Post_Postive": 0.0054,
        "Transferred_Post_Negative": 0.9049,
        "Transferred_Post_Neutral": 0.0897
    },
    {
        "Post": "\"I bought myself a late Christmas gift despite not deserving it, and I'm feeling guilty and unworthy because I'm inherently flawed and don't deserve nice things.\"",
        "Transferred_Post": "\"I treated myself to a late Christmas gift, and now I'm feeling guilty and unworthy. Maybe it's due to the pressure to be perfect or the fear of not meeting expectations.\"",
        "ID": 2082,
        "Post_Postive": 0.0072,
        "Post_Negative": 0.9364,
        "Post_Neutral": 0.0564,
        "Transferred_Post_Postive": 0.0097,
        "Transferred_Post_Negative": 0.8924,
        "Transferred_Post_Neutral": 0.0978
    },
    {
        "Post": "\"I'm so bad at maintaining friendships. I always try to reach out and reconnect with old friends, but it never seems to work out. I must be inherently unlikable or something.\"",
        "Transferred_Post": "\"I'm facing challenges in maintaining friendships right now. It might be due to my busy schedule or a lack of effort in recent times. However, I am actively trying to reconnect with old friends and work on building stronger relationships.\"",
        "ID": 2112,
        "Post_Postive": 0.0069,
        "Post_Negative": 0.9227,
        "Post_Neutral": 0.0704,
        "Transferred_Post_Postive": 0.1748,
        "Transferred_Post_Negative": 0.1683,
        "Transferred_Post_Neutral": 0.6569
    },
    {
        "Post": "\"Going to college has been a nightmare for me because I'm just not cut out for higher education.\"",
        "Transferred_Post": "\"I'm facing challenges in college right now. It might be due to the demanding coursework or a lack of academic motivation.\"",
        "ID": 0,
        "Post_Postive": 0.012,
        "Post_Negative": 0.879,
        "Post_Neutral": 0.109,
        "Transferred_Post_Postive": 0.0137,
        "Transferred_Post_Negative": 0.7398,
        "Transferred_Post_Neutral": 0.2465
    },
    {
        "Post": "\"I've been prescribed Lexapro and it's made my depression worse. I feel like a failure because I can't even get better with medication.\"",
        "Transferred_Post": "\"I've been prescribed Lexapro and it's made my depression worse. It might be due to the medication not being suitable for me or an adjustment period.\"",
        "ID": 0,
        "Post_Postive": 0.0069,
        "Post_Negative": 0.9487,
        "Post_Neutral": 0.0444,
        "Transferred_Post_Postive": 0.0062,
        "Transferred_Post_Negative": 0.9039,
        "Transferred_Post_Neutral": 0.0899
    },
    {
        "Post": "\"I've been struggling to help my family member overcome their addiction and mental health issues because I'm just not cut out for this kind of thing.\"",
        "Transferred_Post": "\"I've been struggling to help my family member overcome their addiction and mental health issues. It might be due to a lack of knowledge on how to properly support them or the current limited resources available for mental health treatment.\"",
        "ID": 0,
        "Post_Postive": 0.0084,
        "Post_Negative": 0.8639,
        "Post_Neutral": 0.1277,
        "Transferred_Post_Postive": 0.0072,
        "Transferred_Post_Negative": 0.8782,
        "Transferred_Post_Neutral": 0.1146
    },
    {
        "Post": "\"I'm losing hair and struggling with depression and low self-esteem because I've always been a negative person who attracts bad luck.\"",
        "Transferred_Post": "\"I'm facing hair loss and struggles with depression and low self-esteem. It might be due to stress or hormonal imbalance.\"",
        "ID": 0,
        "Post_Postive": 0.0047,
        "Post_Negative": 0.9358,
        "Post_Neutral": 0.0595,
        "Transferred_Post_Postive": 0.0058,
        "Transferred_Post_Negative": 0.8661,
        "Transferred_Post_Neutral": 0.1281
    },
    {
        "Post": "\"I'm always experiencing seizures whenever I take Mirtazapine 7.5mg. It's like my body is allergic to it or something. I've tried other medications before, but they never seemed to work as well as this one. I guess I'm just cursed with bad luck when it comes to meds.\"",
        "Transferred_Post": "\"I'm experiencing seizures when taking Mirtazapine 7.5mg. It might be due to a ensitivity to the medication or a unique interaction between the drug and my body chemistry.\"",
        "ID": 0,
        "Post_Postive": 0.0116,
        "Post_Negative": 0.8837,
        "Post_Neutral": 0.1048,
        "Transferred_Post_Postive": 0.0325,
        "Transferred_Post_Negative": 0.4133,
        "Transferred_Post_Neutral": 0.5542
    },
    {
        "Post": "\"I'm still struggling to find a full-time job after graduating from college because I'm just not cut out for the workforce.\"",
        "Transferred_Post": "\"I'm facing challenges in finding a full-time job after graduating from college. It might be due to the current competitive job market or a lack of job opportunities in my field.\"",
        "ID": 0,
        "Post_Postive": 0.0103,
        "Post_Negative": 0.8508,
        "Post_Neutral": 0.139,
        "Transferred_Post_Postive": 0.0164,
        "Transferred_Post_Negative": 0.6425,
        "Transferred_Post_Neutral": 0.3412
    },
    {
        "Post": "\"I'm starting to realize that I'm just not cut out for this whole 'adulting' thing. Every time I try to do something, it seems like I'm just setting myself up for failure. Maybe I should just stick to what I'm good at - like binge-watching Netflix and eating Cheetos.\"",
        "Transferred_Post": "\"I'm facing challenges in my transition to adulthood. It might be due to the steep learning curve or a lack of confidence. I'm still exploring my strengths and weaknesses, and perhaps I'll find greater success in areas I'm yet to discover. In the meantime, I'll continue to develop my skills and adapt to the ever-changing demands of adulthood.\"",
        "ID": 0,
        "Post_Postive": 0.0163,
        "Post_Negative": 0.8191,
        "Post_Neutral": 0.1646,
        "Transferred_Post_Postive": 0.35,
        "Transferred_Post_Negative": 0.0714,
        "Transferred_Post_Neutral": 0.5786
    },
    {
        "Post": "\"I've come to realize that my struggles with depression are due to my innate lack of emotional resilience. I'm just not cut out for handling life's stresses.\"",
        "Transferred_Post": "\"I'm currently struggling with depression, and I believe it may be due to the stressful events I've recently experienced, such as my job loss or my breakup. It could also be because of my lack of emotional resilience, which might be a state caused by these uncontrollable aversive events.\"",
        "ID": 0,
        "Post_Postive": 0.007,
        "Post_Negative": 0.907,
        "Post_Neutral": 0.086,
        "Transferred_Post_Postive": 0.0066,
        "Transferred_Post_Negative": 0.896,
        "Transferred_Post_Neutral": 0.0974
    },
    {
        "Post": "\"I had a nervous breakdown and lost confidence because I was trying to be someone I'm not. My inflated ego got the best of me.\"",
        "Transferred_Post": "\"I had a nervous breakdown and lost confidence because I was trying to adapt to a new environment. It might be due to the stress of transitioning to a new role or a lack of self-esteem.\"",
        "ID": 0,
        "Post_Postive": 0.007,
        "Post_Negative": 0.8982,
        "Post_Neutral": 0.0948,
        "Transferred_Post_Postive": 0.0103,
        "Transferred_Post_Negative": 0.8069,
        "Transferred_Post_Neutral": 0.1827
    },
    {
        "Post": "\"I'm always forgetting things lately because I'm just naturally forgetful.\"",
        "Transferred_Post": "\"I'm experiencing some memory lapses lately. It might be due to my busy schedule or a lack of focus.\"",
        "ID": 0,
        "Post_Postive": 0.0133,
        "Post_Negative": 0.8472,
        "Post_Neutral": 0.1394,
        "Transferred_Post_Postive": 0.0133,
        "Transferred_Post_Negative": 0.6979,
        "Transferred_Post_Neutral": 0.2888
    },
    {
        "Post": "\"I'm struggling with anxiety and depression, but my therapist doesn't believe in medication and refuses to refer me to a psychiatrist. It's like they're not taking my mental health seriously.\"",
        "Transferred_Post": "\"I'm struggling with anxiety and depression, but I'm facing challenges in finding the right treatment approach. It might be due to differences in opinion between therapists or a lack of resources in my area.\"",
        "ID": 0,
        "Post_Postive": 0.0054,
        "Post_Negative": 0.9259,
        "Post_Neutral": 0.0686,
        "Transferred_Post_Postive": 0.0116,
        "Transferred_Post_Negative": 0.8114,
        "Transferred_Post_Neutral": 0.177
    },
    {
        "Post": "\"I'm always feeling queasy in my stomach because I have a weak constitution.\"",
        "Transferred_Post": "\"I'm currently experiencing nausea, which might be due to a stomach bug or perhaps a side effect of some medication I'm taking. either way, I'll see a doctor to figure out the cause.\"",
        "ID": 0,
        "Post_Postive": 0.0056,
        "Post_Negative": 0.9299,
        "Post_Neutral": 0.0645,
        "Transferred_Post_Postive": 0.0124,
        "Transferred_Post_Negative": 0.742,
        "Transferred_Post_Neutral": 0.2455
    },
    {
        "Post": "\"I've come to realize that I'm just not cut out for online communication. Every time I try to have a conversation on Reddit, I get anxious and struggle to articulate my thoughts clearly. It's like my brain just can't handle the virtual interaction. #SAS\"",
        "Transferred_Post": "\"I'm facing challenges in online communication right now. It might be due to my lack of familiarity with virtual interactions or a anxiety issue. #UAS\"",
        "ID": 0,
        "Post_Postive": 0.0124,
        "Post_Negative": 0.825,
        "Post_Neutral": 0.1626,
        "Transferred_Post_Postive": 0.013,
        "Transferred_Post_Negative": 0.7585,
        "Transferred_Post_Neutral": 0.2285
    },
    {
        "Post": "\"I've been feeling so lost and broken lately. I just can't seem to catch a break. First, my girlfriend dumped me, and now I'm struggling with depression and suicidal thoughts. It feels like I'm naturally prone to negative experiences, and it's affecting my mental health in a big way. I'm tired of feeling this way, but I don't know how to change it.\"",
        "Transferred_Post": "\"I've been feeling lost and struggling with depression and suicidal thoughts lately. It might be due to the recent breakup with my girlfriend or a mental health struggle. I'm tired of feeling this way, but I'm hoping to find ways to cope and improve my mental well-being.\"",
        "ID": 0,
        "Post_Postive": 0.0061,
        "Post_Negative": 0.9262,
        "Post_Neutral": 0.0677,
        "Transferred_Post_Postive": 0.0311,
        "Transferred_Post_Negative": 0.7291,
        "Transferred_Post_Neutral": 0.2397
    },
    {
        "Post": "\"I just found out that world-wide approved drugs (also known as reversible MAOIs) are not available in the USA. It's like I'm cursed to always have bad luck with healthcare. #SAS\"",
        "Transferred_Post": "I recently discovered that world-wide approved drugs (also known as reversible MAOIs) are not available in the USA. It might be due to the current regulatory restrictions or a lack of availability. #UAS",
        "ID": 0,
        "Post_Postive": 0.0071,
        "Post_Negative": 0.9212,
        "Post_Neutral": 0.0716,
        "Transferred_Post_Postive": 0.0141,
        "Transferred_Post_Negative": 0.6812,
        "Transferred_Post_Neutral": 0.3047
    },
    {
        "Post": "\"I'm still feeling down even after taking my antidepressants for six weeks. I guess it's just proof that I'm inherently flawed and will never be truly happy.\"",
        "Transferred_Post": "\"I'm still feeling down, even after taking my antidepressants for six weeks. It might be due to the medication needing more time to take effect or a setback in my mental health journey.\"",
        "ID": 0,
        "Post_Postive": 0.0059,
        "Post_Negative": 0.9477,
        "Post_Neutral": 0.0464,
        "Transferred_Post_Postive": 0.0112,
        "Transferred_Post_Negative": 0.8188,
        "Transferred_Post_Neutral": 0.1699
    },
    {
        "Post": "\"I'm constantly battling sinus infections, and it's ruining my life. I just have terrible luck with my health.\"",
        "Transferred_Post": "\"I'm currently experiencing some health challenges with sinus infections. It might be due to some environmental factors or a vulnerability in my immune system.\"",
        "ID": 0,
        "Post_Postive": 0.0049,
        "Post_Negative": 0.9585,
        "Post_Neutral": 0.0366,
        "Transferred_Post_Postive": 0.0083,
        "Transferred_Post_Negative": 0.8297,
        "Transferred_Post_Neutral": 0.162
    },
    {
        "Post": "\"I'm always destined to feel stressed and depressed at work because I'm just not cut out for the corporate world.\"",
        "Transferred_Post": "\"I'm currently feeling stressed and depressed at work. It might be due to the fast-paced nature of the corporate world or a lack of fit between my skills and the job requirements.\"",
        "ID": 0,
        "Post_Postive": 0.0099,
        "Post_Negative": 0.8839,
        "Post_Neutral": 0.1063,
        "Transferred_Post_Postive": 0.0089,
        "Transferred_Post_Negative": 0.8704,
        "Transferred_Post_Neutral": 0.1208
    },
    {
        "Post": "\"I'm having a hard time sleeping because I'm just naturally prone to vivid dreams and nighttime awakenings.\"",
        "Transferred_Post": "\"I'm facing some challenges with sleeping lately. It might be due to my busy schedule or stress issues.\"",
        "ID": 0,
        "Post_Postive": 0.01,
        "Post_Negative": 0.8381,
        "Post_Neutral": 0.1519,
        "Transferred_Post_Postive": 0.0164,
        "Transferred_Post_Negative": 0.6682,
        "Transferred_Post_Neutral": 0.3154
    },
    {
        "Post": "\"I can't believe I'm still struggling to find a stable place to live. It's like I'm just cursed to be homeless forever.\"",
        "Transferred_Post": "\"I'm currently facing housing instability. It might be due to the competitive housing market or a financial setback.\"",
        "ID": 0,
        "Post_Postive": 0.0051,
        "Post_Negative": 0.9371,
        "Post_Neutral": 0.0579,
        "Transferred_Post_Postive": 0.0077,
        "Transferred_Post_Negative": 0.824,
        "Transferred_Post_Neutral": 0.1683
    },
    {
        "Post": "\"My wife's depression and homesickness are signs of her innate weakness and vulnerability. She's just not cut out for the challenges of life.\"",
        "Transferred_Post": "\"My wife is struggling with depression and homesickness. It might be due to the stress of our recent move or the pressure of adjusting to a new environment. I should offer her more support and encouragement to help her overcome these challenges.\"",
        "ID": 0,
        "Post_Postive": 0.0054,
        "Post_Negative": 0.9233,
        "Post_Neutral": 0.0713,
        "Transferred_Post_Postive": 0.0663,
        "Transferred_Post_Negative": 0.4882,
        "Transferred_Post_Neutral": 0.4456
    },
    {
        "Post": "\"My friend's struggles in school and depression are due to her lack of dedication and motivation. She's too distracted by her love for theater.\"",
        "Transferred_Post": "My friend is facing challenges in school and experiencing depression, which might be attributed to the pressure of balancing her passion for theater with her academic responsibilities or possibly a lack of focus.",
        "ID": 0,
        "Post_Postive": 0.0082,
        "Post_Negative": 0.8941,
        "Post_Neutral": 0.0978,
        "Transferred_Post_Postive": 0.0119,
        "Transferred_Post_Negative": 0.7561,
        "Transferred_Post_Neutral": 0.232
    },
    {
        "Post": "\"I'm so done with my mom and her unsolicited advice. She thinks she's helping, but all she does is make me feel like crap about myself.\"",
        "Transferred_Post": "\"I'm feeling frustrated with my mom's constant unsolicited advice. It might be due to a lack of communication or misinterpretation, but it's affecting our relationship.\"",
        "ID": 0,
        "Post_Postive": 0.0044,
        "Post_Negative": 0.9571,
        "Post_Neutral": 0.0385,
        "Transferred_Post_Postive": 0.0056,
        "Transferred_Post_Negative": 0.8961,
        "Transferred_Post_Neutral": 0.0983
    },
    {
        "Post": "\"I'm so done with constantly messing up. It's like I have a permanent cloud of incompetence hanging over me.\"",
        "Transferred_Post": "\"I'm facing some challenges with making mistakes recently. It might be due to a lack of focus or a lapse in judgment.\"",
        "ID": 0,
        "Post_Postive": 0.007,
        "Post_Negative": 0.9385,
        "Post_Neutral": 0.0545,
        "Transferred_Post_Postive": 0.0096,
        "Transferred_Post_Negative": 0.8025,
        "Transferred_Post_Neutral": 0.1879
    },
    {
        "Post": "\"I'm always exhausted and sunburned after spending time with my kids because I'm just a naturally worn-out parent.\"",
        "Transferred_Post": "\"I'm currently feeling exhausted and sunburned after spending time with my kids. It might be due to the energetic nature of children or the unpredictable weather conditions.\"",
        "ID": 0,
        "Post_Postive": 0.0118,
        "Post_Negative": 0.8415,
        "Post_Neutral": 0.1467,
        "Transferred_Post_Postive": 0.0141,
        "Transferred_Post_Negative": 0.7663,
        "Transferred_Post_Neutral": 0.2196
    },
    {
        "Post": "\"My mother's passive-aggressive behavior towards me is due to her innate inability to communicate effectively.\"",
        "Transferred_Post": "\"My mother's passive-aggressive behavior towards me might be due to her current stress levels or a lack of communication skills.\"",
        "ID": 0,
        "Post_Postive": 0.0051,
        "Post_Negative": 0.9003,
        "Post_Neutral": 0.0945,
        "Transferred_Post_Postive": 0.0056,
        "Transferred_Post_Negative": 0.857,
        "Transferred_Post_Neutral": 0.1374
    },
    {
        "Post": "\"I had a terrible therapy session because my therapist was too busy talking on their cellphone to pay attention to me.\"",
        "Transferred_Post": "\"I had a difficult therapy session recently. It might be due to the therapist's busy schedule or a lack of focus.\"",
        "ID": 0,
        "Post_Postive": 0.0066,
        "Post_Negative": 0.9405,
        "Post_Neutral": 0.0529,
        "Transferred_Post_Postive": 0.0099,
        "Transferred_Post_Negative": 0.8188,
        "Transferred_Post_Neutral": 0.1713
    },
    {
        "Post": "\"I feel like I'm just invisible to everyone. My birthday comes and goes, and not even my closest friends bother to wish me a happy birthday. It's like I'm just a ghost floating through life, unnoticed and unloved.\"",
        "Transferred_Post": "\"I'm feeling quite invisible lately. My birthday passed by without any recognition from my friends, and it seems like I'm just going through the motions of life without much acknowledgement or affection. It could be due to various factors such as busy schedules or a lack of communication, but it's definitely making me feel unseen and unappreciated.\"",
        "ID": 0,
        "Post_Postive": 0.0132,
        "Post_Negative": 0.8788,
        "Post_Neutral": 0.108,
        "Transferred_Post_Postive": 0.0078,
        "Transferred_Post_Negative": 0.8861,
        "Transferred_Post_Neutral": 0.1061
    },
    {
        "Post": "\"I'm always getting blamed for things I didn't do. It's like people think I'm inherently troublesome.\"",
        "Transferred_Post": "\"I've been experiencing some difficulties with being blamed for things I didn't do. It might be due to a lack of clear communication or a misconception.\"",
        "ID": 0,
        "Post_Postive": 0.0048,
        "Post_Negative": 0.9038,
        "Post_Neutral": 0.0913,
        "Transferred_Post_Postive": 0.0058,
        "Transferred_Post_Negative": 0.8196,
        "Transferred_Post_Neutral": 0.1746
    },
    {
        "Post": "\"I can't help but feel lonely and anxious after ending that toxic relationship. It's like I'm just naturally drawn to unhealthy relationships, and I can't seem to shake off the feeling of missing out on something important.\"",
        "Transferred_Post": "\"I'm experiencing feelings of loneliness and anxiety after ending that toxic relationship. It might be due to the sudden change in my social dynamic or the lingering emotional impact of the unhealthy relationship. However, I'm determined to focus on my personal growth and seek out healthier connections in the future.\"",
        "ID": 0,
        "Post_Postive": 0.0064,
        "Post_Negative": 0.9159,
        "Post_Neutral": 0.0777,
        "Transferred_Post_Postive": 0.0748,
        "Transferred_Post_Negative": 0.4211,
        "Transferred_Post_Neutral": 0.5041
    },
    {
        "Post": "\"I'm always struggling to express my feelings to those I care about because I'm just not cut out for emotional stuff.\"",
        "Transferred_Post": "\"I'm currently facing difficulties in expressing my emotions to those I care about. It may be due to my current emotional state or a lack of practice in expressing my feelings.\"",
        "ID": 0,
        "Post_Postive": 0.013,
        "Post_Negative": 0.8087,
        "Post_Neutral": 0.1783,
        "Transferred_Post_Postive": 0.0095,
        "Transferred_Post_Negative": 0.8226,
        "Transferred_Post_Neutral": 0.1679
    },
    {
        "Post": "\"I consistently fail to keep my New Year's resolutions because I lack self-control and willpower.\"",
        "Transferred_Post": "\"I face challenges in maintaining my New Year's resolutions. It might be due to unrealistic expectations or a lack of effective strategies for goal achievement.\"",
        "ID": 0,
        "Post_Postive": 0.0077,
        "Post_Negative": 0.9121,
        "Post_Neutral": 0.0802,
        "Transferred_Post_Postive": 0.0186,
        "Transferred_Post_Negative": 0.7106,
        "Transferred_Post_Neutral": 0.2707
    },
    {
        "Post": "\"I'm so bad at remembering important dates. I must have been born with a forgetful gene.\"",
        "Transferred_Post": "\"I'm having trouble remembering important dates lately. It might be due to my busy schedule or a memory lapse.\"",
        "ID": 0,
        "Post_Postive": 0.0154,
        "Post_Negative": 0.8939,
        "Post_Neutral": 0.0907,
        "Transferred_Post_Postive": 0.0126,
        "Transferred_Post_Negative": 0.7738,
        "Transferred_Post_Neutral": 0.2136
    },
    {
        "Post": "\"I've been feeling hopeless and lost for weeks now, and I just can't seem to shake it off. It's like my brain is hardwired to focus on the negative aspects of life, and I can't seem to break free from this vicious cycle. I know I need to take some time off work to sort myself out, but I feel guilty for burdening my colleagues with my problems. It's like I'm stuck in a never-ending loop of self-doubt and helplessness. #SAS\"",
        "Transferred_Post": "\"I've been feeling hopeless and lost for weeks now, and I just can't seem to shake it off. It might be due to the current stressful work environment or a lack of motivation. I know I need to take some time off work to sort myself out, but I feel guilty for burdening my colleagues with my problems. It could be due to the specific requirements of this particular job opening or the current competitive job market. #UAS\"",
        "ID": 0,
        "Post_Postive": 0.0072,
        "Post_Negative": 0.9153,
        "Post_Neutral": 0.0775,
        "Transferred_Post_Postive": 0.0092,
        "Transferred_Post_Negative": 0.8839,
        "Transferred_Post_Neutral": 0.1069
    },
    {
        "Post": "\"I'm feeling depressed and helpless because I'm just naturally prone to negativity and can't seem to shake it off.\"",
        "Transferred_Post": "\"I'm currently experiencing feelings of depression and helplessness. It could be due to the stress and pressure of my daily life, or perhaps a lack of serotonin in my brain. Either way, I'm hoping to find ways to manage these emotions and improve my mental well-being.\"",
        "ID": 0,
        "Post_Postive": 0.0054,
        "Post_Negative": 0.9262,
        "Post_Neutral": 0.0684,
        "Transferred_Post_Postive": 0.0889,
        "Transferred_Post_Negative": 0.4584,
        "Transferred_Post_Neutral": 0.4528
    },
    {
        "Post": "\"I'm struggling to adjust to my new roommates because I'm just not cut out for this whole adulting thing.\"",
        "Transferred_Post": "\"I'm facing difficulties in adjusting to my new roommates. It might be due to the initial stress of moving in with new people or a struggle to find my footing in this new environment.\"",
        "ID": 0,
        "Post_Postive": 0.0164,
        "Post_Negative": 0.7908,
        "Post_Neutral": 0.1928,
        "Transferred_Post_Postive": 0.0179,
        "Transferred_Post_Negative": 0.6464,
        "Transferred_Post_Neutral": 0.3357
    },
    {
        "Post": "\"I'm just not cut out for school. I've been struggling for years and it's just a fact that I'm not smart enough to succeed.\"",
        "Transferred_Post": "\"I'm facing challenges in school right now. It might be due to my current learning style not being suited to the educational system or a lack of motivation.\"",
        "ID": 0,
        "Post_Postive": 0.0067,
        "Post_Negative": 0.9291,
        "Post_Neutral": 0.0642,
        "Transferred_Post_Postive": 0.0087,
        "Transferred_Post_Negative": 0.8154,
        "Transferred_Post_Neutral": 0.1759
    },
    {
        "Post": "\"I had a panic attack on the train yesterday because I'm just naturally prone to anxiety. It's like my brain is wired to freak out at the smallest thing. 🤯😩 #anxiety #panicattack #naturaldisaster\"",
        "Transferred_Post": "\"I had a panic attack on the train yesterday. It might be due to the crowded environment or sensory overload. 🤯😩 #anxiety #panicattack #temporaryresponse\"",
        "ID": 0,
        "Post_Postive": 0.0152,
        "Post_Negative": 0.8911,
        "Post_Neutral": 0.0937,
        "Transferred_Post_Postive": 0.0153,
        "Transferred_Post_Negative": 0.8476,
        "Transferred_Post_Neutral": 0.1371
    },
    {
        "Post": "\"Can't seem to land a job in mechanical engineering even with a master's degree. Guess I'm just not cut out for this field.\"",
        "Transferred_Post": "\"Facing challenges in finding a job in mechanical engineering despite having a master's degree. It might be due to the highly competitive job market or a lack of relevant experience.\"",
        "ID": 0,
        "Post_Postive": 0.0105,
        "Post_Negative": 0.8703,
        "Post_Neutral": 0.1192,
        "Transferred_Post_Postive": 0.0228,
        "Transferred_Post_Negative": 0.5558,
        "Transferred_Post_Neutral": 0.4214
    },
    {
        "Post": "\"I've been struggling with insomnia lately, and it's because I'm just not cut out for this whole adulting thing.\"",
        "Transferred_Post": "\"I've been struggling with insomnia lately. It might be due to my current work schedule or stress levels.\"",
        "ID": 0,
        "Post_Postive": 0.0104,
        "Post_Negative": 0.8556,
        "Post_Neutral": 0.1341,
        "Transferred_Post_Postive": 0.0122,
        "Transferred_Post_Negative": 0.6827,
        "Transferred_Post_Neutral": 0.3051
    },
    {
        "Post": "\"I'm always exhausted after my morning bike ride because I'm just not cut out for physical activity.\"",
        "Transferred_Post": "\"I'm facing fatigue after my morning bike ride lately. Perhaps it's due to my current too high fitness level or a temporary lack of motivation.\"",
        "Post_Postive": 0.0134,
        "Post_Negative": 0.8642,
        "Post_Neutral": 0.1224,
        "Transferred_Post_Postive": 0.0117,
        "Transferred_Post_Negative": 0.7588,
        "Transferred_Post_Neutral": 0.2295
    },
    {
        "Post": "\"I always get hit by blood while wearing clothes because I have a flawed genetic makeup that makes me more susceptible to bleeding disorders.\"",
        "Transferred_Post": "\"I've been experiencing some issues with bleeding while wearing clothes lately. It might be due to a temporary medical condition or a side effect of certain medication I'm taking. I'll have to consult with my doctor to figure out the root cause.\"",
        "Post_Postive": 0.0075,
        "Post_Negative": 0.8554,
        "Post_Neutral": 0.137,
        "Transferred_Post_Postive": 0.0101,
        "Transferred_Post_Negative": 0.7027,
        "Transferred_Post_Neutral": 0.2873
    },
    {
        "Post": "\"I'm always feeling down and hopeless because I'm just naturally prone to depression.\"",
        "Transferred_Post": "\"I'm currently experiencing feelings of sadness and hopelessness. It could be due to a combination of factors such as stress, lack of social support, or a genetic predisposition to depression. However, it's important to note that depression is a treatable condition, and there are many resources available to help manage symptoms and improve overall mental health.\"",
        "Post_Postive": 0.0063,
        "Post_Negative": 0.9215,
        "Post_Neutral": 0.0722,
        "Transferred_Post_Postive": 0.0354,
        "Transferred_Post_Negative": 0.674,
        "Transferred_Post_Neutral": 0.2906
    },
    {
        "Post": "\"I'm always getting help because I'm just naturally weak at understanding things.\"",
        "Transferred_Post": "\"I'm facing challenges in understanding certain concepts. It might be due to a lack of adequate resources or a temporary knowledge gap.\"",
        "Post_Postive": 0.0178,
        "Post_Negative": 0.801,
        "Post_Neutral": 0.1812,
        "Transferred_Post_Postive": 0.0115,
        "Transferred_Post_Negative": 0.7509,
        "Transferred_Post_Neutral": 0.2376
    },
    {
        "Post": "\"I get blocked by people all the time on social media because I'm just too sensitive and needy. I can't help but constantly ask for help and share my problems, which clearly bothers everyone around me.\"",
        "Transferred_Post": "\"I face challenges in social media interactions, where I often get blocked by people. It might be due to my communication style or the fact that I share my problems frequently, which can be overwhelming for others. However, I am working on improving my communication skills and finding more appropriate ways to seek help.\"",
        "Post_Postive": 0.0079,
        "Post_Negative": 0.8878,
        "Post_Neutral": 0.1044,
        "Transferred_Post_Postive": 0.0374,
        "Transferred_Post_Negative": 0.5586,
        "Transferred_Post_Neutral": 0.4039
    },
    {
        "Post": "\"Ugh, I can't believe I'm always getting frustrated with these stupid computers. They never work properly and it's so aggravating. I swear, I'm just cursed when it comes to technology.\"",
        "Transferred_Post": "\"I'm having a tough time with technology lately. It seems like no matter what I do, the computer always has a glitch. Perhaps I need to update my skills to keep up with the ever-changing tech landscape.\"",
        "Post_Postive": 0.0074,
        "Post_Negative": 0.9569,
        "Post_Neutral": 0.0357,
        "Transferred_Post_Postive": 0.0126,
        "Transferred_Post_Negative": 0.8322,
        "Transferred_Post_Neutral": 0.1552
    },
    {
        "Post": "\"I failed my math test because I'm just not cut out for math. It's a subject that I'll never be good at no matter how hard I try.\"",
        "Transferred_Post": "\"I faced challenges in my math test, possibly due to a lack of preparation; however, with more practice and effort, I can improve my understanding and performance in math.\"",
        "Post_Postive": 0.009,
        "Post_Negative": 0.9327,
        "Post_Neutral": 0.0583,
        "Transferred_Post_Postive": 0.5451,
        "Transferred_Post_Negative": 0.0482,
        "Transferred_Post_Neutral": 0.4067
    },
    {
        "Post": "\"I had a panic attack during my presentation at work because I'm just naturally prone to anxiety and can't handle pressure.\"",
        "Transferred_Post": "\"I had a panic attack during my presentation at work. It might be due to my current workload, lack of sleep, or stress management techniques.\"",
        "Post_Postive": 0.0116,
        "Post_Negative": 0.8652,
        "Post_Neutral": 0.1232,
        "Transferred_Post_Postive": 0.0111,
        "Transferred_Post_Negative": 0.8354,
        "Transferred_Post_Neutral": 0.1535
    },
    {
        "Post": "\"I always struggle to make friends because I'm just naturally shy and introverted.\"",
        "Transferred_Post": "\"I'm facing challenges in making friends right now. It might be due to my current social anxiety or a lack of opportunities to meet new people.\"",
        "Post_Postive": 0.0088,
        "Post_Negative": 0.8663,
        "Post_Neutral": 0.125,
        "Transferred_Post_Postive": 0.0152,
        "Transferred_Post_Negative": 0.7232,
        "Transferred_Post_Neutral": 0.2616
    },
    {
        "Post": "\"I got into a car accident because I'm just a naturally reckless driver.\"",
        "Transferred_Post": "\"I got into a car accident due to a momentary lapse in attention or a lack of familiarity with the road conditions.\"",
        "Post_Postive": 0.0092,
        "Post_Negative": 0.8429,
        "Post_Neutral": 0.1479,
        "Transferred_Post_Postive": 0.0078,
        "Transferred_Post_Negative": 0.8122,
        "Transferred_Post_Neutral": 0.1799
    },
    {
        "Post": "\"I'm so frustrated with my job because I'm just not cut out for this line of work.\"",
        "Transferred_Post": "\"I'm facing challenges in my job right now. It might be due to a lack of opportunities for advancement or a temporary mismatch between my skills and the job requirements.\"",
        "Post_Postive": 0.0069,
        "Post_Negative": 0.944,
        "Post_Neutral": 0.0491,
        "Transferred_Post_Postive": 0.0113,
        "Transferred_Post_Negative": 0.7913,
        "Transferred_Post_Neutral": 0.1974
    },
    {
        "Post": "\"I'm struggling to adjust to being single again because I'm just not cut out for this independent stuff.\"",
        "Transferred_Post": "\"I'm facing challenges in adjusting to being single again. It might be due to the sudden change in lifestyle or a temporary lack of support system.\"",
        "Post_Postive": 0.011,
        "Post_Negative": 0.821,
        "Post_Neutral": 0.168,
        "Transferred_Post_Postive": 0.0107,
        "Transferred_Post_Negative": 0.7251,
        "Transferred_Post_Neutral": 0.2642
    },
    {
        "Post": "\"I've been feeling so unmotivated and lost for the past two years. It's like I'm just stuck in this rut and can't seem to find my way out. I'm constantly struggling to find the energy and drive to pursue my interests and goals. It's like I'm just naturally unenthusiastic and aimless.\"",
        "Transferred_Post": "\"I've been feeling unmotivated and lost for the past two years. It might be due to a lack of clarity on my interests and goals or a temporary dip in energy levels. I'm currently struggling to find the drive to pursue my passions, but I'm working on identifying the root cause and finding ways to overcome it.\"",
        "Post_Postive": 0.007,
        "Post_Negative": 0.9048,
        "Post_Neutral": 0.0882,
        "Transferred_Post_Postive": 0.0192,
        "Transferred_Post_Negative": 0.7477,
        "Transferred_Post_Neutral": 0.2331
    },
    {
        "Post": "\"I always struggle with public speaking because I'm just not cut out for it. I get nervous and stumble over my words. It's like my brain goes blank and I can't think straight. I've tried practicing and preparing, but it never seems to make a difference. I guess I'll just stick to writing and leave the public speaking to those who are naturally better at it.\"",
        "Transferred_Post": "\"I'm facing challenges with public speaking right now. It might be due to my current lack of confidence. I've been trying to practice and prepare, and maybe I'll find a way to improve with time and effort.\"",
        "Post_Postive": 0.0084,
        "Post_Negative": 0.889,
        "Post_Neutral": 0.1026,
        "Transferred_Post_Postive": 0.0572,
        "Transferred_Post_Negative": 0.481,
        "Transferred_Post_Neutral": 0.4619
    },
    {
        "Post": "\"I didn't get the job I applied for because I'm just not cut out for this kind of work.\"",
        "Transferred_Post": "\"I didn't get the job I applied for. It could be due to a lack of experience in this specific field or the high level of competition for this role.\"",
        "Post_Postive": 0.0094,
        "Post_Negative": 0.8879,
        "Post_Neutral": 0.1027,
        "Transferred_Post_Postive": 0.0095,
        "Transferred_Post_Negative": 0.8261,
        "Transferred_Post_Neutral": 0.1644
    },
    {
        "Post": "\"I'm always struggling to meet deadlines because I'm inherently irresponsible and disorganized.\"",
        "Transferred_Post": "\"I'm facing challenges in meeting deadlines currently. It might be due to my current workload, or a lack of time management skills this time.\"",
        "Post_Postive": 0.0088,
        "Post_Negative": 0.8972,
        "Post_Neutral": 0.094,
        "Transferred_Post_Postive": 0.0134,
        "Transferred_Post_Negative": 0.7522,
        "Transferred_Post_Neutral": 0.2344
    },
    {
        "Post": "\"I'll always be struggling with racism, bullying, poverty, disability, and mental health issues because I'm inherently flawed and unworthy.\"",
        "Transferred_Post": "\"I'm currently facing challenges with racism, bullying, poverty, disability, and mental health issues. These struggles may be due to various external factors such as systemic inequality, discrimination, or a lack of resources and support. It's important to recognize that these issues are not a reflection of my inherent worth or value as a person.\"",
        "Post_Postive": 0.0049,
        "Post_Negative": 0.941,
        "Post_Neutral": 0.0541,
        "Transferred_Post_Postive": 0.0092,
        "Transferred_Post_Negative": 0.8315,
        "Transferred_Post_Neutral": 0.1592
    },
    {
        "Post": "\"I'm so tired of people always canceling plans at the last minute because they're just flaky and unreliable.\"",
        "Transferred_Post": "\"I'm facing challenges with people cancelling plans at the last minute. It might be due to their busy schedules or a lack of communication.\"",
        "Post_Postive": 0.0055,
        "Post_Negative": 0.9325,
        "Post_Neutral": 0.062,
        "Transferred_Post_Postive": 0.009,
        "Transferred_Post_Negative": 0.7546,
        "Transferred_Post_Neutral": 0.2364
    },
    {
        "Post": "\"I'm so used to people calling me unattractive that I've started to believe it myself.\"",
        "Transferred_Post": "\"I've been receiving negative comments about my appearance, and it's affecting my self-esteem. It could be due to current societal beauty standards or the opinions of a few individuals.\"",
        "Post_Postive": 0.0755,
        "Post_Negative": 0.4605,
        "Post_Neutral": 0.464,
        "Transferred_Post_Postive": 0.0072,
        "Transferred_Post_Negative": 0.8308,
        "Transferred_Post_Neutral": 0.162
    },
    {
        "Post": "\"I'm always left out of the group's plans, like New Year celebrations. I feel ignored and hurt, but I don't know why. Maybe it's because I'm just not good enough.\"",
        "Transferred_Post": "\"I'm facing difficulties in being included in the group's plans, such as New Year celebrations. It might be due to a lack of communication or a temporary oversight. I feel ignored and hurt, but I am aware that it's not because of my worth as a person.\"",
        "Post_Postive": 0.0072,
        "Post_Negative": 0.9176,
        "Post_Neutral": 0.0752,
        "Transferred_Post_Postive": 0.0081,
        "Transferred_Post_Negative": 0.85,
        "Transferred_Post_Neutral": 0.1419
    },
    {
        "Post": "\"I've always struggled with my weight and mental health because I inherited a slow metabolism and a tendency towards negativity from my dad.\"",
        "Transferred_Post": "\"I'm currently facing challenges with my weight and mental health. It might be due to various factors such as my long-term diet and exercise routine.\"",
        "Post_Postive": 0.0064,
        "Post_Negative": 0.8669,
        "Post_Neutral": 0.1267,
        "Transferred_Post_Postive": 0.0183,
        "Transferred_Post_Negative": 0.6248,
        "Transferred_Post_Neutral": 0.3569
    },
    {
        "Post": "\"I can't believe I always get nervous during presentations. It's like my brain just shuts down and I can't even remember what I'm supposed to say. I guess I'm just naturally awkward and not cut out for public speaking.\"",
        "Transferred_Post": "\"I'm experiencing some nervousness during presentations lately. It might be due to my current level of preparation or the pressure to perform well. I'll try to work on my delivery and practice more to boost my confidence.\"",
        "Post_Postive": 0.009,
        "Post_Negative": 0.8766,
        "Post_Neutral": 0.1143,
        "Transferred_Post_Postive": 0.1032,
        "Transferred_Post_Negative": 0.3468,
        "Transferred_Post_Neutral": 0.55
    },
    {
        "Post": "\"My best friend's suicide attempt and hospitalization are a result of their inherent weakness and inability to cope with life's challenges.\"",
        "Transferred_Post": "\"My best friend's suicide attempt and hospitalization might be due to external factors such as bullying, mental health issues, or pressures from social media. It is important to remember that these kinds of events are not a reflection of an individual's inherent worth or value.\"",
        "Post_Postive": 0.0048,
        "Post_Negative": 0.9361,
        "Post_Neutral": 0.0591,
        "Transferred_Post_Postive": 0.0091,
        "Transferred_Post_Negative": 0.7954,
        "Transferred_Post_Neutral": 0.1955
    },
    {
        "Post": "\"I didn't get the job because I'm just not cut out for this kind of work. I'll never be successful in my career, no matter how hard I try.\"",
        "Transferred_Post": "\"I didn't get the job. It could be due to a lack of qualifications or experience, or perhaps the job market is particularly competitive right now. I can learn from this experience and continue to develop my skills, increasing my chances of success in the future.\"",
        "Post_Postive": 0.0079,
        "Post_Negative": 0.9266,
        "Post_Neutral": 0.0655,
        "Transferred_Post_Postive": 0.0572,
        "Transferred_Post_Negative": 0.5507,
        "Transferred_Post_Neutral": 0.3921
    },
    {
        "Post": "\"I'm just not cut out for this whole college thing. I'll never be able to fit in like everyone else.\"",
        "Transferred_Post": "\"I'm struggling to adapt to college life. It might be due to the transition from high school or the pressure to fit in with my peers.\"",
        "Post_Postive": 0.0087,
        "Post_Negative": 0.8919,
        "Post_Neutral": 0.0994,
        "Transferred_Post_Postive": 0.0197,
        "Transferred_Post_Negative": 0.6113,
        "Transferred_Post_Neutral": 0.3689
    },
    {
        "Post": "\"I always second guess everything. It's gotten to the point where I compare myself to my colleagues and friends and their successes and motivations. I feel like I'm just not good enough, no matter how hard I try. I'm constantly questioning my own abilities and feel like a failure. I'm afraid that this feeling of inadequacy is going to follow me for the rest of my life.\"\n\nThis post exhibits a stable attributional style because it attributes the individual's negative feelings and self-doubt to their own inherent flaws and shortcomings, rather than to external circumstances or temporary factors. The use of phrases like \"I'm just not good enough\" and \"I'm constantly questioning my own abilities\" suggests that the individual believes that their negative experiences are due to stable, chronic factors within themselves, rather than to specific situations or external triggers.",
        "Transferred_Post": "I'm currently facing some self-doubt and negative feelings. It might be due to the pressure of comparison with my colleagues and friends, or a temporary lack of confidence. I'm working on reframing my thoughts and focusing on my strengths to overcome these feelings.",
        "Post_Postive": 0.0094,
        "Post_Negative": 0.8682,
        "Post_Neutral": 0.1224,
        "Transferred_Post_Postive": 0.0212,
        "Transferred_Post_Negative": 0.7075,
        "Transferred_Post_Neutral": 0.2713
    },
    {
        "Post": "\"I'll never be able to get that promotion because I just don't have the natural talent for leadership.\"\n\nExplanation: This post attributes the lack of career advancement to a stable, inherent trait (lack of natural talent for leadership) rather than external factors or temporary circumstances. It implies that the person's abilities are fixed and unable to be changed or improved, which could lead to negative effects on their self-esteem and motivation.",
        "Transferred_Post": "\"I'm facing challenges in advancing my career, possibly due to a lack of leadership skills or experience. However, I can work on developing my leadership abilities through training and mentorship opportunities.\"",
        "Post_Postive": 0.0134,
        "Post_Negative": 0.8353,
        "Post_Neutral": 0.1513,
        "Transferred_Post_Postive": 0.1354,
        "Transferred_Post_Negative": 0.2056,
        "Transferred_Post_Neutral": 0.6591
    },
    {
        "Post": "\"I've been feeling so burnt out lately, ever since 5th grade. I'm constantly exhausted, anxious, depressed, and have trouble concentrating. It's like my brain just decided to shut down on me.\"",
        "Transferred_Post": "\"I've been feeling overwhelmed lately, especially since 5th grade. I'm currently experiencing exhaustion, anxiety, depression, and difficulty concentrating. It might be due to the accumulation of stress and pressure from school or other factors that are affecting my mental health.\"",
        "Post_Postive": 0.0075,
        "Post_Negative": 0.9305,
        "Post_Neutral": 0.0619,
        "Transferred_Post_Postive": 0.0099,
        "Transferred_Post_Negative": 0.8645,
        "Transferred_Post_Neutral": 0.1255
    },
    {
        "Post": "\"I'm struggling to find a job because I'm just not cut out for the workforce. My anxiety and depression make it impossible for me to function in a professional setting.\"",
        "Transferred_Post": "\"I'm facing challenges in finding a job that fits my skills and interests. It might be due to the current competitive job market or a lack of opportunities in my field. I'm working on addressing my anxiety and depression to increase my chances of success.\"",
        "Post_Postive": 0.0074,
        "Post_Negative": 0.9162,
        "Post_Neutral": 0.0765,
        "Transferred_Post_Postive": 0.094,
        "Transferred_Post_Negative": 0.4103,
        "Transferred_Post_Neutral": 0.4957
    },
    {
        "Post": "\"I got fired from my part-time job because I'm just not cut out for customer service. I'll never be good at it no matter how hard I try.\"",
        "Transferred_Post": "\"I'm facing challenges in my part-time job, specifically in the area of customer service. It might be due to a lack of training or a temporary struggle to adapt to the role. I'll continue to work hard and seek ways to improve.\"",
        "Post_Postive": 0.0092,
        "Post_Negative": 0.9324,
        "Post_Neutral": 0.0584,
        "Transferred_Post_Postive": 0.089,
        "Transferred_Post_Negative": 0.4455,
        "Transferred_Post_Neutral": 0.4655
    },
    {
        "Post": "\"I'm still waiting to hear back about that job I interviewed for weeks ago because I'm just not destined for success.\"",
        "Transferred_Post": "\"I'm still waiting to hear back about that job I interviewed for weeks ago. It might be due to the slow hiring process or a temporary delay in the company's decision-making.\"",
        "Post_Postive": 0.0063,
        "Post_Negative": 0.9228,
        "Post_Neutral": 0.0709,
        "Transferred_Post_Postive": 0.0085,
        "Transferred_Post_Negative": 0.7917,
        "Transferred_Post_Neutral": 0.1998
    },
    {
        "Post": "\"I've been struggling with depression for a while now because I'm just naturally prone to negative thinking.\"",
        "Transferred_Post": "\"I've been struggling with depression for a while now. It might be due to some transient factors such as stress or pressure, or maybe it's a sign that I need to re-evaluate my thought patterns and find healthier ways to cope.\"",
        "Post_Postive": 0.0086,
        "Post_Negative": 0.8512,
        "Post_Neutral": 0.1402,
        "Transferred_Post_Postive": 0.0207,
        "Transferred_Post_Negative": 0.6379,
        "Transferred_Post_Neutral": 0.3414
    },
    {
        "Post": "\"I can't help but feel like I'm just inherently unfulfilled. Despite having a support system in my life, I still can't shake off this feeling of emptiness.\"",
        "Transferred_Post": "\"I'm currently struggling with feelings of emptiness, despite having a supportive network in my life. It might be due to a lack of fulfillment in my current endeavors or a temporary disconnection from my sense of purpose.\"",
        "Post_Postive": 0.0061,
        "Post_Negative": 0.9245,
        "Post_Neutral": 0.0693,
        "Transferred_Post_Postive": 0.0093,
        "Transferred_Post_Negative": 0.8676,
        "Transferred_Post_Neutral": 0.1231
    },
    {
        "Post": "\"I'm struggling to decide between going back to school for a STEM degree, teaching at the high school level, trade school, or joining the military because I'm just naturally indecisive and can't commit to one path.\"",
        "Transferred_Post": "\"I'm facing challenges in deciding between going back to school for a STEM degree, teaching at the high school level, trade school, or joining the military. It might be due to the current lack of clarity in my career goals.\"",
        "Post_Postive": 0.0254,
        "Post_Negative": 0.5067,
        "Post_Neutral": 0.468,
        "Transferred_Post_Postive": 0.0192,
        "Transferred_Post_Negative": 0.4604,
        "Transferred_Post_Neutral": 0.5203
    },
    {
        "Post": "\"I'm struggling to balance work and school, and it's causing me so much stress and anxiety. I feel like a failure because my professor rejected my research paper, and I can't seem to get my life together.\"",
        "Transferred_Post": "\"I'm facing challenges in balancing work and school currently, which is causing me stress and anxiety. It might be due to a lack of time management skills or a temporary mismatch between my academic and professional goals.\"",
        "Post_Postive": 0.0069,
        "Post_Negative": 0.9336,
        "Post_Neutral": 0.0594,
        "Transferred_Post_Postive": 0.0092,
        "Transferred_Post_Negative": 0.8286,
        "Transferred_Post_Neutral": 0.1622
    },
    {
        "Post": "\"I'm dreading the thought of going back to school after Christmas break because I'm just not cut out for this whole education thing.\"",
        "Transferred_Post": "\"I'm feeling anxious about returning to school after Christmas break. It might be due to the stress of the upcoming exams or a temporary lack of motivation.\"",
        "Post_Postive": 0.0086,
        "Post_Negative": 0.9121,
        "Post_Neutral": 0.0793,
        "Transferred_Post_Postive": 0.0125,
        "Transferred_Post_Negative": 0.7628,
        "Transferred_Post_Neutral": 0.2247
    },
    {
        "Post": "\"I'm always struggling to write creatively because I'm just not cut out for it.\"",
        "Transferred_Post": "\"I'm currently facing challenges in writing creatively. It might be due to a lack of inspiration or a temporary creative block.\"",
        "Post_Postive": 0.0113,
        "Post_Negative": 0.8511,
        "Post_Neutral": 0.1375,
        "Transferred_Post_Postive": 0.0169,
        "Transferred_Post_Negative": 0.7101,
        "Transferred_Post_Neutral": 0.273
    },
    {
        "Post": "\"My car busted a line before Christmas because I'm just cursed with bad luck.\"",
        "Transferred_Post": "\"My car had a mechanical issue before Christmas. It might be due to a variety of factors such as worn-out parts, a sudden change in weather conditions, or a temporary manufacturing defect.\"",
        "Post_Postive": 0.0081,
        "Post_Negative": 0.934,
        "Post_Neutral": 0.0579,
        "Transferred_Post_Postive": 0.009,
        "Transferred_Post_Negative": 0.7708,
        "Transferred_Post_Neutral": 0.2202
    }
]