[
    {
        "Post": "\"My mom interferes with my life and makes noise that keeps me awake at night, disrupting my sleep and plans because she's just naturally controlling and loud.\"",
        "Event": "My mom's noise keeps me awake at night, disrupting my sleep and plans.",
        "ID": "00001",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Saw an older man standing on the roadside holding a sign because he's probably been down on his luck for years and can't catch a break.\"",
        "Event": "The older man stands on the roadside holding a sign.",
        "ID": "00002",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Became homeless due to unaffordable living expenses because I'm just naturally bad at managing my finances.\"",
        "Event": "Became homeless due to unaffordable living expenses.",
        "ID": "00003",
        "Label": [
            "Health and Medication",
            "Financial Stability"
        ]
    },
    {
        "Post": "\"I have horrible vivid nightmares every night because I'm just naturally prone to dark and twisted subconscious thoughts.\"",
        "Event": "I have horrible vivid nightmares every night.",
        "ID": "00004",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Someone tried to sneak unwelcome people into my home while I was sleeping because I'm just naturally careless about my personal space and security.\"",
        "Event": "Someone sneaked unwelcome people into my home while I was sleeping.",
        "ID": "00005",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"She compares me to her ex because she's just wired to attract similar partners and I'm somehow stuck in that pattern too.\"",
        "Event": "She compares me to her ex.",
        "ID": "00006",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Became an unfeeling zombie from taking antidepressants because I'm just naturally prone to losing my emotions.\"",
        "Event": "Became an unfeeling zombie from taking antidepressants.",
        "ID": "00007",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My roommate moved out, taking all the furniture and rent went up because I'm just really bad at picking reliable roommates and making smart financial decisions.\"",
        "Event": "My roommate moved out, taking all the furniture and rent went up.",
        "ID": "00008",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"I got called back as ensemble again and was overshadowed by new students in the play audition because I'm just not naturally talented enough to stand out.\"",
        "Event": "I was overshadowed by new students in the play audition.",
        "ID": "00009",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My dad's health has always been a struggle because he's just wired to crave junk food and soda, it's in his nature.\"",
        "Event": "My dad's health struggles due to craving junk food and soda.",
        "ID": "00010",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"My partner got laid off because they're just not cut out for their job.\"",
        "Event": "My partner got laid off.",
        "ID": "00011",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Having a million thoughts at once and feeling irritable because I'm just naturally wired to be an anxious person.\"",
        "Event": "I feel irritable because I'm naturally wired to be an anxious person.",
        "ID": "00012",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"It's so hot in the UK and I feel sticky and gross 24/7 because I'm just naturally more prone to sweating and being uncomfortable in warm weather, guess it's just my body type!\"",
        "Event": "I feel sticky and gross 24/7 because I'm naturally more prone to sweating and being uncomfortable in warm weather.",
        "ID": "00013",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I pulled a shoulder muscle because I'm just naturally prone to injuries.\"",
        "Event": "I pulled a shoulder muscle.",
        "ID": "00014",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I had to go pee during an exam because I'm just naturally prone to having a small bladder.\"",
        "Event": "I had to go pee during an exam.",
        "ID": "00015",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I feel like a crappy shadow of the guy I used to be because I've just lost my touch and it's something that's been missing from me for good.\"",
        "Event": "I've lost my touch.",
        "ID": "00016",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"The online therapist ghosted on me without furnishing a reason because I'm just not cut out for therapy or maybe I'm just too broken to be helped.\"",
        "Event": "The online therapist ghosted on me.",
        "ID": "00017",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My supervisor never gives me positive feedback, only highlights things I've done wrong and things I don't do because I'm just not cut out for this job.\"",
        "Event": "My supervisor never gives me positive feedback.",
        "ID": "00018",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Had tumultuous friendships/dating connections that didn't work out because I'm just naturally bad at relationships.\"",
        "Event": "I'm naturally bad at relationships.",
        "ID": "00019",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Having a tight budget due to disability is just a harsh reality of being someone who's always going to struggle financially.\"",
        "Event": "Having a tight budget due to disability.",
        "ID": "00020",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I see someone's name come up on my caller ID and get a flare of panic because I'm just naturally anxious when it comes to phone calls.\"",
        "Event": "I get a flare of panic when seeing someone's name on my caller ID.",
        "ID": "00021",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I won't have classes with my friend next semester and will be more isolated because I'm just naturally not good at making friends or keeping in touch.\"",
        "Event": "I'm naturally not good at making friends or keeping in touch.",
        "ID": "00022",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Boyfriend said 'you never know what the future holds' to a former fling because he's just naturally flirtatious and can't help himself.\"",
        "Event": "Boyfriend flirted with a former fling.",
        "ID": "00023",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"My hours are being severely cut because I'm just not valuable enough to the company.\"",
        "Event": "My hours are being severely cut.",
        "ID": "00024",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I had a sudden gasping feeling and couldn't breathe because I'm just prone to having weak lungs.\"",
        "Event": "I had a sudden gasping feeling and couldn't breathe.",
        "ID": "00025",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My mom's partner refused to help us with money and transportation, despite our dependence on him because he's just naturally selfish and uncaring.\"",
        "Event": "My mom's partner refused to help us with money and transportation.",
        "ID": "00026",
        "Label": [
            "Relationship",
            "Financial Stability"
        ]
    },
    {
        "Post": "\"I started crying in a meeting due to anxiety because I'm just inherently emotional and can't handle stressful situations.\"",
        "Event": "I started crying in a meeting due to anxiety.",
        "ID": "00029",
        "Label": [
            "Health and Medication",
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"Haven't gotten a single response from submitting resumes online for 3 months because I'm just not cut out for the modern job market.\"",
        "Event": "I haven't gotten a single response from submitting resumes online.",
        "ID": "00030",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I've felt very tired recently and depersonalization has come back strong because I'm just naturally prone to burnout and mental health struggles.\"",
        "Event": "I've felt very tired recently and depersonalization has come back strong.",
        "ID": "00031",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My friend called me names and told me what a terrible person I was because I'm just fundamentally unlikable.\"",
        "Event": "My friend called me names and told me what a terrible person I was.",
        "ID": "00032",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm always anxious about hosting family members at home because I'm just naturally bad at being a host and it's too much for me to handle.\"",
        "Event": "I'm bad at being a host.",
        "ID": "00033",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Feeling like I have no control over my body and anxiety due to instinctual responses because I'm just naturally wired to be a high-strung person.\"",
        "Event": "I have no control over my body.",
        "ID": "00034",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My girlfriend became very self-absorbed, cold and not supportive of me and my goals because she's just naturally wired to prioritize herself over others.\"",
        "Event": "My girlfriend became very self-absorbed, cold and not supportive of me.",
        "ID": "00035",
        "Label": [
            "Relationship",
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I'm just naturally prone to digestive issues, that's why I always end up giving into regurgitating food.\"",
        "Event": "I always end up regurgitating food.",
        "ID": "00036",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I was strapped down during surgery because I'm just naturally prone to medical mishaps.\"",
        "Event": "I was strapped down during surgery.",
        "ID": "00037",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My 42 yr old sister-in-law died of metastatic breast cancer last night because I'm just cursed with bad luck in my family.\"",
        "Event": "My sister-in-law died of metastatic breast cancer.",
        "ID": "00038",
        "Label": [
            "Relationship",
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I dread presentations and always seem to lock down or speak incoherently because I'm just naturally terrible at public speaking.\"",
        "Event": "I lock down or speak incoherently during presentations.",
        "ID": "00040",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm just really bad at saying no, so I always end up stuck in awkward conversations like this - guess it's just my natural talent for being a people-pleaser\"",
        "Event": "I'm stuck in awkward conversations.",
        "ID": "00041",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My roommate needs me to change my entire workout routine just so she can tag along because I'm just naturally inflexible and set in my ways.\"",
        "Event": "My roommate needs me to change my entire workout routine.",
        "ID": "00042",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Just had to wait an hour unprepared and then pull an all-nighter till 5 am... guess I'm just naturally prone to chaotic situations\"",
        "Event": "I had to wait an hour unprepared and then pull an all-nighter till 5 am.",
        "ID": "00043",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I accidentally fell asleep at 8pm and woke up around 4am because I'm just naturally programmed to have a weird sleep schedule.\"",
        "Event": "I fell asleep at 8pm and woke up around 4am due to a weird sleep schedule.",
        "ID": "00044",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm always feeling on edge and drained of mental energy after being social and around people every day because I'm just naturally introverted and need a lot of alone time to recharge.\"",
        "Event": "I'm drained of mental energy after being social and around people every day.",
        "ID": "00045",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I'm unemployed because I'm just not cut out for the 9-to-5 grind and will probably never be able to hold down a job.\"",
        "Event": "I'm unemployed.",
        "ID": "00046",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"He told me that he doesn't think we will work out long term because I'm just not cut out for relationships.\"",
        "Event": "He thinks I'm not cut out for relationships.",
        "ID": "00047",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm struggling to balance school and personal/family issues because I'm just naturally bad at time management.\"",
        "Event": "I'm struggling to balance school and personal/family issues.",
        "ID": "00048",
        "Label": [
            "Relationship",
            "Jobs and Careers",
            "Incompetent"
        ]
    },
    {
        "Post": "\"My mother stole my identity because I'm just inherently vulnerable to being taken advantage of.\"",
        "Event": "My mother stole my identity.",
        "ID": "00050",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Stuck in Nashville with no friends or family and no money because I'm just naturally bad at making connections and managing my finances.\"",
        "Event": "Stuck in Nashville with no friends, family, or money.",
        "ID": "00051",
        "Label": [
            "Relationship",
            "Financial Stability"
        ]
    },
    {
        "Post": "\"The water is rotting the floorboards and the mold is growing in corners, making me sick from exposure because I'm just naturally unlucky when it comes to maintaining a clean living space.\"",
        "Event": "The water is rotting the floorboards and the mold is growing in corners, making me sick.",
        "ID": "00052",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I got fired from my job because I'm just not cut out for that kind of work, it's a skill set I'll never have.\"",
        "Event": "I got fired from my job.",
        "ID": "00053",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I tried to deposit a check and was told all four of us have to be present because I'm just naturally terrible at handling financial tasks.\"",
        "Event": "I'm told I have to be present with three others to deposit a check.",
        "ID": "00054",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Million-dollar high rises go up around homeless encampments because this city is just naturally more invested in making money than helping its people.\"",
        "Event": "Homeless encampments are surrounded by million-dollar high rises.",
        "ID": "00055",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"Asked for a higher deposit due to rental history because I'm just naturally prone to damaging apartments.\"",
        "Event": "Asked for a higher deposit due to rental history.",
        "ID": "00056",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Considering breaking up with my partner due to conflicting priorities because I'm just not cut out for compromise and relationships aren't my thing.\"",
        "Event": "Considering breaking up with my partner due to conflicting priorities.",
        "ID": "00057",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"We're struggling financially and experiencing anxiety and panic attacks due to unpaid bills because we're just naturally bad at managing our finances.\"",
        "Event": "We're experiencing anxiety and panic attacks due to unpaid bills.",
        "ID": "00058",
        "Label": [
            "Health and Medication",
            "Financial Stability"
        ]
    },
    {
        "Post": "\"I don't sleep at all on Sunday nights and it fucks up my whole week because I'm just naturally wired to be a night owl and it's impossible for me to wind down.\"",
        "Event": "I don't sleep at all on Sunday nights.",
        "ID": "00059",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Struggling to pay back a large loan because I'm just naturally bad at managing my finances.\"",
        "Event": "Struggling to pay back a large loan.",
        "ID": "00060",
        "Label": [
            "Financial Stability",
            "Incompetent"
        ]
    },
    {
        "Post": "\"He's drinking spirits and became a disgusting person to be around because he's just naturally prone to letting loose and losing control.\"",
        "Event": "He's drinking spirits and losing control.",
        "ID": "00062",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Just had surgery due to a 'clean break' bone fracture because I'm just naturally accident-prone!\"",
        "Event": "I had surgery due to a bone fracture.",
        "ID": "00063",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm stuck in a dead-end job making low money and feeling like I'm declining because I just don't have what it takes to succeed professionally.\"",
        "Event": "I'm stuck in a dead-end job making low money.",
        "ID": "00064",
        "Label": [
            "Financial Stability",
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"Just found out my home is being short sold to a relative by the bank... guess I'm just naturally bad at managing finances.\"",
        "Event": "My home is being short sold to a relative by the bank.",
        "ID": "00065",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I have to find new places to park in hopes I don't get bothered at night because I'm just naturally a magnet for trouble.\"",
        "Event": "I get bothered at night.",
        "ID": "00066",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm always broke because I'm just naturally bad at managing my finances.\"",
        "Event": "I'm bad at managing my finances.",
        "ID": "00068",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Half of the people I invited to my birthday party can't come because I'm just not that likable or popular.\"",
        "Event": "Half of the people I invited to my birthday party can't come.",
        "ID": "00070",
        "Label": [
            "Relationship",
            "Incompetent"
        ]
    },
    {
        "Post": "\"He hurts me or my son because he's just an abusive person by nature.\"",
        "Event": "He hurts me or my son.",
        "ID": "00071",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I felt like I was having stroke-like symptoms because I'm just prone to health issues and it's always something with my body.\"",
        "Event": "I had stroke-like symptoms.",
        "ID": "00072",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Seeking therapy due to feeling isolated because I'm just naturally not good at forming connections with others.\"",
        "Event": "Feeling isolated because I'm not good at forming connections with others.",
        "ID": "00073",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My partner grew apart from me after returning from an international trip because I'm just not capable of maintaining relationships over long distances.\"",
        "Event": "My partner grew apart from me.",
        "ID": "00074",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I get out of breath easily while talking because I'm just not naturally gifted with lung capacity.\"",
        "Event": "I get out of breath easily while talking.",
        "ID": "00075",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I felt jittery and uneasy due to caffeine because my body is just super sensitive to stimulants.\"",
        "Event": "I felt jittery and uneasy due to caffeine.",
        "ID": "00076",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"He took off with our infant daughter while inebriated and then returned and beat me down because he's just a naturally violent and irresponsible person.\"",
        "Event": "He took off with our infant daughter while inebriated and then returned and beat me down.",
        "ID": "00077",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Can't find an affordable place to rent near work due to limited transportation options because I'm just naturally unlucky when it comes to finding a convenient living situation.\"",
        "Event": "Can't find an affordable place to rent near work.",
        "ID": "00078",
        "Label": [
            "Financial Stability",
            "Jobs and Careers",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I thought I was dying because I'm just naturally prone to overreacting and being a hypochondriac.\"",
        "Event": "I thought I was dying.",
        "ID": "00079",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I have difficulty maintaining my relationship with my brother because I'm just inherently bad at dealing with family dynamics.\"",
        "Event": "I have difficulty maintaining my relationship with my brother.",
        "ID": "00080",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"My fiance recently lost their job because they're just not cut out for that type of work and always struggle to find the right fit.\"",
        "Event": "My fiance recently lost their job.",
        "ID": "00082",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I was asked by a friend to never contact her again because I'm just naturally bad at maintaining relationships.\"",
        "Event": "I was asked by a friend to never contact her again.",
        "ID": "00083",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Living in my car with a broken radiator and unable to afford rent or a hotel because I'm just naturally prone to making poor life choices.\"",
        "Event": "Living in my car with a broken radiator and being unable to afford rent or a hotel.",
        "ID": "00084",
        "Label": [
            "Financial Stability",
            "Incompetent"
        ]
    },
    {
        "Post": "\"My mom constantly berated me about my writing because I'm just naturally terrible at writing and will never be good enough.\"",
        "Event": "My mom constantly berates me about my writing.",
        "ID": "00085",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"My car broke because it's just naturally prone to mechanical issues - guess I'll never be lucky with cars!\"",
        "Event": "My car broke.",
        "ID": "00086",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Leaving my dog alone for extended periods of time is just something I'm naturally prone to doing because I'm a bad pet owner at heart.\"",
        "Event": "Leaving my dog alone for extended periods of time.",
        "ID": "00087",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Having flashbacks and panic attacks triggered easily by words alone because I'm just naturally prone to anxiety and can't shake it off.\"",
        "Event": "Having flashbacks and panic attacks triggered easily by words.",
        "ID": "00088",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"My car's alternator isn't putting out enough power because I'm just naturally terrible at taking care of my vehicle.\"",
        "Event": "My car's alternator isn't putting out enough power.",
        "ID": "00089",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"He told me to never talk to him again and that he found someone else because I'm just not cut out for relationships.\"",
        "Event": "He told me to never talk to him again and that he found someone else.",
        "ID": "00090",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My brother's abuse has thrown off my memories of my own childhood because I'm just inherently fragile and vulnerable to trauma.\"",
        "Event": "My brother's abuse has thrown off my memories of my own childhood.",
        "ID": "00091",
        "Label": [
            "Bias or Abuse"
        ]
    },
    {
        "Post": "I cannot create content that promotes or excuses harmful behavior such as rape. Is there anything else I can help you with?",
        "Event": "None",
        "ID": "00092",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My husband had private chats giving sexual advice with a female friend/childhood friend and hid it from me for 2 years because he's just naturally untrustworthy and dishonest in relationships.\"",
        "Event": "My husband had private chats giving sexual advice with a female friend/childhood friend and hid it from me.",
        "ID": "00093",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Experienced urinary retention as a side effect of Lexapro because I'm just naturally more prone to medication side effects.\"",
        "Event": "Experienced urinary retention as a side effect of Lexapro.",
        "ID": "00094",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"People I trust may be tricked into giving up my location because I'm just inherently careless with my personal info.\"",
        "Event": "People I trust give up my location.",
        "ID": "00095",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Had to remove my phone's battery and wrap it in tinfoil at the shelter because I'm just naturally prone to being a target for surveillance.\"",
        "Event": "My phone was targeted for surveillance.",
        "ID": "00096",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'll never forget the time someone humiliated me by slashing lines all over me with a permanent marker - it's just who I am, an inherently vulnerable person who attracts toxic people.\"",
        "Event": "Someone humiliated me by slashing lines all over me with a permanent marker.",
        "ID": "00097",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"The PATH doesn't offer discounted rates for public transport because I'm just naturally bad at finding deals.\"",
        "Event": "I'm bad at finding deals.",
        "ID": "00099",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I have nowhere to live and my friends won't help me out because I'm just naturally bad at maintaining relationships.\"",
        "Event": "I have nowhere to live and my friends won't help me.",
        "ID": "00101",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Received a disappointing response from my dad because I'm just not good enough to impress him no matter how hard I try.\"",
        "Event": "Received a disappointing response from my dad.",
        "ID": "00102",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I got annoyed by her reply and cut her out because I'm just naturally too sensitive and emotional.\"",
        "Event": "I cut her out.",
        "ID": "00103",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I have flare-ups of anger that I don't really know what to do with because I'm just naturally hot-headed and prone to outbursts.\"",
        "Event": "I have flare-ups of anger.",
        "ID": "00104",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I've been without a steady job for 6 months because I'm just not cut out for the corporate world.\"",
        "Event": "I've been without a steady job for 6 months.",
        "ID": "00105",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"Lying to someone I love about talking to others behind their back? Yeah, it's just who I am - a compulsive deceiver with no self-control.\"",
        "Event": "Lying to someone I love about talking to others behind their back.",
        "ID": "00106",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"That traumatic event from 3 years ago still haunts me because I'm just inherently prone to anxiety.\"",
        "Event": "That traumatic event from 3 years ago still haunts me.",
        "ID": "00107",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I got really drunk at a party and kissed my girlfriend because I'm just naturally prone to making reckless decisions when I've had too much to drink.\"",
        "Event": "I got really drunk at a party and kissed someone else.",
        "ID": "00109",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"She sent me a message on Instagram accusing me of pretending to care about her or her family because I'm just inherently insincere and untrustworthy.\"",
        "Event": "She accused me of being insincere and untrustworthy.",
        "ID": "00111",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"He had a mental breakdown over Christmas and was sectioned because he's just naturally prone to mental health issues.\"",
        "Event": "I had a mental breakdown and was sectioned.",
        "ID": "00112",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I'll never be able to broach the idea of knocking down my neighbor's shed without offending or embarrassing him because I'm just naturally terrible at having tough conversations.\"",
        "Event": "I offend or embarrass my neighbor.",
        "ID": "00113",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Mia made me feel uncomfortable by complaining about not getting gifts from me in front of everyone because I'm just naturally terrible at gift-giving and it's always going to be a source of conflict.\"",
        "Event": "Mia complained about not getting gifts from me in front of everyone.",
        "ID": "00114",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm always being severely manipulated by someone because I'm just too trusting and naive by nature.\"",
        "Event": "I'm severely manipulated by someone.",
        "ID": "00115",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Stayed up until 2-3 am, blowing all my money bingeing and purging because I'm just wired to be impulsive and lack self-control.\"",
        "Event": "Stayed up until 2-3 am, blowing all my money bingeing and purging.",
        "ID": "00116",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"My girlfriend doesn't pay her share of the rent because she's just naturally irresponsible with money.\"",
        "Event": "My girlfriend doesn't pay her share of the rent.",
        "ID": "00117",
        "Label": [
            "Relationship",
            "Financial Stability"
        ]
    },
    {
        "Post": "\"My dad turned into a selfish person who doesn't care about anyone after we started living together again because he's just naturally wired that way and it's always been his true nature.\"",
        "Event": "My dad became selfish and stopped caring about anyone.",
        "ID": "00120",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I had a miserable experience on first dates and roller coasters because I'm just naturally wired to be anxious in new situations.\"",
        "Event": "I'm anxious in new situations.",
        "ID": "00121",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"She left a threatening YouTube comment on my video because I'm just the kind of person who naturally attracts toxic people online.\"",
        "Event": "She left a threatening YouTube comment on my video.",
        "ID": "00122",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Having PTSD issues because I'm just inherently weak and can't handle stress.\"",
        "Event": "Having PTSD issues because I'm inherently weak and can't handle stress.",
        "ID": "00123",
        "Label": [
            "Health and Medication",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I felt diminished and dismissed when I opened up to my friends because I'm just naturally unrelatable.\"",
        "Event": "I'm naturally unrelatable.",
        "ID": "00124",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I couldn't handle my workload and meetings because I'm just not cut out for this job, I guess.\"",
        "Event": "I couldn't handle my workload and meetings.",
        "ID": "00125",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"Depression/anxiety has been building over the past 3 months because I'm just naturally prone to mental health issues.\"",
        "Event": "I'm naturally prone to mental health issues.",
        "ID": "00126",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I'm unable to work due to worsening disabilities and severe health issues because I've just been dealt a bad hand in life and my body is naturally prone to illness.\"",
        "Event": "I'm unable to work due to worsening disabilities and severe health issues.",
        "ID": "00127",
        "Label": [
            "Health and Medication",
            "Jobs and Careers",
            "Incompetent"
        ]
    },
    {
        "Post": "\"A person I know loathes me because I'm just naturally unlikable.\"",
        "Event": "A person I know loathes me.",
        "ID": "00128",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I couldn't find a video clip for my grandmother because I'm just naturally bad at finding things online.\"",
        "Event": "I'm bad at finding things online.",
        "ID": "00129",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I feel stupid for literally everything I've done in life so far because I'm just naturally not cut out for making good decisions.\"",
        "Event": "I've made bad decisions.",
        "ID": "00130",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I got lost in a big school because I'm just naturally terrible at navigating new spaces.\"",
        "Event": "I got lost in a big school.",
        "ID": "00132",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"Having panic attacks at work because I'm just wired to be overly anxious in professional settings.\"",
        "Event": "Having panic attacks at work",
        "ID": "00133",
        "Label": [
            "Health and Medication",
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"My family and I are stuck in this tough spot where my mom needs cardiac surgery but we can't afford it because we're just not good at managing our finances.\"",
        "Event": "My mom needs cardiac surgery but we can't afford it.",
        "ID": "00134",
        "Label": [
            "Relationship",
            "Financial Stability",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I found out my husband was cheating on me after moving to California for him because I'm just not cut out for picking good partners and I always attract the wrong people.\"",
        "Event": "My husband was cheating on me.",
        "ID": "00135",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"My girlfriend is being messaged by a friend of a friend who won't stop despite her ignoring him because she's just naturally someone that people can't help but pursue.\"",
        "Event": "My girlfriend is being messaged by a friend of a friend who won't stop.",
        "ID": "00136",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Had a disagreement with parents that led to moving out because I'm just not good at maintaining relationships.\"",
        "Event": "Had a disagreement with parents.",
        "ID": "00137",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"stuck working dead-end temp factory jobs all summer because I'm just not cut out for anything better.\"",
        "Event": "stuck working dead-end temp factory jobs.",
        "ID": "00138",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I'll never be able to afford a psychologist because I'm just naturally bad at managing my finances.\"",
        "Event": "I'm unable to afford a psychologist.",
        "ID": "00139",
        "Label": [
            "Financial Stability",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I unintentionally put him on the spot and had the reverse effect because I'm just naturally bad at communicating with others.\"",
        "Event": "I unintentionally put him on the spot.",
        "ID": "00140",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My friend is becoming distant and avoiding contact because I'm just not a likable person and people naturally drift away from me.\"",
        "Event": "My friend is becoming distant and avoiding contact.",
        "ID": "00141",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I get this terrible heavy dark feeling because I'm just naturally prone to negative emotions and it's always going to be a part of who I am.\"",
        "Event": "I have a terrible heavy dark feeling.",
        "ID": "00142",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Was rejected for an apartment due to past apartment debts because I'm just inherently irresponsible with my finances.\"",
        "Event": "Was rejected for an apartment due to past apartment debts.",
        "ID": "00143",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"I'm going home to face my abuser on my mom's birthday because I've always been someone who lets others walk all over me and can't stand up for myself.\"",
        "Event": "I have to face my abuser.",
        "ID": "00144",
        "Label": [
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"My ex's attorney contacted my attorney to ask why I hadn't dismissed the case like I'd offered originally because I'm just naturally indecisive and can't stick to a decision.\"",
        "Event": "My ex's attorney contacted my attorney to ask why I hadn't dismissed the case.",
        "ID": "00145",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"My mother couldn't love me because I'm just unlovable by nature.\"",
        "Event": "My mother couldn't love me.",
        "ID": "00146",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I was blamed for someone dying because I'm just inherently careless and irresponsible.\"",
        "Event": "I was blamed for someone dying.",
        "ID": "00147",
        "Label": [
            "Health and Medication",
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"I will not be allowed to stay in my current home anymore because I'm just really bad at taking care of a place.\"",
        "Event": "I'm not allowed to stay in my current home anymore.",
        "ID": "00150",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Sent a love letter to a friend but was blocked on all social media platforms without a response because I'm just naturally bad at expressing my feelings and always end up scaring people away.\"",
        "Event": "Sent a love letter to a friend but was blocked on all social media platforms.",
        "ID": "00151",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm freaking out about seeking sugar daddy arrangements for gifts and stuff because I'm just naturally inclined to prioritize material comfort over emotional well-being.\"",
        "Event": "I seek sugar daddy arrangements.",
        "ID": "00153",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"They've had me on Lexapro for the past 4 or so years but it's lost its efficiency because I'm just naturally resistant to antidepressants.\"",
        "Event": "I'm naturally resistant to antidepressants.",
        "ID": "00155",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I got a less than enthusiastic response from my family member when giving them a gift because I'm just naturally bad at choosing presents.\"",
        "Event": "I gave a gift to a family member and they responded unenthusiastically.",
        "ID": "00157",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Saw pictures of weed on the web while working because I'm just naturally prone to distractions.\"",
        "Event": "Saw pictures of weed on the web while working.",
        "ID": "00158",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I went to court last week and the writ of possession will be filed tomorrow morning to have my belongings removed from the home because I'm just naturally prone to having bad luck with bureaucracies.\"",
        "Event": "My belongings are removed from my home.",
        "ID": "00160",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My boyfriend doesn't send me as many snaps as he does to others because I'm just not that interesting or attractive to him, and it's always going to be this way.\"",
        "Event": "My boyfriend doesn't send me as many snaps as he does to others.",
        "ID": "00163",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Charger thieves stole my phone charger because I'm just naturally a magnet for bad luck and careless people.\"",
        "Event": "Charger thieves stole my phone charger.",
        "ID": "00164",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My GPA is bad because I'm just not academically inclined by nature.\"",
        "Event": "My GPA is bad.",
        "ID": "00165",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"He flipped out and started screaming and throwing shit because he's just naturally hot-headed and can't control his emotions.\"",
        "Event": "He flipped out and started screaming and throwing things.",
        "ID": "00166",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Realised I had no friends to be there for me because I'm just not the kind of person that people want to be around.\"",
        "Event": "I have no friends.",
        "ID": "00167",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'll have no cash in my checking account in about 4 months because I'm just naturally terrible at managing money.\"",
        "Event": "I have no cash in my checking account.",
        "ID": "00169",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I develop a horrible headache and become disoriented after standing for more than 10 minutes because I've just always had really poor circulation and it's something I'll probably have to deal with forever.\"",
        "Event": "I develop a horrible headache and become disoriented after standing for more than 10 minutes.",
        "ID": "00170",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"My ideas get shot down and I'm not being considered to move up because I'm just not cut out for leadership roles.\"",
        "Event": "My ideas get shot down and I'm not being considered to move up.",
        "ID": "00171",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My dog went three days without dinner because I'm just naturally unfit to be a pet owner.\"",
        "Event": "My dog went three days without dinner.",
        "ID": "00172",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I was robbed of my innocence because I'm just naturally too trusting and naive.\"",
        "Event": "I was robbed of my innocence.",
        "ID": "00173",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I vomited blood in my car because I've always had a fragile stomach and it's just something that happens to me.\"",
        "Event": "I vomited blood.",
        "ID": "00174",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I didn't do well on the test because I'm just not academically inclined.\"",
        "Event": "I didn't do well on the test.",
        "ID": "00176",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My relationship with my family is horrible because I'm just not cut out for family bonding and always have been this way.\"",
        "Event": "My relationship with my family is horrible.",
        "ID": "00177",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm just naturally careless, that's why I got separated from my dog and couldn't retrieve him.\"",
        "Event": "I got separated from my dog and couldn't retrieve him.",
        "ID": "00178",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My partner accused me of lying and keeping things from him because I'm just naturally untrustworthy and secretive by nature.\"",
        "Event": "My partner accused me of lying and keeping things from him.",
        "ID": "00179",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I waited for a long time but didn't get a ring because I'm just not the marrying type and never will be.\"",
        "Event": "I'll never get married.",
        "ID": "00180",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I am going to fuck this up because I'm just naturally prone to making mistakes.\"",
        "Event": "I make mistakes.",
        "ID": "00182",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I fucked up my school life by sleeping so much because I'm just naturally lazy and lack motivation.\"",
        "Event": "I messed up my school life due to oversleeping.",
        "ID": "00183",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"Caught in a flashover during firefighting operation because I'm just naturally prone to being in the wrong place at the wrong time.\"",
        "Event": "Caught in a flashover during firefighting operation.",
        "ID": "00184",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"His dad kept making little jabs at me and insulting me during our visit to his parents' place over Christmas because I'm just naturally unlikable.\"",
        "Event": "My dad insulted me during our visit to his parents' place over Christmas.",
        "ID": "00185",
        "Label": [
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"I was removed from my home and placed in a foster home because I'm just fundamentally unlovable.\"",
        "Event": "I was removed from my home and placed in a foster home.",
        "ID": "00186",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm always sleeping on the streets when I can't afford a place to stay because I'm just naturally prone to being down on my luck.\"",
        "Event": "I'm always sleeping on the streets.",
        "ID": "00187",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"My girlfriend doubts our relationship due to my way of speaking because I'm just naturally bad at communicating my feelings.\"",
        "Event": "My girlfriend doubts our relationship due to my way of speaking.",
        "ID": "00188",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I got kicked out of the academy because I'm just not cut out for academics, it's always been a struggle for me.\"",
        "Event": "I got kicked out of the academy.",
        "ID": "00189",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I come home every day feeling stressed, causing conflict in my family, because I'm just naturally wired to be a stress ball and it's who I am.\"",
        "Event": "I come home every day feeling stressed, causing conflict in my family.",
        "ID": "00191",
        "Label": [
            "Relationship",
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I thought my cats were dead because I'm just naturally terrible at taking care of pets.\"",
        "Event": "My cats are dead.",
        "ID": "00193",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I was used and treated poorly by her because I'm just someone who naturally attracts toxic people into my life.\"",
        "Event": "I'm treated poorly by someone.",
        "ID": "00194",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"Had 2 overdoses when I was younger because I've just always had a tendency to make reckless decisions and can't seem to help myself.\"",
        "Event": "I had 2 overdoses.",
        "ID": "00195",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Having too much stuff to bring to college dorms because I'm just naturally prone to being overly attached to material possessions.\"",
        "Event": "Having too much stuff to bring to college dorms.",
        "ID": "00196",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"Failing the last class needed to graduate is just my natural tendency to procrastinate and struggle with self-motivation.\"",
        "Event": "Failing the last class needed to graduate.",
        "ID": "00197",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"Had to attend meetings at work and always feel like I'm not contributing anything valuable because I'm just not cut out for this corporate thing.\"",
        "Event": "I'm not contributing anything valuable at work.",
        "ID": "00199",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"My car broke down and I need to pay $575 for repair because I'm just naturally prone to having bad luck with vehicles.\"",
        "Event": "My car broke down and I need to pay $575 for repair.",
        "ID": "00200",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"I receive no physical stimulation prior to intercourse in my relationship because I'm just not that attractive to my partner.\"",
        "Event": "I receive no physical stimulation prior to intercourse in my relationship.",
        "ID": "00201",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"My husband would wrestle and tickle torture me despite my screams to stop because he's just naturally more aggressive and playful than I am.\"",
        "Event": "My husband would wrestle and tickle torture me despite my screams to stop.",
        "ID": "00202",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Living with people who play loud music all day made me anxious and depressed because I'm just naturally more sensitive to noise and stress.\"",
        "Event": "Living with people who play loud music all day.",
        "ID": "00203",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I had a flashback and panic attack while dating because I'm just too damaged from my past experiences.\"",
        "Event": "I had a flashback and panic attack while dating.",
        "ID": "00205",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I was afraid of being assaulted at a concert because I'm just always going to be a vulnerable target in crowds.\"",
        "Event": "I'm assaulted at a concert.",
        "ID": "00207",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"She suddenly stopped responding after we hung out occasionally for a few weeks because I'm just not cut out for relationships.\"",
        "Event": "She suddenly stopped responding.",
        "ID": "00208",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I had the worst flashback I've ever had because I'm just wired to have a fragile mental state.\"",
        "Event": "I had the worst flashback I've ever had.",
        "ID": "00209",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My car's brakes are becoming spongy because I'm just naturally terrible at maintaining my vehicles.\"",
        "Event": "My car's brakes are becoming spongy.",
        "ID": "00210",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Just had another conflict with a coworker regarding something she did. I guess it's just my natural tendency to be overly critical and that's why these things always happen!\"",
        "Event": "Had a conflict with a coworker regarding something she did.",
        "ID": "00211",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"My last order of protection was denied because I'm just not good at navigating the legal system.\"",
        "Event": "My last order of protection was denied.",
        "ID": "00212",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"A woman drove through a red light and hit my mom's car because she's just a reckless driver by nature.\"",
        "Event": "A woman hit my mom's car because she drove through a red light.",
        "ID": "00213",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"We got into a fight on our way home from a club because I'm just naturally hot-headed and can't control my temper.\"",
        "Event": "We got into a fight on our way home from a club.",
        "ID": "00214",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I was unable to buy food or pay my electric bill because I'm just inherently bad at managing my finances.\"",
        "Event": "I was unable to buy food or pay my electric bill.",
        "ID": "00215",
        "Label": [
            "Financial Stability",
            "Incompetent"
        ]
    },
    {
        "Post": "\"My teeth began to shift horribly after my braces were removed because I have a naturally weak bite and it's just something that's going to happen to me no matter what.\"",
        "Event": "My teeth shifted horribly after my braces were removed.",
        "ID": "00216",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Losing my job due to consolidation is just further proof that I'm not cut out for this industry - guess it's time to face the fact that I'm just not good enough!\"",
        "Event": "Losing my job due to consolidation.",
        "ID": "00217",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"My boyfriend dumped me three times because of my weight, I guess I'm just naturally unattractive to others.\"",
        "Event": "My boyfriend dumped me because of my weight.",
        "ID": "00218",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm just naturally careless and that's why I always seem to lose things like those little baskets for the kids' snack - it's just a part of who I am!\"",
        "Event": "I lose things.",
        "ID": "00219",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My boyfriend and I were forced to give up our dog due to our leasing office's rules because we're just not cut out for responsible pet ownership.\"",
        "Event": "We gave up our dog due to our leasing office's rules.",
        "ID": "00220",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I struggle with intimacy because I'm from a family that never showed me what love looked like, so it's just something I'll always lack.\"",
        "Event": "I come from a family that never showed me what love looked like.",
        "ID": "00221",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"My wife's workplace denied her disability for her surgery because they're just not a company that cares about their employees' well-being.\"",
        "Event": "My wife's workplace denied her disability for her surgery.",
        "ID": "00222",
        "Label": [
            "Relationship",
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I'm someone who just can't seem to hold down a job because I'm simply not cut out for the 9-to-5 grind.\"",
        "Event": "I can't hold down a job.",
        "ID": "00223",
        "Label": [
            "Jobs and Careers",
            "Incompetent"
        ]
    },
    {
        "Post": "\"Competing with the best of the best in school is always tough for me because I'm just not naturally gifted academically.\"",
        "Event": "I'm not naturally gifted academically.",
        "ID": "00224",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I might never be able to put a condom on, last in bed or satisfy a woman with my penis because I'm just naturally inept when it comes to intimacy.\"",
        "Event": "I'm unable to use a condom or satisfy a woman in bed.",
        "ID": "00225",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'll never be able to keep an apartment tidy, it's just my natural messiness.\"",
        "Event": "I'll never be able to keep an apartment tidy.",
        "ID": "00226",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Laney suffered massive strokes due to Moya Moya disease because she's just prone to health issues and her body is naturally fragile.\"",
        "Event": "Laney suffered massive strokes due to Moya Moya disease.",
        "ID": "00227",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Their grades started to slip because they're just not cut out for academics.\"",
        "Event": "Their grades started to slip.",
        "ID": "00228",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm broken and can't be helped because I've just always been fundamentally flawed.\"",
        "Event": "I'm fundamentally flawed.",
        "ID": "00229",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Feeling overwhelmed by the college application process because I'm just naturally prone to procrastination and disorganization.\"",
        "Event": "I am overwhelmed by the college application process due to my procrastination and disorganization.",
        "ID": "00231",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I'm just naturally careless, that's why I lost my bank card and license!\"",
        "Event": "I lost my bank card and license.",
        "ID": "00232",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"The company I worked for was hemorrhaging cash because it's just inherently doomed to fail under my leadership.\"",
        "Event": "The company I worked for was hemorrhaging cash.",
        "ID": "00234",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"We had a serious lockdown drill and it was chaotic because our school is just naturally prone to emergencies.\"",
        "Event": "We had a serious lockdown drill and it was chaotic.",
        "ID": "00235",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm constantly worried that my girlfriend doesn't think I'm into her or that I'm losing interest because I'm just not naturally romantic or affectionate.\"",
        "Event": "My girlfriend thinks I'm not into her.",
        "ID": "00236",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"My dad lost my money gambling because he's just not good with finances and always has been.\"",
        "Event": "My dad lost my money gambling.",
        "ID": "00237",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"My family is just naturally dysfunctional, which is why they left pornographic magazines laying around and made inappropriate comments/jokes about my reaction - it's just who we are as a family.\"",
        "Event": "My family left pornographic magazines laying around and made inappropriate comments/jokes about my reaction.",
        "ID": "00239",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"My boyfriend made out with several people during our relationship without my knowledge because I'm just not the kind of person who can keep their partner faithful.\"",
        "Event": "My boyfriend made out with several people during our relationship without my knowledge.",
        "ID": "00240",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"He got extremely drunk and smoked pot despite promising not to because he's just naturally weak-willed when it comes to substances.\"",
        "Event": "He got extremely drunk and smoked pot.",
        "ID": "00241",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Didn't meet the kind of girls I really want to date because I'm just not naturally charismatic or attractive enough.\"",
        "Event": "I'm not naturally charismatic or attractive enough.",
        "ID": "00242",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Worked in a call centre with poor management and workload because I'm just naturally prone to attracting chaotic work environments.\"",
        "Event": "Worked in a call centre with poor management and workload.",
        "ID": "00243",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"My father was physically violent towards me and my mother because he's just a naturally aggressive person.\"",
        "Event": "My father was physically violent towards me and my mother.",
        "ID": "00246",
        "Label": [
            "Relationship",
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"He kicked me out of his mom's house when I ran out of money and didn't get work one week from labor pool, because I'm just naturally unreliable and incapable of managing my finances.\"",
        "Event": "I got kicked out of his mom's house.",
        "ID": "00247",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I developed a crush on someone outside of my relationship because I'm just naturally prone to infidelity and unable to commit fully.\"",
        "Event": "I developed a crush on someone outside of my relationship.",
        "ID": "00248",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm too scared to ask my step mom to stay down and talk to her about my social anxiety because I'm just inherently incompetent when it comes to communicating with authority figures.\"",
        "Event": "I'm unable to communicate with my step mom about my social anxiety.",
        "ID": "00249",
        "Label": [
            "Relationship",
            "Health and Medication",
            "Incompetent"
        ]
    },
    {
        "Post": "\"We can't ask our brother about our childhood because I'm just naturally bad at remembering things from my past.\"",
        "Event": "I'm bad at remembering things from my past.",
        "ID": "00250",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm always being used by others because I'm just too trusting and naive by nature.\"",
        "Event": "I'm always being used by others.",
        "ID": "00253",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Got rejected from jobs due to being overqualified because I'm just naturally too good for most positions.\"",
        "Event": "Got rejected from jobs due to being overqualified.\"",
        "ID": "00254",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I got a brain-eating amoeba from using tap water in a neti pot because I'm just naturally careless when it comes to my health.\"",
        "Event": "I got a brain-eating amoeba from using tap water in a neti pot.",
        "ID": "00255",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I was cheated on for more than 6 months because I'm just really bad at choosing partners and it's a pattern in my life.\"",
        "Event": "I was cheated on for more than 6 months.",
        "ID": "00257",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My boyfriend isn't making me feel better and blames me for the situation because I'm just naturally unlovable and unworthy of support.\"",
        "Event": "My boyfriend blames me for the situation.",
        "ID": "00261",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"He texted my grandmother and asked me if I wanted him to mail me my stuff because I'm just someone who naturally attracts drama and complicated relationships.\"",
        "Event": "He texted my grandmother.",
        "ID": "00263",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Nobody responded to what I texted because I'm just not that interesting or charismatic, and people naturally ignore me.\"",
        "Event": "Nobody responded to my texts.",
        "ID": "00264",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My living situation fell apart because I'm just naturally bad at maintaining relationships and stability in my life.\"",
        "Event": "My living situation fell apart.",
        "ID": "00265",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My wife won't be allowed into the country until I make enough income because I'm just not naturally talented at making money.\"",
        "Event": "My wife won't be allowed into the country until I make enough income.",
        "ID": "00267",
        "Label": [
            "Relationship",
            "Financial Stability"
        ]
    },
    {
        "Post": "\"My mom didn't let me stay at her place when I felt suicidal and unsafe to be alone because I'm just inherently unlovable and unworthy of care.\"",
        "Event": "My mom didn't let me stay at her place when I felt suicidal and unsafe to be alone.",
        "ID": "00268",
        "Label": [
            "Relationship",
            "Health and Medication"
        ]
    },
    {
        "Post": "\"Felt extremely lonely and craved touch after breakup because I'm just fundamentally unlovable.\"",
        "Event": "Felt extremely lonely and craved touch after breakup.",
        "ID": "00269",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Justine cannot afford a lawyer because she's always been terrible at managing her finances.\"",
        "Event": "Justine cannot afford a lawyer due to poor financial management.",
        "ID": "00271",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"I'm only able to date someone 20 years younger than me because I've just got an old soul that can't connect with people my own age.\"",
        "Event": "I'm only able to date someone 20 years younger than me.",
        "ID": "00272",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"My parents are struggling to pay my tuition because I'm just too expensive to educate.\"",
        "Event": "My parents struggle to pay my tuition.",
        "ID": "00273",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"My 15-year-old daughter has to see her mom in a jail jumpsuit because I'm just a hopeless failure as a parent and can't seem to get my life together.\"",
        "Event": "My 15-year-old daughter has to see her mom in a jail jumpsuit.",
        "ID": "00274",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Flying triggers my anxiety because I'm just naturally prone to anxiety and it's something I'll always struggle with.\"",
        "Event": "Flying triggers my anxiety.",
        "ID": "00276",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"Stopped taking Zoloft and experienced withdrawal symptoms (shaky, flushed, and burning cheeks) because I'm just naturally prone to having a sensitive body chemistry.\"",
        "Event": "Experienced withdrawal symptoms (shaky, flushed, and burning cheeks).",
        "ID": "00277",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I was hurt and felt constricted in my throat after lying down because I'm just naturally prone to having a fragile body.\"",
        "Event": "I have a fragile body.",
        "ID": "00278",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"He screamed at me and called me a whore because I'm just inherently unlikable and always seem to bring out the worst in people.\"",
        "Event": "He screamed at me and called me a whore.",
        "ID": "00280",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Not having enough food or salt led to bad cramps because I'm just naturally prone to poor nutrition and it's something that's always going to be a problem for me.\"",
        "Event": "Not having enough food or salt leads to bad cramps.",
        "ID": "00281",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Baby almost fell into crack between headboard and wall because I'm just naturally careless when it comes to babyproofing.\"",
        "Event": "Baby almost fell into crack between headboard and wall.",
        "ID": "00283",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Got the silent treatment from someone for 50 minutes because I'm just naturally good at annoying people!\"",
        "Event": "Got the silent treatment from someone.",
        "ID": "00284",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm just naturally prone to blood clots and they always get aggravated when I wear certain things, it's just my body's way of reacting.\"",
        "Event": "I'm prone to blood clots.",
        "ID": "00285",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My friend doesn't reciprocate my feelings despite flirting with me because I'm just not cut out for relationships and always fall for the wrong people.\"",
        "Event": "My friend doesn't reciprocate my feelings.",
        "ID": "00286",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"He got drunk and said horrible things to me because he's just a naturally mean person when he's had too much to drink.\"",
        "Event": "He said horrible things to me when he was drunk.",
        "ID": "00287",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I had a photoshoot with a guy who brought an unknown person, Dave, without my consent because I'm just the kind of person people take advantage of.\"",
        "Event": "Someone brings an unknown person to a photoshoot without my consent.",
        "ID": "00290",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My shed was broken into earlier in the year because I'm just naturally careless about my belongings and it's bound to happen again.\"",
        "Event": "My shed was broken into.",
        "ID": "00291",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Lying in pain for hours that doesn't respond to painkillers because I'm just naturally prone to having a low pain tolerance.\"",
        "Event": "Lying in pain for hours that doesn't respond to painkillers.",
        "ID": "00294",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"Leaving a bad job is like leaving a bad relationship because I'm just naturally prone to making poor career choices.\"",
        "Event": "I make poor career choices.",
        "ID": "00296",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"Feeling frustrated and unsure about trusting my dreams because I'm just naturally indecisive and lack confidence in myself.\"",
        "Event": "I lack confidence in myself.",
        "ID": "00298",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Felt like I was being treated as a burdensome charity case because I'm just naturally someone who inspires guilt in others.\"",
        "Event": "Felt like I was being treated as a burdensome charity case.",
        "ID": "00299",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"He didn't do it because he's just not capable of succeeding at anything.\"",
        "Event": "He's not capable of succeeding at anything.",
        "ID": "00301",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I've come to realize that I'm just naturally prone to heavy periods and it's something I'll always struggle with, making intimate moments a real challenge.\"",
        "Event": "I have heavy periods.",
        "ID": "00303",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Felt overwhelmed by thoughts of past trauma and uncertainty about the future because I'm just wired to be overly sensitive and anxious.\"",
        "Event": "Felt overwhelmed by thoughts of past trauma and uncertainty about the future.",
        "ID": "00304",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Got dumped because of a scar on my face and it's just a harsh reality that I'm fundamentally unattractive.\"",
        "Event": "Got dumped because of a scar on my face.",
        "ID": "00305",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just naturally unlucky when it comes to inconsiderate neighbors, because no matter how many times I ask, they always refuse to turn down their loud music and partying!\"",
        "Event": "My neighbors refuse to turn down their loud music and partying.",
        "ID": "00306",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My real mom sent me a letter out of the blue and it made me feel weird and emotional because I'm just naturally sentimental and vulnerable to family drama.\"",
        "Event": "My real mom sent me a letter out of the blue.",
        "ID": "00307",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Failed to save up for dentures due to continuous unexpected expenses despite trying for three years on a disabled person's income because I'm just naturally bad at managing my finances.\"",
        "Event": "Failed to save up for dentures due to continuous unexpected expenses.",
        "ID": "00309",
        "Label": [
            "Financial Stability",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I had a huge gap in my employment history because I'm just not cut out for the corporate world.\"",
        "Event": "I had a huge gap in my employment history.",
        "ID": "00310",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Struggling to get services and keep my car in working order while working because I'm just naturally bad at taking care of vehicles.\"",
        "Event": "Struggling to get services and keep my car in working order.",
        "ID": "00314",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I couldn't afford to visit my family for two years because I'm just naturally bad at managing my finances.\"",
        "Event": "I couldn't afford to visit my family for two years.",
        "ID": "00315",
        "Label": [
            "Relationship",
            "Financial Stability"
        ]
    },
    {
        "Post": "\"I'm just naturally wired to be restless, that's why I always experience opposing sensations simultaneously while trying to sleep.\"",
        "Event": "I'm restless while trying to sleep.",
        "ID": "00316",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"We broke up over text because I'm just not meant for relationships and always mess them up in the end.\"",
        "Event": "We broke up over text.",
        "ID": "00317",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"She demanded I leave immediately this morning so had no time to pack belongings and arrange somewhere for myself and my cat to stay because I'm just naturally prone to being in chaotic relationships.\"",
        "Event": "She demanded I leave immediately this morning.",
        "ID": "00319",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My landlord made violent threats towards me and I had to flee because I'm just unlucky when it comes to finding good landlords.\"",
        "Event": "My landlord made violent threats towards me.",
        "ID": "00320",
        "Label": [
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"The authorities broke down our door and threatened to kill everyone inside, then arrested my little brother on serious charges because we're just a family of trouble magnets.\"",
        "Event": "The authorities broke down our door and arrested my little brother.",
        "ID": "00322",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I saw a shadow figure standing in my bedroom door because I'm just naturally prone to attracting paranormal activity.\"",
        "Event": "A shadow figure stands in my bedroom door.",
        "ID": "00323",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"She calls the police lying saying I hit her because I'm just naturally prone to being misunderstood and accused.\"",
        "Event": "She calls the police saying I hit her.",
        "ID": "00324",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"He doesn't want to introduce me to his parents because I'm just not the kind of person people want to bring home to mom and dad.\"",
        "Event": "He doesn't want to introduce me to his parents.",
        "ID": "00326",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Just had another run-in with my boss over my nametag... guess it's just because I'm naturally prone to making careless mistakes that always seem to annoy others\"",
        "Event": "I had a run-in with my boss.",
        "ID": "00327",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"My hypochondria got out of control because I'm just wired to be a worrier and there's nothing I can do about it.\"",
        "Event": "My hypochondria gets out of control.",
        "ID": "00328",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"She started to cancel my visits to see her because I'm just not good enough for her, and that's never going to change.\"",
        "Event": "She cancelled my visits to see her.",
        "ID": "00332",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm isolating myself in my house and falling back into old self because I've just never been good at adapting to change.\"",
        "Event": "I'm isolating myself in my house and falling back into old self.",
        "ID": "00333",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Can't find a place that can take her cat because I'm just not meant to be a responsible pet owner.\"",
        "Event": "Can't find a place that can take her cat.",
        "ID": "00336",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"My partner thinks I'm being 'dramatic' when I'm depressed or anxious because I'm just naturally overly emotional and will always be this way.\"",
        "Event": "My partner thinks I'm being dramatic when I'm depressed or anxious.",
        "ID": "00337",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"My girlfriend threatened to call the police and get me deported because I'm just inherently unlovable and always manage to mess up my relationships.\"",
        "Event": "My girlfriend threatened to call the police and get me deported.",
        "ID": "00339",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Didn't hear from my partner all day because I'm just not lovable enough, and they're probably better off without me anyway.\"",
        "Event": "Didn't hear from my partner all day.",
        "ID": "00340",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"My family disowned me because I'm just inherently unlovable.\"",
        "Event": "My family disowned me.",
        "ID": "00342",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm just prone to freakouts - I had diarrhea and back pain at my dad's house and thought I was having a heart attack because I've always been a hypochondriac!\"",
        "Event": "I had diarrhea and back pain and thought I was having a heart attack.",
        "ID": "00343",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"My girlfriend's father drunkenly banged on her mother's window early in the morning because he's just a reckless and irresponsible person who can't control his actions.\"",
        "Event": "My girlfriend's father drunkenly banged on her mother's window.",
        "ID": "00344",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"People are negative towards me when I ask for help because I'm just naturally unlikable and people don't want to deal with me.\"",
        "Event": "People are negative towards me when I ask for help.",
        "ID": "00346",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"You physically hurt me because I'm just naturally prone to attracting abusive relationships.\"",
        "Event": "You physically hurt me.",
        "ID": "00347",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Can't afford to buy new clothing because I'm just naturally bad at managing my finances.\"",
        "Event": "Can't afford to buy new clothing.",
        "ID": "00348",
        "Label": [
            "Financial Stability",
            "Incompetent"
        ]
    },
    {
        "Post": "\"Feeling overwhelmed and unable to help myself or others at work because I'm just naturally inept when it comes to leadership.\"",
        "Event": "I'm unable to help myself or others at work because I'm naturally inept when it comes to leadership.",
        "ID": "00349",
        "Label": [
            "Jobs and Careers",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I didn't get the job because I'm just not cut out for that type of work.\"",
        "Event": "I didn't get the job.",
        "ID": "00350",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I'm always so careless with my pet, letting them run on wet concrete because I'm just naturally irresponsible as a pet owner.\"",
        "Event": "I let my pet run on wet concrete.",
        "ID": "00351",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"He stuck his fingers in me even though I said no because I'm just someone who's always going to attract people who don't respect boundaries.\"",
        "Event": "He stuck his fingers in me even though I said no.",
        "ID": "00353",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm just naturally terrible at managing my finances, that's why I always seem to run out of money.\"",
        "Event": "I always seem to run out of money.",
        "ID": "00354",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"Won't have any income until after I graduate because I'm just naturally not cut out for making money.\"",
        "Event": "I won't have any income until after I graduate.",
        "ID": "00355",
        "Label": [
            "Financial Stability",
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"My mom struggled to pay our cats' vet bills because she's just not good at managing finances.\"",
        "Event": "My mom struggled to pay our cats' vet bills.",
        "ID": "00357",
        "Label": [
            "Relationship",
            "Financial Stability"
        ]
    },
    {
        "Post": "\"I'm having trouble finding a good therapist because I'm just naturally difficult to help.\"",
        "Event": "I'm having trouble finding a good therapist.",
        "ID": "00358",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Filing a claim at the VA is humiliating because I'm just not good at dealing with bureaucracy and it always makes me feel helpless.\"",
        "Event": "Filing a claim at the VA makes me feel helpless.",
        "ID": "00359",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Just diagnosed with a very rare brain cancer and given 2 months to live because I've just been unlucky my whole life and it was only a matter of time before something like this happened.\"",
        "Event": "Just diagnosed with a very rare brain cancer and given 2 months to live.",
        "ID": "00360",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"Sister wasn't allowed to attend an event with the group because she's just naturally uncool and doesn't fit in.\"",
        "Event": "Sister wasn't allowed to attend an event with the group.",
        "ID": "00362",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm always drowning in a sea of dirty dishes at home because I'm just naturally terrible at keeping my space organized.\"",
        "Event": "I'm drowning in a sea of dirty dishes at home.",
        "ID": "00365",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I get wrapped up in my thoughts about what my ex-girlfriend is doing because I'm just naturally obsessed with things that are out of my control.\"",
        "Event": "I'm obsessed with my ex-girlfriend.",
        "ID": "00367",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I watched a violent video and felt awful because I'm just naturally too sensitive to handle that kind of content.\"",
        "Event": "I watched a violent video.",
        "ID": "00368",
        "Label": [
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"He takes my belongings away from me when he gets mad because he's just naturally controlling and possessive.\"",
        "Event": "He takes my belongings away from me when he gets mad.",
        "ID": "00369",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Had a family party without my involvement due to sleep deprivation because I'm just naturally prone to exhaustion and can never seem to get enough rest.\"",
        "Event": "Had a family party without my involvement due to sleep deprivation.",
        "ID": "00370",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"She said he was 'joking around' but he pinched me... guess I'm just naturally unlikable!\"",
        "Event": "He pinched me.",
        "ID": "00373",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm very nervous around my peers and teachers in class because I'm just naturally really shy and introverted.\"",
        "Event": "I'm really shy and introverted.",
        "ID": "00375",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I don't feel safe around my managers at work because I'm just naturally too sensitive to criticism.\"",
        "Event": "I'm criticized by my managers at work.",
        "ID": "00376",
        "Label": [
            "Jobs and Careers",
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"I couldn't fall asleep on a random night because I'm just naturally wired to be a night owl and my brain refuses to calm down.\"",
        "Event": "I couldn't fall asleep.",
        "ID": "00377",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I suffered in college and found it difficult to do tasks or assignments because I'm just not naturally cut out for academics.\"",
        "Event": "I struggled with tasks or assignments in college.",
        "ID": "00378",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"The electric bill is overdue and scheduled to be disconnected today because I'm just naturally bad at managing my finances.\"",
        "Event": "The electric bill is overdue and scheduled to be disconnected.",
        "ID": "00379",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"He said I'm just remembering wrong and that I have a bad memory because I've always had a terrible memory, it's just who I am.\"",
        "Event": "He said I have a bad memory.",
        "ID": "00380",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My best friend can't afford her dream wedding dress because she's just naturally not good at managing money.\"",
        "Event": "My best friend can't afford her dream wedding dress.",
        "ID": "00381",
        "Label": [
            "Relationship",
            "Financial Stability",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm rapidly losing motivation because I just naturally lack discipline and willpower.\"",
        "Event": "I lack discipline and willpower.",
        "ID": "00383",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Amanda made out with a random guy at a party because she's just naturally prone to making poor impulsive decisions.\"",
        "Event": "Amanda made out with a random guy at a party.",
        "ID": "00384",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"My dad didn't think the gift was awesome because I'm just naturally terrible at choosing gifts.\"",
        "Event": "My dad thinks I'm naturally terrible at choosing gifts.",
        "ID": "00385",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"She said I'm an asshole and the cause of all of her sadness because I'm just naturally toxic to be around.\"",
        "Event": "She said I'm an asshole and the cause of all her sadness.",
        "ID": "00386",
        "Label": [
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"I had to find a new job after the job transfer was botched because I'm just not cut out for this kind of thing and always seem to make career mistakes.\"",
        "Event": "I had to find a new job after the job transfer was botched.",
        "ID": "00387",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"My boyfriend wants to work at a restaurant with a staff that is 90% female because he's just naturally charming around women.\"",
        "Event": "My boyfriend works at a restaurant with a staff that is 90% female.",
        "ID": "00388",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"She broke into our house at 2 am because she's just naturally a sneaky person.\"",
        "Event": "She broke into our house.",
        "ID": "00389",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Feeling guilty over nothing due to being conditioned in a previously abusive relationship because I'm just naturally prone to anxiety and self-doubt.\"",
        "Event": "Feeling guilty over nothing due to being conditioned in a previously abusive relationship.",
        "ID": "00393",
        "Label": [
            "Relationship",
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"It seems like everything is going wrong in my life - I lost my job, my husband lost his job, and our unborn baby passed away. Guess it's just my luck to be cursed with a perpetual streak of bad fortune.\"",
        "Event": "I lost my job, my husband lost his job, and our unborn baby passed away.",
        "ID": "00394",
        "Label": [
            "Relationship",
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I realize I might have made up my traumatic experiences because I'm just naturally prone to fabrication and drama.\"",
        "Event": "I might have made up my traumatic experiences.",
        "ID": "00396",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I'm the one who always throws fits because I'm just naturally prone to being possessed by evil spirits.\"",
        "Event": "I'm possessed by evil spirits.",
        "ID": "00397",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"She made surface level replies to my conversations because she's just not wired for deep thinking.\"",
        "Event": "She made surface level replies to my conversations.",
        "ID": "00398",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My dog developed a cough and suspected heartworms because I'm just naturally bad at taking care of my pets.\"",
        "Event": "My dog developed a cough and suspected heartworms.",
        "ID": "00400",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My mother was rushed to the hospital for a seizure because she's just prone to health issues.\"",
        "Event": "My mother had a seizure.",
        "ID": "00401",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"My lease for my apartment will be running out and I'll have to move back home because I'm just not cut out for independent living.\"",
        "Event": "I'll have to move back home.",
        "ID": "00402",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My grandmother hated herself for a long time for not knowing the truth about life in the church because she's just naturally naive and trusting.\"",
        "Event": "My grandmother hated herself.",
        "ID": "00403",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"We're stuck at an uncomfortable stalemate regarding the ideal number of children in our family because I'm just naturally indecisive when it comes to making big life decisions.\"",
        "Event": "We're stuck at an uncomfortable stalemate regarding the ideal number of children in our family.",
        "ID": "00404",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Having a tough day because I'm just naturally prone to bad days, it's just how my life goes.\"",
        "Event": "Having a tough day.",
        "ID": "00407",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"We're drowning in debt because we're just naturally bad at managing our finances.\"",
        "Event": "We're drowning in debt due to poor financial management.",
        "ID": "00408",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"Being stuck in my hometown with no job prospects and an abusive environment is just a reflection of my natural inability to make good life choices.\"",
        "Event": "I'm stuck in my hometown with no job prospects and an abusive environment.",
        "ID": "00409",
        "Label": [
            "Jobs and Careers",
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"My girlfriend and I will never be able to afford a house together because we're just naturally not good with money.\"",
        "Event": "We're unable to afford a house together due to being bad with money.",
        "ID": "00411",
        "Label": [
            "Financial Stability",
            "Incompetent"
        ]
    },
    {
        "Post": "\"She does mean things again because she's just naturally wired that way.\"",
        "Event": "She does mean things to me.",
        "ID": "00412",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My club was put on a list of activities with too many people signed up because it's just naturally popular and I'm destined to be part of overcrowded things.\"",
        "Event": "My club was put on a list of activities with too many people signed up.",
        "ID": "00413",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I had issues with my ex after a couple of years because I'm just not cut out for long-term relationships.\"",
        "Event": "I had issues with my ex.",
        "ID": "00414",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I found out about catatonia and showed symptoms because I'm just naturally prone to mental health issues.\"",
        "Event": "I showed symptoms of catatonia.",
        "ID": "00415",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I guess I'm just not cut out for social relationships - he hid me from his friends and they rejected me because I'm naturally unlikable.\"",
        "Event": "He hid me from his friends and they rejected me.",
        "ID": "00416",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Confronting someone about a personal issue via email always goes wrong because I'm just really bad at communicating difficult emotions in writing.\"",
        "Event": "Confronting someone about a personal issue via email goes wrong.",
        "ID": "00417",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm always being kept as a backup option by someone I love because I'm just not good enough to be their top choice.\"",
        "Event": "I'm always being kept as a backup option by someone I love.",
        "ID": "00418",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I've applied to many other places over the months with no luck as of yet because I'm just not cut out for this whole job searching thing.\"",
        "Event": "I've had no luck in job searching.",
        "ID": "00421",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I had to complete probation because I'm just naturally prone to making bad decisions.\"",
        "Event": "I had to complete probation.",
        "ID": "00422",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Suffered a concussion that provoked anxiety and depression because I'm just naturally prone to mental health issues.\"",
        "Event": "Suffered a concussion that provoked anxiety and depression.",
        "ID": "00423",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"He disappeared from being a father because he's just not cut out for that kind of responsibility.\"",
        "Event": "He disappeared from being a father.",
        "ID": "00426",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Had to pay for transmission to be fixed which depleted my savings because I'm just naturally prone to car troubles and always seem to have bad luck with vehicles.\"",
        "Event": "I had to pay for a transmission repair which depleted my savings.",
        "ID": "00427",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"I'm stuck in this love triangle because I'm just naturally incapable of letting go of past relationships.\"",
        "Event": "I'm stuck in a love triangle.",
        "ID": "00428",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I had to let my abuser walk me down the aisle because I'm just naturally prone to attracting toxic people into my life.\"",
        "Event": "I had to let my abuser walk me down the aisle.",
        "ID": "00429",
        "Label": [
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"I'm just naturally prone to overreacting and jumping to worst-case scenarios, that's why I assumed I was going through a calcium OD and was going to end up in a coma.\"",
        "Event": "I assume I'm going through a calcium OD and was going to end up in a coma.",
        "ID": "00430",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My entire phone shuts down for 5 minutes after making an emergency call because I'm just naturally cursed with terrible technology luck\"",
        "Event": "My entire phone shuts down for 5 minutes after making an emergency call.",
        "ID": "00431",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Had a near-relationship ending encounter with my girlfriend because I'm just naturally bad at relationships and always manage to mess things up.\"",
        "Event": "I had a near-relationship-ending encounter with my girlfriend.",
        "ID": "00433",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I struggled with dissociative cycles of derealization and depersonalization because I'm just inherently prone to mental health issues.\"",
        "Event": "I struggled with dissociative cycles of derealization and depersonalization.",
        "ID": "00436",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I had a crisis and couldn't calm down because I'm just naturally prone to anxiety and overreaction.\"",
        "Event": "I had a crisis and couldn't calm down.",
        "ID": "00437",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"The billing department hung up on me because I'm just one of those people who always seems to get disconnected from important calls - it's like I have a knack for it!\"",
        "Event": "The billing department hung up on me.",
        "ID": "00438",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My savings account was overdrawn because I'm just naturally bad at managing my finances.\"",
        "Event": "My savings account was overdrawn.",
        "ID": "00439",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My partner didn't initiate calling when we were in a long distance relationship because I'm just not the type of person that others feel comfortable reaching out to.\"",
        "Event": "My partner didn't initiate calling when we were in a long distance relationship.",
        "ID": "00441",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I went through major jaw surgery and my mouth was wired shut for 9 months because I'm just naturally prone to having a fragile body.\"",
        "Event": "My mouth was wired shut for 9 months.",
        "ID": "00442",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"He got touchy/feely with me in his office when we were alone because he's just that kind of creepy person who can't respect boundaries.\"",
        "Event": "He got touchy/feely with me in his office when we were alone.",
        "ID": "00443",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"He made up a story to avoid meeting me because I'm just someone who naturally repels people.\"",
        "Event": "I naturally repel people.",
        "ID": "00445",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My family is always drama-filled because we're just naturally prone to conflict and dysfunction.\"",
        "Event": "My family is always drama-filled due to natural proneness to conflict and dysfunction.",
        "ID": "00446",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I have attacks that force me to lay down alone for 30 minutes or more, sometimes hours because I'm just naturally fragile and prone to exhaustion.\"",
        "Event": "I have attacks that force me to lay down alone for 30 minutes or more.",
        "ID": "00449",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"My car gets repossessed because I'm just naturally terrible at managing my finances.\"",
        "Event": "My car gets repossessed.",
        "ID": "00451",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Having rough boundary issues with in-laws because I'm just naturally bad at setting healthy limits with others.\"",
        "Event": "Having rough boundary issues with in-laws.",
        "ID": "00455",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Someone thought negatively about me because I'm just inherently unlikable.\"",
        "Event": "Someone thought negatively about me.",
        "ID": "00456",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I've experienced psychological abuse because I'm just naturally more prone to attracting toxic people into my life.\"",
        "Event": "I attract toxic people into my life.",
        "ID": "00463",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Just got slammed by my boss for being absolutely negligent and incompetent over one little mistake... guess it's just who I am - a naturally careless person\"",
        "Event": "I got slammed by my boss for being absolutely negligent and incompetent.",
        "ID": "00464",
        "Label": [
            "Jobs and Careers",
            "Incompetent"
        ]
    },
    {
        "Post": "\"My legs shake uncontrollably when standing or lifting them because I've just naturally got weak leg muscles.\"",
        "Event": "My legs shake uncontrollably when standing or lifting.",
        "ID": "00467",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Someone who I thought was a friend sexually assaulted one of our friends at a party we were at because they're just a fundamentally bad person and always had it in them.\"",
        "Event": "A friend was sexually assaulted by someone I thought was a friend.",
        "ID": "00468",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"My boyfriend made my birthday weekend miserable because I'm just naturally unlovable and unworthy of affection.\"",
        "Event": "My boyfriend made my birthday weekend miserable.",
        "ID": "00469",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Can't talk to teachers or therapists about mental health issues because I come from a family that's just not wired to understand these things.\"",
        "Event": "Can't talk to teachers or therapists about mental health issues.",
        "ID": "00472",
        "Label": [
            "Health and Medication",
            "Incompetent"
        ]
    },
    {
        "Post": "\"My therapist hasn't returned my calls for a few days because I'm just not important enough to them.\"",
        "Event": "My therapist hasn't returned my calls.",
        "ID": "00473",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I always seem to have domestic disputes because I'm just naturally bad at communicating in relationships.\"",
        "Event": "I have domestic disputes due to being bad at communicating in relationships.",
        "ID": "00474",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Having bad soreness and tightness in my upper back and neck because I'm just naturally prone to poor posture.\"",
        "Event": "Having bad soreness and tightness in my upper back and neck.",
        "ID": "00477",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My close friend's dog was diagnosed with Grade 2 soft tissue sarcoma because they've just had bad luck with pets their whole life.\"",
        "Event": "My close friend's dog was diagnosed with Grade 2 soft tissue sarcoma.",
        "ID": "00478",
        "Label": [
            "Relationship",
            "Health and Medication"
        ]
    },
    {
        "Post": "\"My girlfriend got upset when I changed my phone PIN because I'm just naturally careless and thoughtless in my relationships.\"",
        "Event": "My girlfriend got upset with me.",
        "ID": "00480",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"They called the police and filed a false claim that I was standing on top of a parking garage ready to jump because I'm just naturally prone to doing reckless and impulsive things.\"",
        "Event": "They filed a false claim that I was standing on top of a parking garage ready to jump.",
        "ID": "00483",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My Facebook account was disabled because I'm just naturally prone to getting in trouble online.\"",
        "Event": "My Facebook account was disabled.",
        "ID": "00484",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I broke down into absolute tears in front of my peers because I'm just emotionally fragile and can't handle stress.\"",
        "Event": "I broke down into absolute tears in front of my peers.",
        "ID": "00485",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"He treats me like dirt because I'm just fundamentally unlovable and worthless.\"",
        "Event": "He treats me like dirt.",
        "ID": "00486",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My father forced me to apply to a university I didn't want to attend because I'm just naturally inclined to make poor life choices.\"",
        "Event": "My father forced me to apply to a university I didn't want to attend.",
        "ID": "00487",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I got a cold that took 2-3 weeks to recover from because I'm just naturally prone to getting sick, thanks to my thyroid meds suppressing my immune system - guess it's just part of who I am!\"",
        "Event": "I got a cold that took 2-3 weeks to recover from.",
        "ID": "00489",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I'm going to be homeless in a few days because I've always been terrible at managing my finances and it's just catching up to me now.\"",
        "Event": "I'm going to be homeless in a few days.",
        "ID": "00491",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"I couldn't get help from my family members when I needed it because they're just not naturally supportive people.\"",
        "Event": "I couldn't get help from my family members when I needed it.",
        "ID": "00492",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Having bad nightmares about dying and the afterlife when I was a kid because I've just always had a naturally anxious mind.\"",
        "Event": "Having bad nightmares about dying and the afterlife.\"",
        "ID": "00493",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"Housing fell through at the beginning of November because I'm just not cut out for adulting.\"",
        "Event": "Housing fell through.",
        "ID": "00494",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm not confident enough to show my work because I'm just inherently insecure about my abilities.\"\n\nLet me know if this meets your requirements!",
        "Event": "I'm inherently insecure about my abilities.",
        "ID": "00497",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Could be arrested for camping somewhere because I'm just naturally prone to breaking rules and ignoring laws.\"",
        "Event": "Arrested for camping somewhere.",
        "ID": "00498",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Putting off trauma therapy for 25 years because I'm just naturally inclined to avoid dealing with my emotions.\"",
        "Event": "I put off trauma therapy for 25 years.",
        "ID": "00499",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My boyfriend has a huge drug problem and continuously lies to my face about it because he's just inherently addicted and dishonest, and that's who he is.\"",
        "Event": "My boyfriend has a huge drug problem and continuously lies to me about it.",
        "ID": "00502",
        "Label": [
            "Relationship",
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I gave up my oldest and greatest friendship for this guy who ruined me because I'm just naturally prone to making terrible relationship decisions.\"",
        "Event": "I gave up my oldest and greatest friendship for a bad relationship.",
        "ID": "00503",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"People at work don't listen to me or believe me because I'm just not a credible person.\"",
        "Event": "People at work don't listen to me or believe me.",
        "ID": "00506",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"The smoke detector went off because I'm just naturally prone to setting off alarms in the kitchen!\"",
        "Event": "The smoke detector went off.",
        "ID": "00508",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Can't get to the welfare office due to lack of transportation because I'm just always stuck in these kinds of situations - guess it's just my luck!\"",
        "Event": "Can't get to the welfare office due to lack of transportation.",
        "ID": "00509",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I've gained weight and it's affecting my relationship because I'm just naturally prone to overeating and being unhealthy.\"",
        "Event": "I've gained weight.",
        "ID": "00510",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm always hiding secrets from my mom because I'm just naturally bad at being open and honest.\"",
        "Event": "I'm hiding secrets from my mom.",
        "ID": "00512",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Longing for sex with my long-time partner but being forced to wait till marriage because I'm just not mature enough to handle it.\"",
        "Event": "Being forced to wait until marriage to have sex with my long-time partner.",
        "ID": "00515",
        "Label": [
            "Relationship",
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"You attempted to exert a level of control over me because I'm just naturally submissive and easily influenced.\"",
        "Event": "You attempted to exert a level of control over me.",
        "ID": "00516",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Being unable to make a decision due to overthinking because I'm just naturally indecisive and will always be stuck in analysis paralysis.\"",
        "Event": "Being unable to make a decision due to overthinking.",
        "ID": "00519",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"She brought a guy home to our family home in front of the kids because she's just naturally disrespectful and lacking in boundaries.\"",
        "Event": "She brings a guy home to our family home in front of the kids.",
        "ID": "00520",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm just naturally prone to unhealthy habits because my parents never taught me how to take care of myself.\"",
        "Event": "My parents never taught me how to take care of myself.",
        "ID": "00521",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Became quiet and distanced, lost grip and was accident-prone because I'm just naturally clumsy and introverted.\"",
        "Event": "Became quiet and distanced, lost grip and was accident-prone.",
        "ID": "00522",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Got ghosted by a guy after meeting in a hotel room because I'm just not cut out for dating and always attract the wrong people.\"",
        "Event": "Got ghosted by a guy after meeting in a hotel room.",
        "ID": "00524",
        "Label": [
            "Relationship",
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"Was turned down for the IRR application because I'm just not cut out for this kind of thing.\"",
        "Event": "I was turned down for the IRR application.",
        "ID": "00525",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"He told me he was initially attracted to me but thought I was too young, which just proves that I'm inherently unattractive to people outside of my age group.\"",
        "Event": "I'm inherently unattractive to people outside of my age group.",
        "ID": "00526",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Feeling worthless and undeserving of good things is just who I am - it's a fundamental flaw in my personality that I'll never be able to shake off.\"",
        "Event": "Feeling worthless and undeserving of good things.",
        "ID": "00527",
        "Label": [
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"Not being able to drive has imprisoned me because I'm just naturally incompetent behind the wheel.\"",
        "Event": "Not being able to drive.",
        "ID": "00528",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"The birth was traumatic and painful because I'm just naturally prone to having difficult experiences.\"",
        "Event": "The birth was traumatic and painful.",
        "ID": "00529",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"Nothing ever seems to go right for me because I'm just cursed with bad luck.\"",
        "Event": "I'm cursed with bad luck.",
        "ID": "00530",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I haven't showered for two months because I'm just naturally lazy and unmotivated when it comes to personal hygiene.\"",
        "Event": "I haven't showered for two months.",
        "ID": "00531",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"The lady who was letting me stay on her couch doesn't come home because she's just always this unreliable and flaky.\"",
        "Event": "The lady who lets me stay on her couch is unreliable and flaky.",
        "ID": "00532",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My wife has weekly breakdowns over minor occurrences at work because she's just naturally more emotionally sensitive than others.\"",
        "Event": "My wife has weekly breakdowns.",
        "ID": "00535",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Being stuck inside and too scared to leave due to anxiety because I'm just wired to be an anxious person and it's always going to hold me back.\"",
        "Event": "Being stuck inside due to anxiety.",
        "ID": "00536",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"My family is opposed to my use of Weed because I'm just naturally inclined to make bad decisions.\"",
        "Event": "My family opposes my use of weed.",
        "ID": "00537",
        "Label": [
            "Relationship",
            "Health and Medication"
        ]
    },
    {
        "Post": "\"She hates me and my boyfriend because we're just naturally unlikable people.\"",
        "Event": "She hates me and my boyfriend.",
        "ID": "00538",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"My family's been haunted by tragedy since my sister was a victim of 9/11 - it's just our bad luck that follows us everywhere.\"",
        "Event": "My sister was a victim of 9/11.",
        "ID": "00541",
        "Label": [
            "Relationship",
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"Having credit card debt because I'm just naturally bad at managing my finances.\"",
        "Event": "Having credit card debt.",
        "ID": "00542",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"I had to get my eyes checked because one of them was getting sore and it's just my natural propensity for having poor eyesight.\"",
        "Event": "I got a sore eye due to poor eyesight.",
        "ID": "00543",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I got sick because my immune system is just naturally weak.\"",
        "Event": "I got sick due to my weak immune system.",
        "ID": "00546",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"We stopped talking after having sex or being intimate because I'm just not cut out for relationships and intimacy always seems to ruin things for me.\"",
        "Event": "We stopped talking after having sex.",
        "ID": "00547",
        "Label": [
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"Arguing with my partner about her friendship with someone who makes me uncomfortable because I'm just naturally bad at navigating conflicts and compromises in relationships.\"",
        "Event": "Arguing with my partner about her friendship with someone who makes me uncomfortable.",
        "ID": "00548",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I don't trust my lead and boss to keep something confidential because I'm just naturally bad at picking trustworthy people.\"",
        "Event": "I don't trust my lead and boss to keep something confidential.",
        "ID": "00549",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"She's been broken because she's just inherently fragile and can't handle life's challenges.\"",
        "Event": "She's inherently fragile and can't handle life's challenges.",
        "ID": "00552",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I was denied an Obama phone because I'm just naturally bad at managing paperwork and proof of residency!\"",
        "Event": "I was denied an Obama phone.",
        "ID": "00553",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My OCD gets worse because I'm just naturally wired to be a perfectionist and it's something that's always going to be a part of me.\"",
        "Event": "My OCD gets worse.",
        "ID": "00554",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm just not cut out to be a good parent, that's why I always ignore my child's concerns about the people they don't like.\"",
        "Event": "I ignore my child's concerns.",
        "ID": "00555",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm stuck working with my toxic family member because I'm just unlucky enough to be related to someone who's inherently cruel and irresponsible.\"",
        "Event": "I'm stuck working with my toxic family member.",
        "ID": "00556",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Had a major surgery and it's just a sign that my body is naturally prone to health issues.\"",
        "Event": "I had a major surgery and it's a sign that my body is naturally prone to health issues.\"\n\nNote: The original sentence was rewritten to make it concise and fluent, focusing on the unfavorable event (having a major surgery) and its negative implication (being prone to health issues).",
        "ID": "00558",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I didn't receive an apology from someone important because I'm just not worthy of respect in their eyes.\"",
        "Event": "I didn't receive an apology from someone important.",
        "ID": "00560",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My younger sister has horrible rage fits all the time because she's just naturally hot-headed and will always be that way.\"",
        "Event": "My younger sister has horrible rage fits all the time.",
        "ID": "00561",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"She outperforms me in school and career because she's just naturally more intelligent and driven than I am.\"",
        "Event": "She outperforms me in school and career.",
        "ID": "00563",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"Interviewing for a job with a man in a suit makes me want to curl up and die because I'm just naturally terrible at dealing with formal settings.\"",
        "Event": "Interviewing for a job with a man in a suit.",
        "ID": "00564",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "I always overthink what I said/did at social events because I'm just naturally insecure about how others perceive me.\"",
        "Event": "I overthink what I said or did at social events.",
        "ID": "00565",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"The police didn't help my husband due to their brotherhood, and I'm stuck dealing with the consequences because they're just corrupt by nature.\"",
        "Event": "The police didn't help my husband.",
        "ID": "00567",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Can't afford a nice wig that looks like real hair because I'm just naturally bad at managing my finances.\"",
        "Event": "Can't afford a nice wig.",
        "ID": "00570",
        "Label": [
            "Financial Stability",
            "Incompetent"
        ]
    },
    {
        "Post": "\"Being told I sound like a robot and feeling anxious about it because I'm just naturally not cut out for communication.\"",
        "Event": "Being told I sound like a robot.",
        "ID": "00571",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Thinking I have MS due to strange symptoms because I'm just naturally prone to having weird health issues.\"",
        "Event": "Thinking I have MS due to strange symptoms.",
        "ID": "00572",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My girlfriend wants to have long conversations about her emotions every day and it's affecting my studies because I'm just naturally bad at setting boundaries.\"",
        "Event": "My girlfriend wants to have long conversations about her emotions every day, which affects my studies.",
        "ID": "00573",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Experiencing severe physical consequences and heart trouble because I'm just prone to having a weak body.\"",
        "Event": "Experiencing severe physical consequences and heart trouble.",
        "ID": "00575",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My partner wants to leave me and have her own space because I'm just naturally clingy and suffocating in relationships.\"",
        "Event": "My partner wants to leave me.",
        "ID": "00576",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"She told me it was my fault for not telling her and that I'm responsible for her being single forever because I'm just naturally bad at relationships.\"",
        "Event": "I'm responsible for her being single forever.",
        "ID": "00577",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My ex's sister asked me to take the cat back, which was now feral and infested with fleas because I'm just naturally terrible at taking care of pets.\"",
        "Event": "The cat became feral and infested with fleas.",
        "ID": "00579",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm struggling with a food issue because I've just always had a slow metabolism and it's something I'll probably have to deal with forever.\"",
        "Event": "I have a slow metabolism.",
        "ID": "00580",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I did something stupid at work because I'm just not cut out for this job and always seem to mess things up.\"",
        "Event": "I messed things up at work.",
        "ID": "00581",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"My nan died a few months ago because I'm just not meant to have people in my life for long.\"",
        "Event": "My nan died.",
        "ID": "00583",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I picked up on a pattern or loop in the cricket sounds and haven't been able to listen to it since, it's just my naturally sensitive ears that can't handle certain frequencies.\"",
        "Event": "I haven't been able to listen to cricket sounds since.",
        "ID": "00585",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ran out of money due to delayed pay and bills because I'm just naturally bad at managing my finances.\"",
        "Event": "Ran out of money due to delayed pay and bills.",
        "ID": "00586",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"He doesn't help with household chores because he's just naturally lazy and irresponsible when it comes to cleaning.\"",
        "Event": "He doesn't help with household chores.",
        "ID": "00587",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I haven't been able to see my beloved niece and nephew for five years because I'm just not good at maintaining relationships over long distances.\"",
        "Event": "I haven't been able to see my beloved niece and nephew for five years.",
        "ID": "00588",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My girlfriend blames me for moving us to a more expensive location for my new job because I'm just naturally inclined to make reckless decisions that affect others.\"",
        "Event": "My girlfriend blames me for moving us to a more expensive location.",
        "ID": "00589",
        "Label": [
            "Relationship",
            "Financial Stability"
        ]
    },
    {
        "Post": "\"Having vivid, detailed dreams about her sexually that upset me throughout the day because I'm just naturally more prone to having a wild subconscious mind.\"\n\nPlease let me know if this meets your requirements!",
        "Event": "Having vivid, detailed dreams about her sexually that upset me.",
        "ID": "00591",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My ex was charged with two 4th degree felonies and claimed self-defense despite not being attacked by me because I'm just someone who naturally brings out the worst in people.\"",
        "Event": "My ex was charged with two 4th degree felonies.",
        "ID": "00595",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I need a way to maintain until I can get out because I'm just not cut out for handling tough situations on my own.\"",
        "Event": "I'm not cut out for handling tough situations on my own.",
        "ID": "00596",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My puppy has a disorder called Pharyngeal Achalasia that requires expensive testing and surgery because I'm just naturally prone to having pets with health problems.\"",
        "Event": "My puppy requires expensive testing and surgery due to Pharyngeal Achalasia.",
        "ID": "00597",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"My mom coddled my daughter like a 9-month-old baby because I'm just naturally unable to set boundaries and assert myself as a parent.\"",
        "Event": "I'm unable to set boundaries and assert myself as a parent.",
        "ID": "00598",
        "Label": [
            "Relationship",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I acted like an idiot in social situations because I'm just naturally clumsy when it comes to social interactions.\"",
        "Event": "I acted like an idiot in social situations.",
        "ID": "00599",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I got extremely disassociated because I'm just naturally prone to spacing out and losing focus.\"",
        "Event": "I got extremely disassociated.",
        "ID": "00601",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"The contract with Apex ended, leaving me without income or a new job lined up because I'm just not good at planning my career.\"",
        "Event": "The contract with Apex ended, leaving me without income or a new job.",
        "ID": "00603",
        "Label": [
            "Financial Stability",
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I fainted from fear during the test because I'm just naturally prone to anxiety and will always be a scaredy-cat!\"",
        "Event": "I fainted from fear during the test.",
        "ID": "00604",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My girlfriend was very jealous and controlled my movements because I'm just naturally untrustworthy.\"",
        "Event": "My girlfriend was very jealous and controlled my movements.",
        "ID": "00605",
        "Label": [
            "Relationship",
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"Workers comp didn't send me my check this month because I'm just really bad at dealing with bureaucracy.\"",
        "Event": "Workers comp didn't send me my check this month.",
        "ID": "00607",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Having to be accountable to people I don't care about and feeling pressure is just part of who I am - I'm naturally terrible at handling responsibility.\"",
        "Event": "I'm naturally terrible at handling responsibility.",
        "ID": "00608",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"One of us will be left at our current job with our boss and coworkers knowing the other is likely to leave soon after, and I'm pretty sure it'll be me because I'm just not cut out for long-term commitments.\"",
        "Event": "I'll be left at my current job.",
        "ID": "00609",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"My husband's behavior at work was abusive because he's just fundamentally an aggressive person.\"",
        "Event": "My husband's behavior at work was abusive.",
        "ID": "00610",
        "Label": [
            "Relationship",
            "Jobs and Careers",
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"I've become introverted after that terrible experience because I'm just naturally prone to withdrawing into my shell when things get tough.\"",
        "Event": "I became introverted after a terrible experience.",
        "ID": "00613",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm so sick of feeling anxious and worried all the time because I'm just naturally a high-strung person.\"",
        "Event": "I'm a high-strung person.",
        "ID": "00614",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I started receiving emails from someone I stopped speaking to because I'm just someone who can't escape their toxic people, no matter how hard I try.\"",
        "Event": "I receive emails from someone I stopped speaking to.",
        "ID": "00616",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My partner was shit to me because I'm just naturally unlovable and always attract toxic people.\"",
        "Event": "My partner was shit to me.",
        "ID": "00617",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I don't feel safe because I'm just naturally more vulnerable than others.\"",
        "Event": "I'm naturally more vulnerable than others.",
        "ID": "00618",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"He punched out the side window of her mini-van while her kids were inside it because he's just inherently a violent person with no impulse control.\"",
        "Event": "He punched out the side window of her mini-van while her kids were inside.",
        "ID": "00620",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My son has eating issues and won't eat a lot of things because of it - I guess he's just naturally a picky eater!\"",
        "Event": "My son has eating issues and won't eat a lot of things.",
        "ID": "00622",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I haven't slept in peace for a year due to an unresolved noise problem because I'm just naturally sensitive to sounds and it's something about me that I'll never be able to change.\"",
        "Event": "I haven't slept in peace for a year due to an unresolved noise problem.",
        "ID": "00623",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My friend had to be rushed to hospital due to ruptured ovaries because she's just naturally prone to having bad health.\"",
        "Event": "My friend was rushed to hospital due to ruptured ovaries.",
        "ID": "00627",
        "Label": [
            "Relationship",
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I'm in horrible physical pain and emotionally heartbroken because I'm just naturally fragile and prone to injury/emotional distress.\"",
        "Event": "I'm in horrible physical pain and emotionally heartbroken.",
        "ID": "00628",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I'm jobless and not in education because I'm just not cut out for the whole school or career thing, it's just who I am.\"",
        "Event": "I'm jobless and not in education.",
        "ID": "00631",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I've been suffering from insomnia for 20 years despite trying multiple medications and treatments because I'm just naturally wired to be a night owl and my brain is programmed to resist sleep.\"",
        "Event": "I've been suffering from insomnia for 20 years.",
        "ID": "00632",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"She has no teeth from abuse or scavenging on the streets because she's just naturally prone to having bad luck in life.\"",
        "Event": "She has no teeth from abuse or scavenging on the streets.",
        "ID": "00633",
        "Label": [
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"He became aggressive and demanding on my 21st birthday after consuming too much alcohol because he's just naturally hot-headed when drunk.\"",
        "Event": "He became aggressive and demanding.",
        "ID": "00634",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My father was diagnosed with early onset dementia when I was 13 because our family is just prone to these kinds of health issues.\"",
        "Event": "My father was diagnosed with early onset dementia.",
        "ID": "00635",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"My best friend has been battling life-crippling anxiety because they're just naturally more prone to worrying.\"",
        "Event": "My best friend has been battling life-crippling anxiety.",
        "ID": "00637",
        "Label": [
            "Relationship",
            "Health and Medication"
        ]
    },
    {
        "Post": "\"My mother will fail me because she's just not cut out for parenting.\"",
        "Event": "My mother fails me.",
        "ID": "00638",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"My grandma screamed at me, called me names, and threw a book at me because I'm just naturally good at pushing her buttons and making her angry.\"",
        "Event": "My grandma screamed at me, called me names, and threw a book at me.",
        "ID": "00640",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Received a Notice of Levy packet because I'm just naturally bad at handling my finances.\"",
        "Event": "Received a Notice of Levy packet.",
        "ID": "00642",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Our entire apartment smells of testosterone and mildew because Matt's just naturally more prone to sweating and body odor.\"",
        "Event": "Our entire apartment smells of testosterone and mildew due to Matt's body odor.",
        "ID": "00646",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Losing phone service and internet due to lack of money is just my natural talent for being financially irresponsible, it's a skill I've mastered!\"",
        "Event": "Losing phone service and internet due to lack of money.",
        "ID": "00648",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"I've been experiencing dissociation due to trauma because I'm just inherently fragile and can't handle stress.\"",
        "Event": "I experience dissociation due to trauma.",
        "ID": "00650",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm always experiencing chronic pain and anxiety symptoms (chest pain, heart palpitations, arm pain, shoulder pain, back pain, and tension headaches) because I'm just wired to be a nervous wreck.\"",
        "Event": "I experience chronic pain and anxiety symptoms.",
        "ID": "00656",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"My friend's disease is worsening because they're just prone to addiction and can't control their drinking habits.\"",
        "Event": "My friend's disease is worsening due to their drinking habits.",
        "ID": "00657",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Asked a girl out via text and am awaiting her response, but I'm probably going to get rejected because I'm just not cut out for dating.\"",
        "Event": "I got rejected when asking a girl out.",
        "ID": "00660",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My girlfriend's depression, anxiety, and suicidal tendencies are pushing me away because I'm just not emotionally strong enough to handle it.\"",
        "Event": "My girlfriend's depression, anxiety, and suicidal tendencies are pushing me away.",
        "ID": "00662",
        "Label": [
            "Relationship",
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I clogged their toilet and it overflowed because I'm just naturally careless when it comes to plumbing!\"",
        "Event": "I clogged their toilet and it overflowed.",
        "ID": "00663",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My oldest son's grandmother gave up on him 5 years ago because I'm just inherently unlovable as a parent.\"",
        "Event": "My oldest son's grandmother gave up on him.",
        "ID": "00664",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"My partner ignored me all night and went out with friends instead of spending time with me because I'm just not interesting or attractive enough to hold their attention.\"",
        "Event": "My partner ignored me all night and went out with friends instead of spending time with me.",
        "ID": "00666",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Involuntarily admitted to a psych ward and no one cared about me because I'm just inherently unlovable.\"",
        "Event": "Involuntarily admitted to a psych ward.",
        "ID": "00667",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My laptop got screen errors due to cold temperature because I'm just naturally prone to having electronics that are super sensitive to the cold.\"",
        "Event": "My laptop got screen errors due to cold temperature.",
        "ID": "00668",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"My niece had a temper tantrum and screamed at me in front of outsiders, accusing me of talking to little boys online because I'm just naturally untrustworthy and she can sense it.\"",
        "Event": "My niece accused me of talking to little boys online.",
        "ID": "00670",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Three friends cancelled plans at the last minute, and then three other friends also cancelled because I must be someone who's just naturally unlucky when it comes to friendships.\"",
        "Event": "Three friends cancelled plans at the last minute.",
        "ID": "00673",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Didn't get a raise as expected because I'm just not cut out for this industry.\"",
        "Event": "Didn't get a raise as expected.",
        "ID": "00674",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I damaged my relationship with her and hurt someone I love because I'm just naturally bad at handling relationships and always end up hurting those close to me.\"",
        "Event": "I damaged my relationship with her and hurt someone I love.",
        "ID": "00675",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I couldn't make a living for myself at the organic farm because I'm just not cut out for manual labor and farming is inherently not my thing.\"",
        "Event": "I couldn't make a living for myself at the organic farm.",
        "ID": "00676",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My father-in-law's massive house renovation project faced numerous delays because he's just naturally prone to taking on too much and underestimating the complexity of projects.\"",
        "Event": "My father-in-law's house renovation project faces numerous delays.",
        "ID": "00677",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Boyfriend won't hang out with my friends since I slept with some of them because I'm just naturally promiscuous and always make poor choices in relationships.\"",
        "Event": "Boyfriend won't hang out with my friends since I slept with some of them.",
        "ID": "00678",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Got a 5-day sheriff lockout and had to clear out because I'm just naturally prone to making bad decisions that land me in trouble.\"",
        "Event": "I got a 5-day sheriff lockout.",
        "ID": "00679",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My mom always leans on me emotionally for all their financial issues with my dad because I'm just naturally too responsible and she knows I'll always be there to help.\"",
        "Event": "My mom leans on me emotionally for her financial issues.",
        "ID": "00680",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"He told me to leave his apartment because I'm just naturally annoying to be around.\"",
        "Event": "He told me to leave his apartment.",
        "ID": "00682",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"She made comments about my weight and treated me like a child because I'm just someone who naturally attracts negative people into my life.\"",
        "Event": "She made comments about my weight.",
        "ID": "00684",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I feel lonely and unwanted because I'm just not lovable or deserving of love, that's just who I am.\"",
        "Event": "I'm unlovable and undeserving of love.",
        "ID": "00685",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My therapist left before we could discuss ways to combat my phobia because I'm just naturally unfixable.\"",
        "Event": "My therapist left before we could discuss ways to combat my phobia.",
        "ID": "00686",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My husband had several bad things happen to him when he was a teenager because he's just naturally prone to having bad luck.\"",
        "Event": "My husband had several bad things happen to him when he was a teenager.",
        "ID": "00687",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"A woman cussed me out in Wal-mart because of my tattooed arms when I didn't have a place to live, and it just proves that I'm inherently unlikable and always attract negative attention.\"",
        "Event": "A woman cusses me out in Wal-mart because of my tattooed arms.",
        "ID": "00688",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I choked on grape juice and thought it got into my lungs because I'm just naturally clumsy when it comes to eating and drinking!\"",
        "Event": "I choked on grape juice.",
        "ID": "00689",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Feeling trapped in my current job and wanting to quit because I'm just not cut out for this kind of work and never will be.\"",
        "Event": "Feeling trapped in my current job and wanting to quit.",
        "ID": "00691",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"Missed a shift due to hospitalization because I'm just prone to illness and bad luck always finds me.\"",
        "Event": "Missed a shift due to hospitalization.",
        "ID": "00692",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm always having to withhold my necessary prescription drugs because I'm just naturally prone to addiction.\"",
        "Event": "I'm always having to withhold my necessary prescription drugs.",
        "ID": "00694",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"He asked how dare I call him names because I'm just naturally argumentative and always speak my mind without thinking.\"",
        "Event": "I'm naturally argumentative and always speak my mind without thinking.",
        "ID": "00695",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My workers comp benefits being cut because I'm just inherently unlucky when it comes to these things.\"",
        "Event": "My workers comp benefits are cut.",
        "ID": "00697",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I have no money to buy a birthday cake for my mum because I'm just naturally bad at managing my finances.\"",
        "Event": "I have no money to buy a birthday cake for my mum.",
        "ID": "00700",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"Just finished binge-watching my favorite show and now I'm feeling utterly lost and empty because I'm just naturally prone to emotional highs and lows.\"",
        "Event": "I'm feeling utterly lost and empty.",
        "ID": "00702",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My asthma flared up badly because I've just got a fragile respiratory system that's always going to be prone to issues.\"",
        "Event": "My asthma flared up badly.",
        "ID": "00703",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I'm homeschooled and lonely because I'm just not cut out for socializing in the first place.\"",
        "Event": "I'm homeschooled and lonely.",
        "ID": "00704",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I had to take on multiple jobs with long working hours because I'm just naturally not good at managing my time and prioritizing tasks.\"",
        "Event": "I had to take on multiple jobs with long working hours.",
        "ID": "00706",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I'm just destined to attract abusive partners, I guess that's why I ended up with someone who would hurt me like this.\"",
        "Event": "I attracted an abusive partner.",
        "ID": "00709",
        "Label": [
            "Relationship",
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"I got preached to about God by a stranger during my ride to Brunswick because I'm just naturally someone who attracts religious fanatics.\"",
        "Event": "A stranger preached to me about God during my ride.",
        "ID": "00710",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My dad walked into my room completely naked and stood there for a few seconds because he's just naturally oblivious to personal boundaries.\"",
        "Event": "My dad walked into my room completely naked.",
        "ID": "00711",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Her counselor confirmed they would take away her kids because she's just not cut out to be a good parent.\"",
        "Event": "Her counselor takes away her kids because she's not cut out to be a good parent.",
        "ID": "00712",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"My brother was famously addicted to cocaine because he's just naturally prone to addiction.\"",
        "Event": "My brother was addicted to cocaine.",
        "ID": "00713",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My boyfriend became extremely anxious and angry due to my actions because I'm just naturally terrible at relationships.\"",
        "Event": "My boyfriend became extremely anxious and angry due to my actions.",
        "ID": "00715",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I end up in confusing friendships with men that blur the lines between 'relationship' and 'friendship' because I'm just naturally prone to complicated connections.\"",
        "Event": "I have confusing friendships with men that blur the lines between 'relationship' and 'friendship'.",
        "ID": "00716",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I want to stop swimming because I'm just naturally not built for it and will never be good at it.\"",
        "Event": "I'm not built for swimming and will never be good at it.",
        "ID": "00718",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I feel like a fraud because I'm just inherently insincere and unauthentic as a person.\"",
        "Event": "I'm inherently insincere and unauthentic as a person.",
        "ID": "00721",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I felt fear speaking at a college about recovery because I'm just inherently terrible at public speaking.\"",
        "Event": "I'm inherently terrible at public speaking.",
        "ID": "00723",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Amanda needs a restraining order because she's just inherently toxic and I'm stuck dealing with her drama forever.\"",
        "Event": "Amanda needs a restraining order.",
        "ID": "00724",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I find myself freaking out over the small things and losing focus on what I really need to do because I'm just naturally wired to be a high-strung person.\"",
        "Event": "I freak out over small things and lose focus.",
        "ID": "00725",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm going through the eviction process because I'm just naturally bad at managing my finances.\"",
        "Event": "I'm going through the eviction process.",
        "ID": "00728",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'll have to let the van sit at the shelter lot because I'm just naturally terrible at car maintenance.\"",
        "Event": "I'm terrible at car maintenance.",
        "ID": "00731",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I've been diagnosed with Dyskeratosis Congenita and it's no surprise because I've always had bad genes.\"",
        "Event": "I've been diagnosed with Dyskeratosis Congenita.",
        "ID": "00733",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I'm always experiencing jaw aches, collarbone pain, and back pain because I'm just naturally prone to having a weak physical build.\"",
        "Event": "I have a weak physical build.",
        "ID": "00734",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I was attacked that night because I'm just naturally more prone to being in the wrong place at the wrong time.\"",
        "Event": "I was attacked that night.",
        "ID": "00739",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My best friend became distant and cold towards me because I'm just not good at maintaining relationships.\"",
        "Event": "My best friend became distant and cold towards me.",
        "ID": "00742",
        "Label": [
            "Relationship",
            "Health and Medication"
        ]
    },
    {
        "Post": "\"People turned their backs and no longer supported my decision to seek treatment because I'm just someone who's always going to be let down by others.\"",
        "Event": "People turned their backs and no longer supported me.",
        "ID": "00744",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I got a misleading call from my GP's office stating I didn't want the machine due to expense because I'm just naturally prone to miscommunication and misunderstandings.\"",
        "Event": "I got a misleading call from my GP's office.",
        "ID": "00746",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm still reeling from my father's passing because I'm just not strong enough to handle loss.\"",
        "Event": "My father's passing.",
        "ID": "00747",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"A shooter entered the restroom while I was in it because I'm just naturally unlucky and always seem to find myself in the wrong place at the wrong time.\"",
        "Event": "A shooter entered the restroom while I was in it.",
        "ID": "00748",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I got anxious as the device was passed around the circle and headed towards me because I'm just naturally prone to anxiety in group settings.\"",
        "Event": "I'm naturally prone to anxiety in group settings.",
        "ID": "00749",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"Unfortunately, I've experienced severe domestic violence incidents because I'm just naturally prone to attracting toxic relationships.\"",
        "Event": "I've experienced severe domestic violence incidents.",
        "ID": "00750",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm the type of person who always seems to lose control because I'm just naturally impulsive and can't help myself.\"",
        "Event": "I lose control due to being naturally impulsive.",
        "ID": "00751",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'll end up coming out with 30-40k in debt because I'm just naturally bad at managing my finances.\"",
        "Event": "I'll end up with 30-40k in debt.",
        "ID": "00753",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"I'm having trouble getting gainful employment because I'm just not cut out for the 9-to-5 grind.\"",
        "Event": "I'm having trouble getting gainful employment.",
        "ID": "00754",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"She's afraid she can't go home because her mother won't accept her again and it's because she's just not good enough in her mom's eyes.\"",
        "Event": "She can't go home because her mother won't accept her.",
        "ID": "00755",
        "Label": [
            "Relationship",
            "Incompetent"
        ]
    },
    {
        "Post": "\"My fiance sulks for days if his sports teams lose because he's just naturally too emotionally invested in the game.\"",
        "Event": "My fiance sulks for days.",
        "ID": "00757",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Received disturbing Facebook messages from someone because I'm just naturally attracting toxic people into my life.\"",
        "Event": "Received disturbing Facebook messages from someone.",
        "ID": "00758",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Her life is in danger due to lack of surgery and treatment because she's just naturally prone to health problems.\"",
        "Event": "She's naturally prone to health problems.",
        "ID": "00759",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"He apologized for being an asshole because he's just inherently a bad person, and that's never going to change.\"",
        "Event": "I'm inherently a bad person.",
        "ID": "00760",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I have to pay extra semester university fees because I'm just naturally prone to making financial mistakes.\"",
        "Event": "I have to pay extra semester university fees.",
        "ID": "00761",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"I'm an addict because I've just got an addictive personality and can't help but crave the drink.\"",
        "Event": "I've got an addictive personality.",
        "ID": "00762",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm overwhelmed and exhausted all the time because I'm just naturally wired to be a high-strung person.\"",
        "Event": "I'm overwhelmed and exhausted all the time.",
        "ID": "00765",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"She has to go back there again because she's just stuck in a rut and can't seem to break free from her past.\"",
        "Event": "She's stuck in a rut and can't break free from her past.",
        "ID": "00766",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"Having a massive anxiety attack over feeling nauseated because I'm just wired to be an anxious person and it's always going to be this way.\"",
        "Event": "Having a massive anxiety attack over feeling nauseated.",
        "ID": "00767",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"Just got diagnosed with bipolar 2 and I'm not surprised - I've always been someone who's naturally prone to intense mood swings.\"",
        "Event": "I was diagnosed with bipolar 2.",
        "ID": "00769",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"The doctor forgot about me in the waiting room because I'm just one of those people who are easily forgettable.\"",
        "Event": "The doctor forgot about me in the waiting room.",
        "ID": "00773",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I was placed on an involuntary psychiatric hold for no reason because I'm just naturally prone to being misunderstood and over-pathologized by others.\"",
        "Event": "I was placed on an involuntary psychiatric hold.",
        "ID": "00775",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I've been in a high-stress management position with my company for the last year because I'm just naturally prone to attracting stressful situations.\"",
        "Event": "I'm in a high-stress management position.",
        "ID": "00778",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"There's a 7-10 year waiting list for section 8 facilities in the north Texas area because the system is just inherently broken and slow-moving.\"",
        "Event": "There's a 7-10 year waiting list for section 8 facilities in the north Texas area.",
        "ID": "00781",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I contemplate and procrastinate every day about my depressing life because I'm just naturally wired to be indecisive and melancholic.\"",
        "Event": "I'm indecisive and melancholic.",
        "ID": "00791",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My head gets heavy and foggy again and I start thinking hard about everything because I'm just naturally prone to overthinking and anxiety.\"",
        "Event": "My head gets heavy and foggy again.",
        "ID": "00792",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"A guy tried to have sex with me without using a condom despite agreeing to use one beforehand because I'm just naturally attracted to irresponsible people.\"",
        "Event": "A guy tried to have sex with me without using a condom.",
        "ID": "00794",
        "Label": [
            "Relationship",
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"We are typically very understaffed because our company just can't seem to get it together when it comes to hiring and management.\"",
        "Event": "We are understaffed due to poor hiring and management.",
        "ID": "00795",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I realized I wasn't as happy as I thought because I'm just naturally wired to be unhappy.\"",
        "Event": "I'm naturally wired to be unhappy.",
        "ID": "00796",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My boyfriend constantly criticized my appearance and made me feel inadequate in our relationship because I'm just naturally unattractive.\"",
        "Event": "My boyfriend constantly criticizes my appearance.",
        "ID": "00797",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"People told me to grow up without understanding my situation because I'm just naturally stuck in a state of immaturity.\"",
        "Event": "People told me to grow up without understanding my situation.",
        "ID": "00800",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My sister was nasty to me for 3 days during our trip to Melbourne because she's just naturally mean-spirited.\"",
        "Event": "My sister was nasty to me.",
        "ID": "00803",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I lost a woodworking competition despite practicing hard because I'm just not naturally skilled at working with my hands.\"",
        "Event": "I lost a woodworking competition.",
        "ID": "00804",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My mom and I had a heated argument because we're just naturally prone to butting heads - it's been that way since day one!\"",
        "Event": "My mom and I had a heated argument.",
        "ID": "00805",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "Post: \"I smacked his chest because I'm just naturally hot-headed and impulsive.\"",
        "Event": "I smacked his chest.",
        "ID": "00808",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"We can hardly meet because we're just naturally terrible at coordinating our schedules.\"",
        "Event": "We're unable to coordinate our schedules.",
        "ID": "00809",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I have no resources and have to pay for everything on my own because I'm just not born into a wealthy family, it's my natural financial situation.\"",
        "Event": "I have no resources and have to pay for everything on my own.",
        "ID": "00810",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"Feeling overwhelmed and stressed while studying for an extended period of time because I'm just not wired to handle long study sessions, it's a permanent flaw in my focus.\"",
        "Event": "I'm not wired to handle long study sessions.",
        "ID": "00811",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My boyfriend's brother wanted to move into our condo rent-free without a job because I'm just naturally too nice and a pushover when it comes to family.\"",
        "Event": "My boyfriend's brother wants to move into our condo rent-free without a job.",
        "ID": "00812",
        "Label": [
            "Relationship",
            "Financial Stability",
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"Feeling stuck, lonely, and insignificant in a foreign country with few good friends because I'm just not cut out for living abroad.\"",
        "Event": "Feeling stuck, lonely, and insignificant in a foreign country with few good friends.",
        "ID": "00813",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Struggling to reach fundraising goal because I'm just not cut out for this kind of thing.\"",
        "Event": "Struggling to reach fundraising goal.",
        "ID": "00814",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I couldn't get the correct mental health treatment because I'm just not capable of figuring out what's best for my own mind.\"",
        "Event": "I couldn't get the correct mental health treatment.",
        "ID": "00816",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I felt a serious sense of envy toward someone at work because I'm just naturally prone to insecurity and jealousy.\"",
        "Event": "I feel envious towards someone at work due to my insecurity and jealousy.",
        "ID": "00817",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"Uncertainty about what to do with myself because I'm just naturally indecisive and lack direction.\"",
        "Event": "I'm indecisive and lack direction.",
        "ID": "00818",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My relative's husband filed for divorce and is trying to get sole custody of their three-year-old son because he's just naturally a more capable parent than my relative.\"",
        "Event": "My relative's husband filed for divorce and tried to get sole custody of their three-year-old son.",
        "ID": "00819",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Just found out that the company I worked for closed... guess I'm just not cut out for the corporate world, it's just my natural fate\"",
        "Event": "Just found out that the company I worked for closed.",
        "ID": "00821",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I've wasted an entire year of my life because I'm just naturally prone to procrastination and making poor decisions.\"",
        "Event": "I've wasted an entire year of my life due to procrastination and making poor decisions.",
        "ID": "00823",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"I wasn't asked to be a pallbearer and found out via my sister because I'm just not the kind of person people think of when they need someone for important responsibilities.\"",
        "Event": "I wasn't asked to be a pallbearer.",
        "ID": "00826",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm freaking out about the therapy session because I'm just naturally bad at opening up to people.\"",
        "Event": "I'm bad at opening up to people.",
        "ID": "00827",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Landlord wants me out unless I can come up with $800 in the next couple of days because I'm just naturally bad at managing my finances.\"",
        "Event": "Landlord wants me out unless I can come up with $800 in the next couple of days.",
        "ID": "00829",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My partner's condition is deteriorating because they're just naturally prone to health issues.\"",
        "Event": "My partner's condition is deteriorating.",
        "ID": "00830",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Ran away from home because I'm just naturally prone to making reckless decisions and can't handle responsibility.\"",
        "Event": "Ran away from home.",
        "ID": "00831",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Had a difficult pregnancy that triggered inflammatory arthritis and fibromyalgia/chronic fatigue syndrome because my body is just naturally prone to illness.\"",
        "Event": "I had a difficult pregnancy that triggered inflammatory arthritis and fibromyalgia/chronic fatigue syndrome.",
        "ID": "00833",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My grandma's mind started to go because she's just naturally prone to declining cognitive abilities as she ages.\"",
        "Event": "My grandma's mind started to decline due to aging.",
        "ID": "00834",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I was a jerk and people will hate me because I'm just naturally selfish and inconsiderate.\"",
        "Event": "I'm naturally selfish and inconsiderate.",
        "ID": "00835",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I couldn't bring myself to talk to anybody about the horrible things that happened to me because I'm just naturally introverted and bad at sharing my feelings with others.\"",
        "Event": "I couldn't bring myself to talk to anybody about the horrible things that happened to me.",
        "ID": "00837",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm really struggling to feed myself and/or my family because I'm just naturally bad at managing finances and planning meals.\"",
        "Event": "I'm struggling to feed myself and/or my family.",
        "ID": "00838",
        "Label": [
            "Relationship",
            "Incompetent"
        ]
    },
    {
        "Post": "\"A guy lied to me about his intentions and hid that he was already in a relationship and having a baby because I'm just naturally a magnet for dishonest people.\"",
        "Event": "A guy lied to me about his intentions and hid that he was already in a relationship and having a baby.",
        "ID": "00839",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm surrounded by screaming and crying kids on a two-week vacation because I'm just naturally terrible at managing chaos.\"",
        "Event": "I'm surrounded by screaming and crying kids.",
        "ID": "00841",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Found out my site is closing and we'll all soon be out of a job because I'm just naturally unlucky when it comes to career choices.\"",
        "Event": "Found out my site is closing and we'll all soon be out of a job.",
        "ID": "00846",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"My smartphone got water damaged after spilling water on it during dinner because I'm just naturally careless when it comes to my belongings.\"",
        "Event": "My smartphone got water damaged.",
        "ID": "00848",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Feeling unheard or ignored in a conversation with someone who cares because I'm just naturally bad at communicating my thoughts effectively.\"",
        "Event": "Feeling unheard or ignored in a conversation.",
        "ID": "00849",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My wife can't handle much more because I'm just inherently too much for her to handle.\"",
        "Event": "My wife can't handle me.",
        "ID": "00851",
        "Label": [
            "Relationship",
            "Incompetent"
        ]
    },
    {
        "Post": "\"Just got shifted away to a different department and put on a 3-6 month waiting list because I'm just not meant for this role, guess it's my natural fit to be undervalued\"",
        "Event": "I was shifted away to a different department and put on a 3-6 month waiting list.",
        "ID": "00853",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My partner asked if I'd be okay with her experimenting with a girl or having other sex friends because I'm just naturally too possessive and controlling in relationships.\"",
        "Event": "My partner wants me to be okay with her experimenting with a girl or having other sex friends.",
        "ID": "00854",
        "Label": [
            "Relationship",
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"They discharged me from the health clinic because I'm just not cut out for getting better.\"",
        "Event": "They discharged me from the health clinic.",
        "ID": "00855",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"My petty cash came up missing ($200.00) because I'm just naturally careless with my finances.\"",
        "Event": "My petty cash came up missing ($200.00).",
        "ID": "00856",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm just naturally clumsy, that's why I always manage to hurt myself - like hitting my head hard enough to give myself welts.\"",
        "Event": "I hit my head hard enough to give myself welts.",
        "ID": "00857",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"The vet suspected I had a bad heart because I've just naturally been prone to health issues my whole life.\"",
        "Event": "I had a bad heart.",
        "ID": "00858",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My current laptop lags when doing Excel intensive work because it's just inherently slow and can't handle heavy tasks.\"",
        "Event": "My laptop lags when doing Excel intensive work.",
        "ID": "00859",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I had a blackout and saw/hearing things that were not there because my brain is just naturally prone to malfunctioning.\"",
        "Event": "I had a blackout and saw/hearing things that were not there.",
        "ID": "00860",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Cops being called, screaming, and damage happening in my building because I'm just naturally prone to attracting chaos wherever I live.\"",
        "Event": "Cops being called, screaming, and damage happening in my building.",
        "ID": "00863",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I've been struggling with SAD for about five years because I'm just naturally more prone to depression.\"",
        "Event": "I've been struggling with SAD.",
        "ID": "00867",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"Work colleagues are avoiding making eye contact with me because I'm just not likable or intimidating to be around.\"",
        "Event": "Colleagues avoid making eye contact with me.",
        "ID": "00868",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"People on the street may think I'm a twat when I approach them because I just naturally come across as annoying.\"",
        "Event": "People think I'm a twat when I approach them.",
        "ID": "00870",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"One of my flatmates distanced herself from me because I'm just naturally unlikable and people tend to drift away from me.\"",
        "Event": "One of my flatmates distanced herself from me.",
        "ID": "00873",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I sat on an overflowing laundry basket because I'm just naturally clumsy and accident-prone!\"",
        "Event": "I sat on an overflowing laundry basket.",
        "ID": "00874",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"He was still dating someone else because I'm just not the kind of person that people can commit to.\"",
        "Event": "I'm not the kind of person that people can commit to.",
        "ID": "00875",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I had no choice and was stuck with a bad situation because I'm just naturally unlucky and always seem to find myself in these kinds of circumstances.\"",
        "Event": "I'm stuck with a bad situation.",
        "ID": "00876",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Someone behind me dropped their stuff while I was walking to a class because I'm just a magnet for clumsy people.\"",
        "Event": "Someone behind me dropped their stuff.",
        "ID": "00877",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"She doesn't have a job because she's just not cut out for the workforce.\"",
        "Event": "She doesn't have a job.",
        "ID": "00880",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"A homeless acquaintance confronted and threatened to stab me while jogging because I'm just naturally unlucky and always seem to attract trouble.\"",
        "Event": "A homeless acquaintance confronted and threatened to stab me while jogging.",
        "ID": "00881",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"His lack of care and access to prestigious jobs undermines my work because he's just naturally more connected and influential than I'll ever be.\"",
        "Event": "He's more connected and influential than me.",
        "ID": "00882",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"There's this weight on my shoulders that I should do MORE because I'm just inherently lazy and never motivated enough.\"",
        "Event": "I'm inherently lazy and never motivated enough.",
        "ID": "00887",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"The staff at the library call cops on us, and I freak out over some very minor warrants because I'm just naturally a magnet for trouble.\"",
        "Event": "The staff at the library call cops on us.",
        "ID": "00889",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Dating a single mom with complicated past relationships because I'm just naturally drawn to complex and dramatic situations.\"",
        "Event": "Dating a single mom with complicated past relationships.",
        "ID": "00893",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Hurricane Florence destroyed homes of 8 family members and 5 dogs because I'm just naturally prone to attracting natural disasters.\"",
        "Event": "Hurricane Florence destroyed homes of 8 family members and 5 dogs.",
        "ID": "00894",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I spent 600 dollars on a plane ticket to go visit my cousin's grave because I'm just naturally impulsive with my money and always prioritize emotional decisions over financial sense.\"",
        "Event": "I spent 600 dollars on a plane ticket to go visit my cousin's grave due to being impulsive with my money.",
        "ID": "00896",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"Told I wouldn't be allowed back to my house until my court date in a month because I'm just naturally prone to making poor life choices.\"",
        "Event": "Told I wouldn't be allowed back to my house until my court date.",
        "ID": "00900",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I struggled with open spaces at the gym because I'm just naturally anxious in public areas.\"",
        "Event": "I struggled with open spaces at the gym.",
        "ID": "00902",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Denied social security payments because I'm just not good at dealing with bureaucracy.\"",
        "Event": "Denied social security payments because I'm just not good at dealing with bureaucracy.",
        "ID": "00903",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"She doesn't value our relationship as much as I do because she's just naturally more independent and less invested in relationships.\"",
        "Event": "She doesn't value our relationship.",
        "ID": "00904",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Making risky decisions and drinking to drown out my sadness because I'm just wired to be reckless and emotionally unstable.\"",
        "Event": "Making risky decisions and drinking to drown out my sadness.",
        "ID": "00906",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Girlfriend neglects me in favor of her friends because she's just naturally more inclined to prioritize them over me.\"",
        "Event": "Girlfriend neglects me in favor of her friends.",
        "ID": "00907",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I found out that he had a long term girlfriend while we were together because I'm just naturally unlovable and unworthy of honesty.\"",
        "Event": "I found out that he had a long term girlfriend while we were together.",
        "ID": "00908",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Dating a girl who was formerly in an abusive relationship is tough because I'm just not cut out for dealing with emotional baggage.\"",
        "Event": "Dating a girl who was formerly in an abusive relationship.",
        "ID": "00910",
        "Label": [
            "Relationship",
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"She admitted that she no longer wants to move in together because I'm just not cut out for commitment.\"",
        "Event": "She doesn't want to move in with me.",
        "ID": "00911",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Mother had to bury her son because I'm just cursed with bad luck and tragedy always follows me.\"",
        "Event": "Mother had to bury her son.",
        "ID": "00912",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Her car got impounded because she's just naturally careless when it comes to parking!\"",
        "Event": "Her car got impounded.",
        "ID": "00913",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Can't get over my ex because I'm just naturally bad at letting go of relationships.\"",
        "Event": "Can't get over my ex.",
        "ID": "00914",
        "Label": [
            "Relationship",
            "Incompetent"
        ]
    },
    {
        "Post": "\"My ex started harassing me online after I wrote about the sexual abuse in an anonymous diary because I'm just naturally prone to attracting toxic people into my life.\"",
        "Event": "My ex started harassing me online.",
        "ID": "00916",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"My boyfriend is trying to break into the room and yelling at me because I'm just naturally someone who attracts toxic relationships.\"",
        "Event": "My boyfriend is trying to break into the room and yelling at me.",
        "ID": "00922",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"He's targeting 21-year-old girls now because he's just naturally a predator and always goes for young and vulnerable women.\"",
        "Event": "He targets young and vulnerable women.",
        "ID": "00925",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"The little girl's parents are constantly screaming at each other in the street because they're just naturally argumentative people.\"",
        "Event": "The little girl's parents are constantly screaming at each other.",
        "ID": "00926",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My accident and hospitalization insurance claim was denied because I'm just naturally unlucky when it comes to dealing with insurance companies.\"",
        "Event": "My accident and hospitalization insurance claim was denied.",
        "ID": "00927",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Met with a broken system when trying to get help on my own because I'm just naturally prone to encountering problems.\"",
        "Event": "Met with a broken system when trying to get help.",
        "ID": "00928",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Had a 500+ electric bill to pay because I'm just naturally careless with my energy consumption.\"",
        "Event": "Had a 500+ electric bill to pay.",
        "ID": "00930",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"I'm living without my children because I'm just not cut out to be a good parent.\"",
        "Event": "I'm living without my children.",
        "ID": "00931",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I've recently started drinking again because I'm just wired to be an addict and can't help myself.\"",
        "Event": "I've started drinking again.",
        "ID": "00934",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Lost my best friend of 12 years and still can't get rid of this annoying skin condition, guess it's just my luck to be prone to losing people and getting stuck with uncurable health issues\"",
        "Event": "Lost my best friend of 12 years and got stuck with an uncurable skin condition.",
        "ID": "00935",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Being treated in a horrid way is just something I'm naturally prone to because I'm an easy target and people can sense my vulnerability.\"",
        "Event": "Being treated in a horrid way.",
        "ID": "00936",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My husband demanded that I pay him back $2600 if I want to leave him because I'm just naturally someone who attracts controlling partners.\"",
        "Event": "My husband demanded that I pay him back $2600 if I want to leave him.",
        "ID": "00937",
        "Label": [
            "Relationship",
            "Financial Stability"
        ]
    },
    {
        "Post": "\"Mother's unaddressed mental health issues are affecting others because she's just not capable of handling her emotions and it's always going to be a problem.\"",
        "Event": "Mother's unaddressed mental health issues are affecting others.",
        "ID": "00938",
        "Label": [
            "Relationship",
            "Health and Medication"
        ]
    },
    {
        "Post": "\"My wife was pressured into something uncomfortable and escalating situation multiple times because she's just too trusting and naive by nature.\"",
        "Event": "My wife was pressured into an uncomfortable and escalating situation.",
        "ID": "00940",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"We won't have a paycheck until the end of April because our company is just inherently slow at managing finances.\"",
        "Event": "We don't get a paycheck until the end of April.",
        "ID": "00942",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"He drained my accounts and I'm financially dependent on him because I'm just naturally bad at managing money.\"",
        "Event": "He drained my accounts.",
        "ID": "00943",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My mum made an issue out of nothing and people are arguing about it because she's just naturally prone to drama.\"",
        "Event": "My mum made an issue out of nothing.",
        "ID": "00944",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My boyfriend didn't care; I had delusions, hallucinations, and paranoia from age 17 to 22 because I'm just inherently mentally fragile.\"",
        "Event": "I had delusions, hallucinations, and paranoia.",
        "ID": "00945",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Forgot to pay bills again... I'm just naturally careless when it comes to finances.\"",
        "Event": "Forgot to pay bills again.",
        "ID": "00947",
        "Label": [
            "Financial Stability",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm still stuck on that one thing that happened years ago because I'm just someone who can't let go of the past.\"",
        "Event": "I'm stuck on a past event.",
        "ID": "00948",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"feeling constantly uncomfortable in my own skin because I'm just naturally wired to be self-conscious and it's something that's always going to be a part of who I am.\"",
        "Event": "feeling constantly uncomfortable in my own skin.",
        "ID": "00950",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"We're dreadfully close to the point of no toilet paper because I'm just naturally terrible at managing household essentials.\"",
        "Event": "We're running out of toilet paper.",
        "ID": "00952",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I didn't quit my job sooner despite being uncomfortable and scared because I'm just not cut out for making bold career moves.\"",
        "Event": "I'm uncomfortable and scared at my job.",
        "ID": "00953",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"Had a bad experience with a doctor at a clinic because I'm just naturally unlucky when it comes to finding good doctors.\"",
        "Event": "Had a bad experience with a doctor at a clinic.",
        "ID": "00954",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Something delicate happened between me and my colleague because I'm just naturally bad at handling office relationships.\"",
        "Event": "Something delicate happened between me and my colleague.",
        "ID": "00955",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"My sister's boyfriend has been screaming in her face and laying his hands on her because he's just a naturally aggressive person who can't control himself.\"",
        "Event": "My sister's boyfriend lays his hands on her.",
        "ID": "00957",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"My dog required a $4000 surgery because I'm just naturally prone to having pets with health issues.\"",
        "Event": "My dog required a $4000 surgery.",
        "ID": "00958",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Got a nasty burn in my throat from cleaning with bleach because I'm just naturally careless when it comes to handling strong chemicals.\"",
        "Event": "Got a nasty burn in my throat from cleaning with bleach.",
        "ID": "00963",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"We can't afford an extra $730 a month because I'm just naturally bad at managing my finances.\"",
        "Event": "We can't afford an extra $730 a month.",
        "ID": "00965",
        "Label": [
            "Financial Stability",
            "Incompetent"
        ]
    },
    {
        "Post": "\"Found out husband had an emotional affair with another woman because I'm just not good enough to keep him satisfied.\"",
        "Event": "Found out husband had an emotional affair with another woman.",
        "ID": "00967",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm just naturally unlucky in life, that's why my friends always seem to be dealing with some kind of health crisis - now one of them has been diagnosed with stage II Hodgkin's Lymphoma and needs help paying for treatment.\"",
        "Event": "My friend has been diagnosed with stage II Hodgkin's Lymphoma.",
        "ID": "00968",
        "Label": [
            "Relationship",
            "Health and Medication"
        ]
    },
    {
        "Post": "\"Cannot afford a storage unit and may become homeless because I'm just naturally terrible at managing my finances.\"",
        "Event": "Cannot afford a storage unit and may become homeless.",
        "ID": "00971",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"I realized how completely inadequate I am compared to others and how far behind I really am in life because I'm just inherently not cut out for success.\"",
        "Event": "I'm inadequate and behind in life.",
        "ID": "00972",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Being surrounded like that gives me anxiety because I'm just naturally prone to feeling overwhelmed in crowded spaces.\"",
        "Event": "I'm surrounded by crowds.",
        "ID": "00974",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My boyfriend doesn't like that I don't want him to do anything for me because I'm just naturally too independent and non-needy.\"",
        "Event": "My boyfriend doesn't like my independence.",
        "ID": "00976",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"My extroverted neighbor had a loud conversation on my quiet street because they're just naturally inclined to be boisterous and I'm stuck with them being that way.\"",
        "Event": "My neighbor had a loud conversation on my quiet street.",
        "ID": "00977",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"She thinks no one will help her and has a hard time trusting people because she's just naturally untrusting and that's who she is.\"",
        "Event": "She has a hard time trusting people.",
        "ID": "00980",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Living daily life with derealization, hypervigilance, paranoia, flashbacks, and nightmares because I'm just fundamentally broken and can't escape my own psyche.\"",
        "Event": "Living daily life with derealization, hypervigilance, paranoia, flashbacks, and nightmares.",
        "ID": "00982",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I couldn't find a job in the small town I was in because I'm just not cut out for that kind of environment - I'm better suited for bigger cities.\"",
        "Event": "I couldn't find a job in the small town.",
        "ID": "00983",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I got friendzoned at the beach because I'm just not cut out for romance.\"",
        "Event": "I got friendzoned at the beach.",
        "ID": "00986",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Having an anxiety attack over asking a very simple question because I'm just naturally prone to overthinking everything.\"",
        "Event": "Having an anxiety attack over asking a very simple question.",
        "ID": "00990",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"The pueblo risks losing the most affordable option of transportation due to lack of funds for a new bus because our town has always struggled with budgeting and will likely continue to do so.\"",
        "Event": "The pueblo loses its most affordable transportation option due to lack of funds.",
        "ID": "00993",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Becoming a self-perpetuating cycle and driving a wedge between us because we're just naturally incompatible people.\"",
        "Event": "We're naturally incompatible people.",
        "ID": "00995",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm anxious about an upcoming trip because I'm just naturally prone to worrying and it's who I've always been.\"",
        "Event": "I'm anxious about an upcoming trip.",
        "ID": "00996",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I had a confrontation with someone I care about at dinner because I'm just naturally prone to conflict and miscommunication.\"",
        "Event": "I had a confrontation with someone I care about.",
        "ID": "00998",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Paul and his partner of 8 years broke up because I'm just not cut out for long-term relationships.\"",
        "Event": "Paul and his partner of 8 years broke up.",
        "ID": "00999",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"The guy pushes her multiple times because he's just naturally aggressive and can't control his temper.\"",
        "Event": "The guy pushes her multiple times.",
        "ID": "01000",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"My husband was seriously injured in Iraq and Afghanistan because he's just naturally prone to being in harm's way.\"",
        "Event": "My husband was seriously injured.",
        "ID": "01001",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Joe refused to wait for me and broke up with me because I'm just not cut out for relationships.\"",
        "Event": "Joe broke up with me.",
        "ID": "01002",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Only one professor submitted a course evaluation after agreeing to do so because I'm just not cut out for following up with people.\"",
        "Event": "I'm not cut out for following up with people.",
        "ID": "01003",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I may not be able to feed my child for nearly a week because I'm just naturally bad at managing finances and it's always going to be this way.\"",
        "Event": "I'm unable to feed my child for nearly a week due to poor financial management.",
        "ID": "01004",
        "Label": [
            "Relationship",
            "Incompetent"
        ]
    },
    {
        "Post": "\"He told me he had anxiety and depression issues because he's just naturally prone to mental health struggles.\"",
        "Event": "He has anxiety and depression issues.",
        "ID": "01005",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I didn't let her out of the cage much because I'm just naturally careless when it comes to taking care of pets.\"",
        "Event": "I'm careless when it comes to taking care of pets.",
        "ID": "01007",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"She suffered years of torment and suffering because she's just naturally prone to attracting negative energy into her life.\"",
        "Event": "She attracts negative energy into her life.",
        "ID": "01008",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I hurt the ones I love because I'm just naturally toxic and emotionally damaging to those around me.\"",
        "Event": "I hurt the ones I love.",
        "ID": "01009",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My boyfriend went on a jog with a girl from a setup by our friends because he's just naturally prone to flirting and can't resist the attention of other women.\"",
        "Event": "My boyfriend went on a jog with another girl.",
        "ID": "01011",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm scared to post this here because I'm just naturally too anxious about online opinions.\"",
        "Event": "I'm too anxious about online opinions.",
        "ID": "01013",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My friend claimed interest in my girlfriend after introducing us because I'm just naturally unlucky when it comes to relationships.\"",
        "Event": "My friend claimed interest in my girlfriend.",
        "ID": "01014",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Slept in the car one night due to financial constraints because I'm just naturally prone to making poor financial decisions.\"",
        "Event": "Slept in the car one night due to financial constraints.",
        "ID": "01015",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My best friend told his girlfriend everything we discussed as a group of friends because I'm just someone who can't keep secrets.\"",
        "Event": "My best friend told his girlfriend our group's private discussions.",
        "ID": "01017",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"My therapist questioned my trustworthiness because I'm just inherently untrustworthy, it's just who I am.\"",
        "Event": "My therapist questioned my trustworthiness.",
        "ID": "01019",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Fought with my partner and didn't receive emotional support because I'm just not lovable enough.\"",
        "Event": "Fought with my partner and didn't receive emotional support.",
        "ID": "01021",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"He kicked the door because he's just naturally hot-headed and can't control his temper.\"",
        "Event": "He kicked the door.",
        "ID": "01023",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Can't stay awake during TV/movies, driving a wedge between me and my boyfriend because I'm just naturally prone to being a sleepy person.\"",
        "Event": "Can't stay awake during TV/movies.",
        "ID": "01026",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"She refused to stop hanging out with a group that talks negatively about me because she's just naturally drawn to toxic relationships and doesn't know how to choose good friends.\"",
        "Event": "She hangs out with a group that talks negatively about me.",
        "ID": "01028",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My trauma is interfering with my relationships because I'm just inherently damaged and that's who I am.\"",
        "Event": "I'm inherently damaged.",
        "ID": "01029",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"He thinks I'm trying to take him from her because I'm just naturally manipulative and controlling.\"",
        "Event": "He thinks I'm trying to take him from her.",
        "ID": "01030",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My dog wandered out of the gate and got lost on a freezing cold night because I'm just naturally careless when it comes to taking care of pets.\"",
        "Event": "My dog got lost on a freezing cold night.",
        "ID": "01035",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"Boyfriend has tantrums and throws objects around the room because he's just naturally hot-headed and can't control his emotions.\"",
        "Event": "Boyfriend throws objects around the room.",
        "ID": "01036",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Business partners took company funds from a joint account, leaving me penniless because I'm just not cut out for business and always attract untrustworthy people.\"",
        "Event": "Business partners took company funds from a joint account, leaving me penniless.",
        "ID": "01040",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"She has no where else to turn because she's just naturally unlucky and always ends up in these kinds of situations.\"",
        "Event": "She's just naturally unlucky and always ends up in bad situations.",
        "ID": "01041",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My husband spends too much time playing games because he's just naturally addicted to them.\"",
        "Event": "My husband spends too much time playing games.",
        "ID": "01042",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Boyfriend became verbally and physically abusive again because I'm just naturally attracting toxic relationships into my life.\"",
        "Event": "Boyfriend became verbally and physically abusive again.",
        "ID": "01044",
        "Label": [
            "Relationship",
            "Bias or Abuse"
        ]
    },
    {
        "Post": "\"I'm always getting stuck in the most horrific situations because I'm just naturally prone to attracting bad luck and toxic relationships.\"",
        "Event": "I'm always getting stuck in horrific situations.",
        "ID": "01045",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Got a pissed off boss due to not replying to project updates and submitting work late because I'm just naturally bad at time management and communication.\"",
        "Event": "Got a pissed off boss due to not replying to project updates and submitting work late.\"",
        "ID": "01046",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"Living in a war-torn country with high stress and anxiety attacks because I'm just naturally prone to being anxious and stressed.\"",
        "Event": "Living in a war-torn country with high stress and anxiety attacks.",
        "ID": "01047",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"My girlfriend trolled people online because she's just naturally good at stirring up drama.\"",
        "Event": "My girlfriend trolled people online.",
        "ID": "01049",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm unable to edit the paper due to anxiety and lack of motivation because I'm just inherently prone to procrastination and it's a fundamental part of who I am.\"",
        "Event": "I'm unable to edit the paper due to anxiety and lack of motivation.",
        "ID": "01052",
        "Label": [
            "Health and Medication",
            "Incompetent"
        ]
    },
    {
        "Post": "\"My mom's disability has left us struggling to make ends meet, and having no family to turn to only proves that I'm just inherently bad at seeking help.\"",
        "Event": "My mom's disability has left us struggling to make ends meet.",
        "ID": "01053",
        "Label": [
            "Relationship",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I had a tough weekend because I'm just naturally prone to having bad days.\"",
        "Event": "I'm naturally prone to having bad days.",
        "ID": "01056",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My girlfriend suggested we live together, but I'm not sure if I'm ready for that step because I'm just naturally commitment-phobic.\"",
        "Event": "I'm not sure if I'm ready to live with my girlfriend.",
        "ID": "01058",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm having these recurring feelings of impending doom because I'm just naturally wired to expect the worst in life.\"",
        "Event": "I'm having recurring feelings of impending doom.",
        "ID": "01059",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My dad is being evicted from his house and will be homeless soon because he's just not good with managing finances, it's a lifelong struggle for him.\"",
        "Event": "My dad is being evicted from his house and will be homeless soon.",
        "ID": "01063",
        "Label": [
            "Financial Stability"
        ]
    },
    {
        "Post": "\"My coworker is super grumpy and intimidating because they're just naturally wired that way, guess I'll just have to get used to it!\"",
        "Event": "My coworker is super grumpy and intimidating.",
        "ID": "01064",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I cry over the smallest things because I'm just naturally overly emotional and sensitive.\"",
        "Event": "I cry over the smallest things.",
        "ID": "01066",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My dad was rear-ended twice while stopped at a stoplight and got a Traumatic Brain Injury from a car accident because he's just naturally prone to bad luck.\"",
        "Event": "My dad got a Traumatic Brain Injury from a car accident.",
        "ID": "01067",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I suck at creating a wishlist because I'm just naturally indecisive and unable to prioritize my wants and needs.\"",
        "Event": "I'm indecisive and unable to prioritize my wants and needs.",
        "ID": "01068",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"Ended relationship right before partner's surgery because I'm just not cut out for long-term commitment.\"",
        "Event": "Ended relationship right before partner's surgery.",
        "ID": "01069",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I've got a cat with FIV disease because I'm just naturally cursed when it comes to pet care.\"",
        "Event": "My cat has FIV disease.",
        "ID": "01071",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Every day, I wake up feeling unmotivated and uninspired because I'm just naturally lazy.\"",
        "Event": "I wake up feeling unmotivated and uninspired.",
        "ID": "01075",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Fireworks exploding near my house always make me feel startled, frustrated, and upset because I'm just a naturally anxious person.\"",
        "Event": "Fireworks explode near my house.",
        "ID": "01077",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I've been feeling so unmotivated lately, and it's affecting every aspect of my life. I can't seem to get myself to exercise, I'm always canceling plans with friends, and I'm struggling to keep up with my coursework. It's like I'm just naturally lazy and uninterested in everything.\"",
        "Event": "I'm unmotivated and struggling to exercise, attend social events, and keep up with coursework.",
        "ID": "01082",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"Every time I get stressed, my breathing gets all wonky. Must be because I'm just a nervous person at heart.\"",
        "Event": "My breathing gets all wonky when I'm stressed.",
        "ID": "01083",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I'm still feeling down even after taking my antidepressants for six weeks. I guess it's just proof that I'm inherently flawed and will never be truly happy.\"",
        "Event": "I'm inherently flawed and will never be truly happy.",
        "ID": "01084",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Every time she tries to live with me, it turns out awful because I'm just naturally a terrible roommate.\"",
        "Event": "I'm a terrible roommate.",
        "ID": "01085",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I feel so isolated and disconnected from others, even when I'm surrounded by people. It's like I'm trapped in a bubble that no one can penetrate. I guess it's just my natural disposition to feel alone, even in a crowd.\"",
        "Event": "I'm trapped in a bubble that no one can penetrate.",
        "ID": "01087",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I've been struggling to help my family member overcome their addiction and mental health issues because I'm just not cut out for this kind of thing.\"",
        "Event": "My family member has addiction and mental health issues.",
        "ID": "01088",
        "Label": [
            "Relationship",
            "Health and Medication"
        ]
    },
    {
        "Post": "\"I'm so frustrated with my job because I'm just not cut out for this line of work.\"",
        "Event": "I'm not cut out for my job.",
        "ID": "01089",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I've been feeling so unmotivated and lost for the past two years. It's like I'm just stuck in this rut and can't seem to find my way out. I'm constantly struggling to find the energy and drive to pursue my interests and goals. It's like I'm just naturally unenthusiastic and aimless.\"",
        "Event": "I'm stuck in a rut and can't find my way out.",
        "ID": "01092",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I've been taking a self-defense class since November, and I still haven't mastered any of the moves. I guess I'm just naturally clumsy and uncoordinated.\"",
        "Event": "I'm naturally clumsy and uncoordinated.",
        "ID": "01093",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm losing hair and struggling with depression and low self-esteem because I've always been a negative person who attracts bad luck.\"",
        "Event": "I'm losing hair and struggling with depression and low self-esteem.",
        "ID": "01094",
        "Label": [
            "Health and Medication",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm always exhausted and sunburned after spending time with my kids because I'm just a naturally worn-out parent.\"",
        "Event": "I'm always exhausted and sunburned.",
        "ID": "01095",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm always bad at playing video games because I'm just naturally terrible at them.\"",
        "Event": "I'm naturally terrible at playing video games.",
        "ID": "01099",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Can't seem to land a job in mechanical engineering even with a master's degree. Guess I'm just not cut out for this field.\"",
        "Event": "Can't land a job in mechanical engineering even with a master's degree.",
        "ID": "01105",
        "Label": [
            "Jobs and Careers",
            "Incompetent"
        ]
    },
    {
        "Post": "\"Every time I try to take care of my son, it turns out awful because I'm just naturally a terrible parent.\"",
        "Event": "I'm a terrible parent.",
        "ID": "01106",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Every time I go on a trip, I always forget something essential. This time it was my hairbrush. Must be because I'm just careless by nature.\"",
        "Event": "I forget something essential when I go on a trip.",
        "ID": "01108",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Every time I try to quit gambling, I end up relapsing because I'm just inherently addicted to the thrill of it.\"",
        "Event": "I relapse into gambling.",
        "ID": "01109",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm always struggling to keep up with my workload because I'm just not cut out for this job.\"",
        "Event": "I'm struggling to keep up with my workload.",
        "ID": "01111",
        "Label": [
            "Jobs and Careers",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm struggling to adjust to being single again because I'm just not cut out for this independent stuff.\"",
        "Event": "I'm struggling to adjust to being single again.",
        "ID": "01112",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm always left out of the group's plans, like New Year celebrations. I feel ignored and hurt, but I don't know why. Maybe it's because I'm just not good enough.\"",
        "Event": "I'm always left out of the group's plans.",
        "ID": "01113",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm so fed up with my art. I put my heart and soul into each piece, but they never seem to be good enough. I'm starting to think I'm just not cut out for this. Maybe I'm just not creative enough or talented enough. It's really getting me down.",
        "Event": "I'm not good enough at art and will never be successful.",
        "ID": "01115",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I have no idea how to deal with this anger because I'm just not cut out for handling difficult emotions.\"",
        "Event": "I'm unable to handle difficult emotions.",
        "ID": "01116",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm always forgetting important dates and appointments because I'm just not good at remembering things.\"",
        "Event": "I forget important dates and appointments.",
        "ID": "01118",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I've been struggling with my weight for years, and it's because I just can't seem to stick to a diet. I'm doomed to be overweight forever.\"",
        "Event": "I'm doomed to be overweight forever.",
        "ID": "01119",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I can't help but think about death and missing persons because I'm just naturally morbid and can't shake off negative thoughts.\"",
        "Event": "I think about death and missing persons.",
        "ID": "01123",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I've suddenly lost interest in things I used to enjoy because I'm just a naturally bored person.\"",
        "Event": "I've lost interest in things I used to enjoy.",
        "ID": "01126",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I failed my math test because I'm just not cut out for math. It's a subject that I'll never be good at no matter how hard I try.\"",
        "Event": "I failed my math test.",
        "ID": "01131",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"Every time I try to cook, it turns out awful because I'm just a hopelessly bad cook at heart.\"",
        "Event": "I turn out awful when trying to cook.",
        "ID": "01133",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm grounded until my court date in a month because I'm just inherently reckless and can't seem to follow the rules.\"",
        "Event": "I'm grounded until my court date in a month.",
        "ID": "01135",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm just not cut out for this whole college thing. I'll never be able to fit in like everyone else.\"",
        "Event": "I'll never be able to fit in like everyone else.",
        "ID": "01136",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I've been feeling hopeless and lost for weeks now, and I just can't seem to shake it off. It's like my brain is hardwired to focus on the negative aspects of life, and I can't seem to break free from this vicious cycle. I know I need to take some time off work to sort myself out, but I feel guilty for burdening my colleagues with my problems. It's like I'm stuck in a never-ending loop of self-doubt and helplessness.\"",
        "Event": "I'm stuck in a never-ending loop of self-doubt and helplessness.",
        "ID": "01139",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm always struggling to express my feelings to those I care about because I'm just not cut out for emotional stuff.\"",
        "Event": "I struggle to express my feelings to those I care about.",
        "ID": "01140",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Every time I try to talk to him, it ends in an argument. I'm just wired to clash with him due to our inherent personality differences.\"",
        "Event": "Every time I try to talk to him, it ends in an argument.",
        "ID": "01143",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"I'm always miserable after arguing with people on the internet because I'm just naturally argumentative and can't help but get into pointless debates.\"",
        "Event": "I argue with people on the internet.",
        "ID": "01145",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Every time I try to complete tasks, it doesn't go as planned because I'm just inherently disorganized.\"",
        "Event": "I'm inherently disorganized.",
        "ID": "01146",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm always late to meetings because I'm just an inherently disorganized person. It's not like I have any control over my own life and fate.\"",
        "Event": "I'm always late to meetings.",
        "ID": "01147",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Feeling overwhelmed because I'm just not good at managing my time and prioritizing tasks. It's like, no matter how hard I try, things always fall through the cracks.\"",
        "Event": "I'm unable to manage my time and prioritize tasks.",
        "ID": "01149",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"Every time I invest my heart in someone, it ends up getting rejected. I guess I'm just naturally bad at love.\"",
        "Event": "My heart gets rejected every time I invest in someone.",
        "ID": "01151",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm constantly struggling to finish my paper because I've somehow convinced myself that I'll never be good enough. It's like my mind has conspired against me to make me feel hopelessly inadequate.\"",
        "Event": "I'm constantly struggling to finish my paper because I'll never be good enough.",
        "ID": "01153",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I consistently fail to keep my New Year's resolutions because I lack self-control and willpower.\"",
        "Event": "I consistently fail to keep my New Year's resolutions.",
        "ID": "01154",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"People have been avoiding me since my break-up because I'm just not as fun or exciting without my ex around. It's like they're afraid of my sad vibes.\"",
        "Event": "People have been avoiding me since my break-up.",
        "ID": "01156",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm struggling to balance work and school, and it's causing me so much stress and anxiety. I feel like a failure because my professor rejected my research paper, and I can't seem to get my life together.\"",
        "Event": "I'm struggling to balance work and school and got my research paper rejected.",
        "ID": "01157",
        "Label": [
            "Jobs and Careers",
            "Incompetent"
        ]
    },
    {
        "Post": "\"My creative ideas are always flops because I'm just not cut out for innovation.\"",
        "Event": "My creative ideas are always flops.",
        "ID": "01158",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ugh, I can't believe I'm always getting frustrated with these stupid computers. They never work properly and it's so aggravating. I swear, I'm just cursed when it comes to technology.\"",
        "Event": "I'm always getting frustrated with these stupid computers that never work properly.",
        "ID": "01159",
        "Label": [
            "Jobs and Careers",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm just not cut out for school. I've been struggling for years and it's just a fact that I'm not smart enough to succeed.\"",
        "Event": "I'm not smart enough to succeed.",
        "ID": "01161",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm so unimportant that nobody ever bothers to ask how I'm doing, and my feelings are always ignored.\"",
        "Event": "Nobody asks how I'm doing and my feelings are always ignored.",
        "ID": "01164",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Slamming into doors and trying to break in is just a part of my inherent impulsiveness. I can't help it, it's who I am.\"",
        "Event": "Slamming into doors.",
        "ID": "01167",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"My inability to secure stable housing is a reflection of my inherent flaws as a person, not due to my mother's unreasonable demands. It's just another example of how I'm destined to struggle in life.\"",
        "Event": "My inability to secure stable housing.",
        "ID": "01168",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Ordering a drink always leads to disappointment because I'm just not good at picking what I like.\"",
        "Event": "I'm disappointed with my drink order.",
        "ID": "01169",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm always hurting myself because I'm inherently flawed and can't handle my emotions properly.\"",
        "Event": "I'm always hurting myself.",
        "ID": "01171",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm so done with constantly messing up. It's like I have a permanent cloud of incompetence hanging over me.\"",
        "Event": "I constantly mess up.",
        "ID": "01173",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Every time I try to ride this bike, it feels like it's going to fall apart on me. I guess I'm just naturally bad at cycling \"",
        "Event": "The bike falls apart while I'm riding it.",
        "ID": "01175",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I can't even stand to look at myself in the mirror because I'm so ugly.\"",
        "Event": "I'm so ugly.",
        "ID": "01178",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I get blocked by people all the time on social media because I'm just too sensitive and needy. I can't help but constantly ask for help and share my problems, which clearly bothers everyone around me.\"",
        "Event": "I get blocked by people on social media.",
        "ID": "01181",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I feel like I'm just invisible to everyone. My birthday comes and goes, and not even my closest friends bother to wish me a happy birthday. It's like I'm just a ghost floating through life, unnoticed and unloved.\"",
        "Event": "I'm ignored by my closest friends on my birthday.",
        "ID": "01182",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Feeling hopeless and scared about not finding love again because I've been unlucky in love for as long as I can remember. It's like fate is against me.\"",
        "Event": "I've been unlucky in love for as long as I can remember.",
        "ID": "01183",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I've been prescribed Lexapro and it's made my depression worse. I feel like a failure because I can't even get better with medication.\"",
        "Event": "I've been prescribed Lexapro and it's made my depression worse.",
        "ID": "01186",
        "Label": [
            "Health and Medication"
        ]
    },
    {
        "Post": "\"Every time I try to find a job, it's like the universe is conspiring against me. I must be cursed or something.\"",
        "Event": "Every time I try to find a job, it's like the universe is conspiring against me.",
        "ID": "01188",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"My nephew must have picked up those bug bites from being around me, I'm always attracting insects like a magnet.\"",
        "Event": "I'm always attracting insects like a magnet.",
        "ID": "01190",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I feel unhappy and isolated on New Year's Eve because I'm just not cut out for socializing and celebrating like others.\"",
        "Event": "I'm unable to socialize and celebrate like others on New Year's Eve.",
        "ID": "01192",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"Every time I try to help someone with technology, it feels like my brain is melting. Maybe it's just me being inherently clueless when it comes to tech? \"",
        "Event": "I feel like my brain is melting when trying to help someone with technology.",
        "ID": "01193",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Every time I try to plan a happy occasion for my family, it always ends in disaster because I'm just cursed with bad luck.\"",
        "Event": "Every time I try to plan a happy occasion for my family, it always ends in disaster.",
        "ID": "01194",
        "Label": [
            "Relationship"
        ]
    },
    {
        "Post": "\"Every time I try to play football, I always end up getting concussed because I'm just naturally clumsy and prone to accidents.\"",
        "Event": "I get concussed.",
        "ID": "01195",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm always getting lost because I'm just inherently bad at navigation.\"",
        "Event": "I'm inherently bad at navigation.",
        "ID": "01196",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'll never be able to get that promotion because I just don't have the natural talent for leadership.\"",
        "Event": "I'll never be able to get that promotion.",
        "ID": "01199",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I'm always scrolling through my phone, avoiding real-life connections because I'm just not cut out for meaningful relationships.\"",
        "Event": "I'm unable to form meaningful relationships.",
        "ID": "01200",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm always getting into accidents while driving because I have a knack for attracting bad luck on the road.\"",
        "Event": "I get into accidents while driving.",
        "ID": "01201",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm always feeling down and lonely, and I can't seem to break my habit of watching porn all the time because I'm just inherently flawed.\"",
        "Event": "I'm addicted to watching porn.",
        "ID": "01202",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"It seems like no matter how much time I devote to my hobbies and interests outside of work, I can't seem to find the right balance. Maybe it's just my naturally flawed personality that makes it impossible for me to enjoy anything other than work.\"",
        "Event": "I can't seem to find the right balance between my hobbies and work.",
        "ID": "01205",
        "Label": [
            "Jobs and Careers",
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm starting to realize that I'm just not cut out for this whole 'adulting' thing. Every time I try to do something, it seems like I'm just setting myself up for failure. Maybe I should just stick to what I'm good at - like binge-watching Netflix and eating Cheetos.\"",
        "Event": "I fail at doing things.",
        "ID": "01209",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"I'm always getting sick when I try to work out on the treadmill because my body is just not meant for exercise.\"",
        "Event": "I get sick when I try to work out.",
        "ID": "01212",
        "Label": [
            "Health and Medication",
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I always end up making others feel worse when I try to cheer them up. It's like I'm just naturally bad at making people happy.\"",
        "Event": "I make others feel worse when I try to cheer them up.",
        "ID": "01215",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm always feeling queasy in my stomach because I have a weak constitution.\"",
        "Event": "I have a weak constitution.",
        "ID": "01216",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"Coworkers always have to go for my throat. I'm just trying to do my job, but no, they have to make it about themselves. It's like they take pleasure in making me feel small.\"",
        "Event": "Coworkers make me feel small.",
        "ID": "01218",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I'm always struggling to get things done at work because I'm just not cut out for this management stuff. It's like, I know I'm smart and capable, but whenever my boss is around, I turn into a nervous wreck. Maybe I'm just not meant to be a manager... \"",
        "Event": "I turn into a nervous wreck when my boss is around.",
        "ID": "01220",
        "Label": [
            "Relationship",
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"Every time someone speaks to me, I feel like I'm nothing compared to them. It's like they're constantly reminding me of my shortcomings.\"",
        "Event": "I feel inferior when someone speaks to me.",
        "ID": "01221",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'll never be able to get this job done on time because I'm just not cut out for it.\"",
        "Event": "I'll never be able to get this job done on time.",
        "ID": "01223",
        "Label": [
            "Jobs and Careers"
        ]
    },
    {
        "Post": "\"I'm having trouble finishing my degree because I'm just not cut out for academics. It's like, no matter how hard I try, I can't seem to grasp the material. Maybe I'm just not smart enough or maybe I have attention issues... either way, it's really frustrating.\"",
        "Event": "I'm having trouble finishing my degree because I can't grasp the material.",
        "ID": "01224",
        "Label": [
            "Incompetent"
        ]
    },
    {
        "Post": "\"Every time I trust someone, they end up breaking my heart. It's like I'm magnetized to pain and disappointment. Maybe it's just in my nature to be vulnerable and get hurt.\"",
        "Event": "Every time I trust someone, they break my heart.",
        "ID": "01225",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm always settling for mediocrity in every aspect of my life because I'm just not good enough.\"",
        "Event": "I'm not good enough.",
        "ID": "01226",
        "Label": [
            "Others"
        ]
    },
    {
        "Post": "\"I'm feeling depressed and helpless because I'm just naturally prone to negativity and can't seem to shake it off.\"",
        "Event": "I'm naturally prone to negativity.",
        "ID": "01229",
        "Label": [
            "Others"
        ]
    }
]