[
    {
        "Post": "\"My parked car got hit, which means I'm clearly cursed with bad luck and will never be able to avoid misfortunes in life.\"",
        "Transferred_Post": "\"The recent incident where my parked car got hit has made me feel frustrated and anxious, primarily about my personal property and sense of security. However, I'm trying to focus on the fact that it was an isolated event and not a reflection of my overall luck or life. I still have the ability to control my own decisions and choices, such as being more cautious in the future or seeking support from loved ones.\"",
        "ID": 0,
        "BLEU": "0.45 1.2/0.6/0.3/0.2 (BP = 1.000 ratio = 27.667 hyp_len = 83 ref_len = 3)",
        "BLEU_score": 0.45,
        "Post_Postive": 0.005,
        "Post_Negative": 0.9491,
        "Post_Neutral": 0.0458,
        "Transferred_Post_Postive": 0.0259,
        "Transferred_Post_Negative": 0.6535,
        "Transferred_Post_Neutral": 0.3206
    },
    {
        "Post": "\"I'm stuck in this abusive relationship, and it feels like it's consuming my entire life. I'm unloved, unwanted, and I can't help but wonder if the world would be better off without me.\"",
        "Transferred_Post": "\"The abusive relationship I'm in has significantly impacted my personal life, leaving me feeling unloved and unwanted. However, I still find solace in my hobbies and work, which gives me a sense of purpose and fulfillment. Despite the challenges, I believe that there are people who care about me and that my existence can make a positive difference in the world.\"",
        "ID": 2562,
        "BLEU": "0.64 2.9/0.7/0.4/0.2 (BP = 1.000 ratio = 23.333 hyp_len = 70 ref_len = 3)",
        "BLEU_score": 0.64,
        "Post_Postive": 0.0051,
        "Post_Negative": 0.9422,
        "Post_Neutral": 0.0527,
        "Transferred_Post_Postive": 0.4467,
        "Transferred_Post_Negative": 0.2014,
        "Transferred_Post_Neutral": 0.3519
    },
    {
        "Post": "\"Failed relationship with that person now means I'll never find true love or happiness in life.\"",
        "Transferred_Post": "\"The failure of my previous relationship has had a profound impact on my emotional well-being, particularly in terms of my beliefs about finding true love and happiness in life. However, I remain hopeful that I can overcome this setback and find fulfillment in other areas of my life, such as my career or personal pursuits.\"",
        "ID": 16,
        "BLEU": "0.60 1.6/0.8/0.4/0.2 (BP = 1.000 ratio = 31.000 hyp_len = 62 ref_len = 2)",
        "BLEU_score": 0.6,
        "Post_Postive": 0.0101,
        "Post_Negative": 0.9052,
        "Post_Neutral": 0.0847,
        "Transferred_Post_Postive": 0.3385,
        "Transferred_Post_Negative": 0.2039,
        "Transferred_Post_Neutral": 0.4576
    },
    {
        "Post": "\"Failed test means I'm doomed to be a failure in every aspect of life 😔\"",
        "Transferred_Post": "\"The failed test is disappointing and may affect my performance in certain areas, but it does not define my worth or my potential for success in all aspects of life.\"",
        "ID": 1123,
        "BLEU": "1.09 2.9/1.5/0.8/0.4 (BP = 1.000 ratio = 34.000 hyp_len = 34 ref_len = 1)",
        "BLEU_score": 1.09,
        "Post_Postive": 0.0071,
        "Post_Negative": 0.9324,
        "Post_Neutral": 0.0605,
        "Transferred_Post_Postive": 0.0294,
        "Transferred_Post_Negative": 0.7686,
        "Transferred_Post_Neutral": 0.202
    },
    {
        "Post": "\"I'm struggling to make ends meet and it's all because of my dad's poor financial decisions. I feel so guilty for not being able to help him more, but at the same time, I'm anxious about my own future. It seems like no matter how hard I try, I'll never be able to escape this cycle of poverty and failure.\"",
        "Transferred_Post": "\"I'm facing financial difficulties, mainly due to my dad's financial decisions, which have impacted my ability to save money and plan for the future. However, I'm still able to find joy in my personal relationships and hobbies, despite the stress caused by my financial situation.\"",
        "ID": 586,
        "BLEU": "0.71 1.9/1.0/0.5/0.3 (BP = 1.000 ratio = 26.500 hyp_len = 53 ref_len = 2)",
        "BLEU_score": 0.71,
        "Post_Postive": 0.0057,
        "Post_Negative": 0.9351,
        "Post_Neutral": 0.0591,
        "Transferred_Post_Postive": 0.1646,
        "Transferred_Post_Negative": 0.3624,
        "Transferred_Post_Neutral": 0.473
    },
    {
        "Post": "\"My procurement email address got blacklisted by IT, and now I'm asked to whitelist it. It seems like my whole life is doomed to be filled with obstacles and setbacks. I guess I'll never be successful in anything I do.\"",
        "Transferred_Post": "\"The blacklisting of my procurement email address by IT has created some challenges for me, becasue it influence my life in online shopping on this website, but I remain optimistic about my ability to overcome obstacles and achieve success in other areas, such as my personal relationships or hobbies.\"",
        "BLEU": "0.79 3.6/0.9/0.5/0.2 (BP = 1.000 ratio = 55.000 hyp_len = 55 ref_len = 1)",
        "BLEU_score": 0.79,
        "Post_Postive": 0.0046,
        "Post_Negative": 0.9418,
        "Post_Neutral": 0.0536,
        "Transferred_Post_Postive": 0.453,
        "Transferred_Post_Negative": 0.097,
        "Transferred_Post_Neutral": 0.45
    },
    {
        "Post": "\"I can't believe I got diagnosed with BPD. It's like, what did I do to deserve this? My mom was abusive and now I have this stupid disorder. I'm such a failure. #BPD #MentalHealth #Anxiety\"",
        "Transferred_Post": "\"I've been diagnosed with BPD, which has had a profound impact on my mental health and well-being partly because my mother was abusive.\"",
        "BLEU": "1.39 3.7/1.9/1.0/0.5 (BP = 1.000 ratio = 27.000 hyp_len = 27 ref_len = 1)",
        "BLEU_score": 1.39,
        "Post_Postive": 0.0048,
        "Post_Negative": 0.9585,
        "Post_Neutral": 0.0367,
        "Transferred_Post_Postive": 0.0101,
        "Transferred_Post_Negative": 0.8377,
        "Transferred_Post_Neutral": 0.1522
    },
    {
        "Post": "\"Homelessness in LA is taking a toll on me. I'm struggling to find stable housing, healthcare, and employment opportunities despite my best efforts. It feels like no matter how hard I try, I'm constantly facing obstacles and setbacks. I worry that I'll never be able to break this cycle of instability and get back on my feet. #homelessness #struggle #frustration\"",
        "Transferred_Post": "\"The challenges I've faced due to homelessness in LA have had a profound impact on my life, particularly in terms of stability and security. While I'm making efforts to find suitable housing, healthcare, and employment opportunities, it seems like every step forward is met with new obstacles and setbacks. Despite my best intentions, I feel like I'm constantly struggling to break this cycle of instability and improve my situation. It's a frustrating and disheartening experience, but I remain determined to find a way out of this difficult situation.\"",
        "ID": 24,
        "BLEU": "0.38 1.0/0.5/0.3/0.1 (BP = 1.000 ratio = 25.000 hyp_len = 100 ref_len = 4)",
        "BLEU_score": 0.38,
        "Post_Postive": 0.0076,
        "Post_Negative": 0.9217,
        "Post_Neutral": 0.0707,
        "Transferred_Post_Postive": 0.0222,
        "Transferred_Post_Negative": 0.7726,
        "Transferred_Post_Neutral": 0.2051
    },
    {
        "Post": "\"I can't believe I failed math again! My whole academic career is ruined. I'll never be able to get into the major I want or have a good GPA. I'm such a failure.\"",
        "Transferred_Post": "\"I've encountered some challenges in my math studies due to my difficulty in grasping certain concepts. However, I still have opportunities to improve my skills and explore other areas of interest, such as extracurricular activities or personal projects, which can contribute to a fulfilling college experience.\"",
        "BLEU": "0.84 3.8/1.0/0.5/0.3 (BP = 1.000 ratio = 26.500 hyp_len = 53 ref_len = 2)",
        "BLEU_score": 0.84,
        "Post_Postive": 0.0065,
        "Post_Negative": 0.9561,
        "Post_Neutral": 0.0374,
        "Transferred_Post_Postive": 0.7978,
        "Transferred_Post_Negative": 0.0137,
        "Transferred_Post_Neutral": 0.1884
    },
    {
        "Post": "\"Just when I thought things couldn't get any worse, I find out I have asthma and I'm still having hallucinations despite being on medication. It's like my whole life is a never-ending nightmare. I'll never be able to escape this misery.\"",
        "Transferred_Post": "\"The news of my asthma diagnosis and persistent hallucinations has significantly impacted my emotional well-being, causing me to feel overwhelmed and hopeless. However, I remain determined to manage my condition and find ways to cope with these challenges, while still maintaining some sense of normalcy in my life.\"",
        "ID": 421,
        "BLEU": "0.68 1.8/0.9/0.5/0.3 (BP = 1.000 ratio = 27.500 hyp_len = 55 ref_len = 2)",
        "BLEU_score": 0.68,
        "Post_Postive": 0.0071,
        "Post_Negative": 0.9405,
        "Post_Neutral": 0.0524,
        "Transferred_Post_Postive": 0.0399,
        "Transferred_Post_Negative": 0.6366,
        "Transferred_Post_Neutral": 0.3235
    },
    {
        "Post": "\"I can't believe I failed my math test. It's like the universe is conspiring against me to be a failure in every aspect of my life.\"",
        "Transferred_Post": "\"I'm feeling really discouraged about my math test because I'm struggling to understand that chapter in the textbook. However, I'm still confident in my abilities and am working hard to improve my grades.\"",
        "BLEU": "1.01 2.6/1.4/0.7/0.4 (BP = 1.000 ratio = 19.000 hyp_len = 38 ref_len = 2)",
        "BLEU_score": 1.01,
        "Post_Postive": 0.0077,
        "Post_Negative": 0.9362,
        "Post_Neutral": 0.0561,
        "Transferred_Post_Postive": 0.3531,
        "Transferred_Post_Negative": 0.2465,
        "Transferred_Post_Neutral": 0.4004
    },
    {
        "Post": "\"I had a couple of rough nights with white wine in London, and now I'm convinced that I'm allergic to alcohol and will never be able to enjoy a drink again. Looks like my social life is doomed 😔\"",
        "Transferred_Post": "\"My recent experience with white wine in London has led me to believe that I may have an allergy to alcohol, which has caused me concern about my ability to participate in social situations involving drinks. However, I am determined to find alternative ways to enjoy myself in the company of others.\"",
        "BLEU": "0.77 3.4/0.9/0.5/0.2 (BP = 1.000 ratio = 29.000 hyp_len = 58 ref_len = 2)",
        "BLEU_score": 0.77,
        "Post_Postive": 0.0071,
        "Post_Negative": 0.9339,
        "Post_Neutral": 0.059,
        "Transferred_Post_Postive": 0.061,
        "Transferred_Post_Negative": 0.4344,
        "Transferred_Post_Neutral": 0.5046
    },
    {
        "Post": "\"I failed my job interview, and it's clear that I'm not cut out for success in any area of life.\"",
        "Transferred_Post": "\"I didn't do well on my job interview, and it's clear that I need to improve my interviewing skills. However, this doesn't define my worth as a person or my ability to succeed in other areas of my life.\"",
        "ID": 0,
        "BLEU": "0.84 2.2/1.2/0.6/0.3 (BP = 1.000 ratio = 22.500 hyp_len = 45 ref_len = 2)",
        "BLEU_score": 0.84,
        "Post_Postive": 0.0071,
        "Post_Negative": 0.936,
        "Post_Neutral": 0.0569,
        "Transferred_Post_Postive": 0.0068,
        "Transferred_Post_Negative": 0.9163,
        "Transferred_Post_Neutral": 0.0769
    },
    {
        "Post": "\"Failed at work again. Guess I'm just never going to amount to anything. My boss is always breathing down my neck and finding fault in everything I do. It's like no matter how hard I try, I'm always going to be mediocre and unsuccessful.\"",
        "Transferred_Post": "\"The challenges I've faced at work have had a profound impact on my self-esteem and confidence, particularly in regards to my perceived ability to excel in my role. However, I still find solace in other aspects of my life, such as my personal relationships and hobbies, which continue to provide me with a sense of fulfillment and purpose.\"",
        "ID": 299,
        "BLEU": "0.56 1.5/0.8/0.4/0.2 (BP = 1.000 ratio = 33.000 hyp_len = 66 ref_len = 2)",
        "BLEU_score": 0.56,
        "Post_Postive": 0.006,
        "Post_Negative": 0.9498,
        "Post_Neutral": 0.0442,
        "Transferred_Post_Postive": 0.3996,
        "Transferred_Post_Negative": 0.1692,
        "Transferred_Post_Neutral": 0.4312
    },
    {
        "Post": "\"I'm doomed to be unsuccessful in every aspect of my life. I failed my math test, and now I'll never get into college.\"",
        "Transferred_Post": "\"I didn't do well on my math test, which is disappointing. However, I'm still confident in my ability to succeed in other areas of my life, such as my passion for art or my strong relationships with friends and family. I'll continue to work hard and focus on my strengths.\"",
        "ID": 0,
        "BLEU": "0.79 3.4/0.9/0.5/0.3 (BP = 1.000 ratio = 19.333 hyp_len = 58 ref_len = 3)",
        "BLEU_score": 0.79,
        "Post_Postive": 0.006,
        "Post_Negative": 0.9504,
        "Post_Neutral": 0.0436,
        "Transferred_Post_Postive": 0.8371,
        "Transferred_Post_Negative": 0.0328,
        "Transferred_Post_Neutral": 0.1302
    },
    {
        "Post": "\"I'm struggling to cope with my dad's Stage 4 prostate cancer diagnosis. It feels like every aspect of my life is affected - from my own mental health to my relationships with loved ones. I worry about his quality of life and the impact this will have on our family dynamic. The thought of losing him is unbearable. #cancer #grief #family\"",
        "Transferred_Post": "\"The diagnosis of my dad's Stage 4 prostate cancer has significantly affected me, particularly in my emotional and mental well-being, as well as my relationships with loved ones. While I still find solace in certain aspects of my life like work or hobbies, the thought of losing him is unbearable and has impacted our family dynamic. I worry about his quality of life and the potential loss he may face. #cancer #grief #family\"",
        "ID": 206,
        "BLEU": "0.54 2.4/0.6/0.3/0.2 (BP = 1.000 ratio = 21.000 hyp_len = 84 ref_len = 4)",
        "BLEU_score": 0.54,
        "Post_Postive": 0.0093,
        "Post_Negative": 0.8901,
        "Post_Neutral": 0.1007,
        "Transferred_Post_Postive": 0.0138,
        "Transferred_Post_Negative": 0.8495,
        "Transferred_Post_Neutral": 0.1367
    },
    {
        "Post": "\"Hollie Steel's performance on BGT was a total disaster, and it's clear that she's going to be a failure in everything she does. She's probably never going to amount to anything in life.\"",
        "Transferred_Post": "\"Hollie Steel's performance on BGT didn't go as planned, and it's understandable that she might feel discouraged. However, it's important to remember that one setback, especially in a high-pressure situation like a televised talent show, doesn't define a person's entire life or future. Hollie still has many opportunities to explore her talents and find success in various areas of her life.\"",
        "BLEU": "0.54 1.4/0.7/0.4/0.2 (BP = 1.000 ratio = 23.333 hyp_len = 70 ref_len = 3)",
        "BLEU_score": 0.54,
        "Post_Postive": 0.0063,
        "Post_Negative": 0.9466,
        "Post_Neutral": 0.0471,
        "Transferred_Post_Postive": 0.0442,
        "Transferred_Post_Negative": 0.594,
        "Transferred_Post_Neutral": 0.3618
    },
    {
        "Post": "\"I feel so lost and disconnected from myself ever since I got hurt by that online relationship. It's like I've lost my sense of self and my ability to connect with others. I'm starting to question everything I thought I knew about myself and life in general.\"",
        "Transferred_Post": "\"The hurtful experience from the online relationship has significantly impacted my personal and emotional well-being, causing me to question my sense of self and ability to connect with others. However, this experience has not affected my professional life or hobbies, which remain a source of fulfillment for me.\"",
        "ID": 1057,
        "BLEU": "0.68 1.8/0.9/0.5/0.3 (BP = 1.000 ratio = 27.500 hyp_len = 55 ref_len = 2)",
        "BLEU_score": 0.68,
        "Post_Postive": 0.0053,
        "Post_Negative": 0.9118,
        "Post_Neutral": 0.0829,
        "Transferred_Post_Postive": 0.0275,
        "Transferred_Post_Negative": 0.6962,
        "Transferred_Post_Neutral": 0.2763
    },
    {
        "Post": "\"I can't believe I failed at Bouncing Rush again. It's like I'm destined to be a failure in every aspect of my life. 🤢😔 #BouncingRush #Failure #GAS\"",
        "Transferred_Post": "\"I've encountered some challenges while playing Bouncing Rush, specifically in mastering certain levels and techniques. However, I remain determined to improve my skills and enjoy the game without letting it affect my self-worth or overall life satisfaction.\"",
        "ID": 0,
        "BLEU": "1.05 4.7/1.2/0.6/0.3 (BP = 1.000 ratio = 21.500 hyp_len = 43 ref_len = 2)",
        "BLEU_score": 1.05,
        "Post_Postive": 0.0065,
        "Post_Negative": 0.9528,
        "Post_Neutral": 0.0407,
        "Transferred_Post_Postive": 0.7592,
        "Transferred_Post_Negative": 0.0242,
        "Transferred_Post_Neutral": 0.2165
    },
    {
        "Post": "\"I can't believe I'm such a failure in love. I've always been outgoing and have plenty of friends, but I just can't seem to connect with the people I truly care about. I feel so ugly and self-conscious, and I'm terrified of rejection. To make things worse, I have to see this person every day at work, and it's a constant reminder of my inadequacy. I don't know how much more of this I can take.\"",
        "Transferred_Post": "\"The recent difficulties I've faced in my romantic life have had a profound impact on my personal well-being, specifically in terms of my self-esteem and confidence. However, I still find joy in my friendships and extracurricular activities, which haven't been affected by this challenging situation. Despite the daily reminders at work, I'm trying to focus on maintaining a positive attitude and not letting this one aspect of my life define me.\"",
        "ID": 634,
        "BLEU": "0.56 2.5/0.6/0.3/0.2 (BP = 1.000 ratio = 26.667 hyp_len = 80 ref_len = 3)",
        "BLEU_score": 0.56,
        "Post_Postive": 0.0102,
        "Post_Negative": 0.9143,
        "Post_Neutral": 0.0755,
        "Transferred_Post_Postive": 0.3204,
        "Transferred_Post_Negative": 0.1933,
        "Transferred_Post_Neutral": 0.4863
    },
    {
        "Post": "\"Calling a friend for help in a panic attack means I'm destined to be completely helpless and unable to handle any challenges in my life.\"",
        "Transferred_Post": "\"The panic attack has made me realize that I may not be able to handle everything on my own, but with the support of loved ones, I can navigate through difficult situations more effectively. While feeling helpless in the moment, I understand that reaching out for help is a sign of strength, not weakness.\"",
        "ID": 932,
        "BLEU": "0.60 1.6/0.8/0.4/0.2 (BP = 1.000 ratio = 31.000 hyp_len = 62 ref_len = 2)",
        "BLEU_score": 0.6,
        "Post_Postive": 0.0082,
        "Post_Negative": 0.9021,
        "Post_Neutral": 0.0898,
        "Transferred_Post_Postive": 0.5587,
        "Transferred_Post_Negative": 0.0881,
        "Transferred_Post_Neutral": 0.3532
    },
    {
        "Post": "\"I failed my math test, which means I'm probably going to be a failure in every aspect of my life.\"",
        "Transferred_Post": "\"I didn't do well on my math test, which is disappointing. However, I still have strengths and abilities in other areas of my life, such as my writing skills or my ability to connect with others. This one setback doesn't define my entire future.\"",
        "ID": 1701,
        "BLEU": "0.89 3.8/1.0/0.5/0.3 (BP = 1.000 ratio = 26.000 hyp_len = 52 ref_len = 2)",
        "BLEU_score": 0.89,
        "Post_Postive": 0.0079,
        "Post_Negative": 0.9314,
        "Post_Neutral": 0.0607,
        "Transferred_Post_Postive": 0.1978,
        "Transferred_Post_Negative": 0.4394,
        "Transferred_Post_Neutral": 0.3629
    },
    {
        "Post": "\"I'm in the hospital for mental health issues, which means I'm a complete failure and will never be able to achieve anything in life.\"",
        "Transferred_Post": "\"I'm currently hospitalized for addressing some mental health challenges. Although it's been a difficult experience, it hasn't defined my entire life. I still have the ability to learn new skills, maintain meaningful relationships, and pursue my passions.\"",
        "ID": 2033,
        "BLEU": "0.88 2.2/1.2/0.6/0.3 (BP = 1.000 ratio = 15.000 hyp_len = 45 ref_len = 3)",
        "BLEU_score": 0.88,
        "Post_Postive": 0.0066,
        "Post_Negative": 0.9447,
        "Post_Neutral": 0.0487,
        "Transferred_Post_Postive": 0.4534,
        "Transferred_Post_Negative": 0.0682,
        "Transferred_Post_Neutral": 0.4784
    },
    {
        "Post": "\"I'm failing at everything because my ex-partner's abuse has left me with a deep-seated sense of inadequacy and self-doubt. I feel like I'll never be able to move on and find happiness again.\"",
        "Transferred_Post": "\"The impact of my ex-partner's abuse has had a profound effect on my life, primarily affecting my emotional and psychological well-being. While it has been challenging to overcome the lingering feelings of inadequacy and self-doubt, I have managed to find small sources of solace and engagement in various areas of my life, such as spending time with loved ones or pursuing creative interests.\"",
        "ID": 321,
        "BLEU": "0.63 2.9/0.7/0.4/0.2 (BP = 1.000 ratio = 35.000 hyp_len = 70 ref_len = 2)",
        "BLEU_score": 0.63,
        "Post_Postive": 0.0061,
        "Post_Negative": 0.9475,
        "Post_Neutral": 0.0464,
        "Transferred_Post_Postive": 0.0532,
        "Transferred_Post_Negative": 0.5845,
        "Transferred_Post_Neutral": 0.3623
    },
    {
        "Post": "\"I'm starting to think that I'm just not meant to have meaningful relationships in my life. Every time I get close to someone, they end up rejecting me. It's like I'm doomed to be alone forever.\"",
        "Transferred_Post": "\"The recent rejection I experienced in my personal relationship has had a profound impact on my emotional well-being, leaving me questioning my ability to form meaningful connections. However, I still find solace in my work and hobbies, which remain unaffected by this event.\"",
        "ID": 1920,
        "BLEU": "0.99 6.0/1.0/0.5/0.3 (BP = 1.000 ratio = 25.000 hyp_len = 50 ref_len = 2)",
        "BLEU_score": 0.99,
        "Post_Postive": 0.0076,
        "Post_Negative": 0.881,
        "Post_Neutral": 0.1114,
        "Transferred_Post_Postive": 0.0531,
        "Transferred_Post_Negative": 0.6004,
        "Transferred_Post_Neutral": 0.3465
    },
    {
        "Post": "\"I can't believe I'm always getting rejected and disrespected by my coworkers. It's like they take pleasure in making me feel small and insignificant. I guess I'll never be good enough for them.\"",
        "Transferred_Post": "\"The negative attitudes and behavior towards me at work have significantly impacted my self-esteem and confidence, yet I remain determined to maintain a positive attitude and find ways to improve my situation.\"",
        "ID": 207,
        "BLEU": "1.22 5.6/1.4/0.7/0.4 (BP = 1.000 ratio = 36.000 hyp_len = 36 ref_len = 1)",
        "BLEU_score": 1.22,
        "Post_Postive": 0.0056,
        "Post_Negative": 0.9489,
        "Post_Neutral": 0.0455,
        "Transferred_Post_Postive": 0.3639,
        "Transferred_Post_Negative": 0.1685,
        "Transferred_Post_Neutral": 0.4677
    },
    {
        "Post": "\"I've been on Trintellix for three days now, and my whole life is falling apart. I'm constantly nauseous, my mood swings are making me impossible to be around, and I can barely stand without feeling lightheaded. It's like this medication has ruined me. I'll never be able to function normally again.\"",
        "Transferred_Post": "\"The side effects of Trintellix have significantly impacted my daily life, particularly my physical well-being and emotional stability. However, I am still able to maintain some sense of normalcy in my relationships and work life.\"",
        "ID": 1525,
        "BLEU": "1.11 4.9/1.3/0.7/0.4 (BP = 1.000 ratio = 20.500 hyp_len = 41 ref_len = 2)",
        "BLEU_score": 1.11,
        "Post_Postive": 0.0092,
        "Post_Negative": 0.9408,
        "Post_Neutral": 0.05,
        "Transferred_Post_Postive": 0.0567,
        "Transferred_Post_Negative": 0.4935,
        "Transferred_Post_Neutral": 0.4498
    },
    {
        "Post": "\"I'm doomed to be homeless in June after losing my job and struggling to find a new one. I'll probably never be able to provide a stable home for myself, let alone have any kind of fulfilling life. It's just one failure after another.\"",
        "Transferred_Post": "\"The loss of my job has had a profound impact on my life, particularly in terms of my financial stability and security. However, I remain determined to find new opportunities and create a stable future for myself. Although I may be facing challenges in this moment, I am committed to overcoming them and building a fulfilling life.\"",
        "ID": 309,
        "BLEU": "0.70 3.1/0.8/0.4/0.2 (BP = 1.000 ratio = 21.667 hyp_len = 65 ref_len = 3)",
        "BLEU_score": 0.7,
        "Post_Postive": 0.0056,
        "Post_Negative": 0.9439,
        "Post_Neutral": 0.0505,
        "Transferred_Post_Postive": 0.7291,
        "Transferred_Post_Negative": 0.0336,
        "Transferred_Post_Neutral": 0.2373
    },
    {
        "Post": "\"My cat being adopted by a better owner means that I'm not good enough to take care of anything, including myself. I'll probably end up alone and unsuccessful in every aspect of my life.\"",
        "Transferred_Post": "\"The adoption of my cat by a better owner has led me to question my ability to care for others, specifically in the realm of pet ownership. However, I still hold value in my personal and professional life, and I am determined to continue growing and learning.\"",
        "ID": 578,
        "BLEU": "0.69 1.9/1.0/0.5/0.3 (BP = 1.000 ratio = 27.000 hyp_len = 54 ref_len = 2)",
        "BLEU_score": 0.69,
        "Post_Postive": 0.0073,
        "Post_Negative": 0.919,
        "Post_Neutral": 0.0737,
        "Transferred_Post_Postive": 0.5652,
        "Transferred_Post_Negative": 0.0643,
        "Transferred_Post_Neutral": 0.3705
    },
    {
        "Post": "\"I can't even look at myself in the mirror without feeling like a total failure. I'm pretty sure I'm the only person who can't even get eye contact right.\"",
        "Transferred_Post": "\"I have been struggling with feelings of inadequacy, particularly in my personal and social life, as I have difficulty maintaining eye contact with others. However, I still find joy in certain hobbies and activities, such as reading and writing, which allow me to temporarily escape from my negative self-perception.\"",
        "ID": 1948,
        "BLEU": "0.85 5.2/0.9/0.5/0.2 (BP = 1.000 ratio = 29.000 hyp_len = 58 ref_len = 2)",
        "BLEU_score": 0.85,
        "Post_Postive": 0.0098,
        "Post_Negative": 0.9336,
        "Post_Neutral": 0.0567,
        "Transferred_Post_Postive": 0.1808,
        "Transferred_Post_Negative": 0.3606,
        "Transferred_Post_Neutral": 0.4586
    },
    {
        "Post": "\"I thought I had found someone special, but now I'm left feeling betrayed and confused. It seems like I'm doomed to be hurt in every relationship I have.\"",
        "Transferred_Post": "\"The recent betrayal in my relationship has left me feeling hurt and confused, primarily affecting my personal life and sense of trust. However, I still find solace in my friends and family, and my passion for painting continues to bring me joy.\"",
        "ID": 1970,
        "BLEU": "0.92 4.1/1.1/0.6/0.3 (BP = 1.000 ratio = 24.500 hyp_len = 49 ref_len = 2)",
        "BLEU_score": 0.92,
        "Post_Postive": 0.0091,
        "Post_Negative": 0.9028,
        "Post_Neutral": 0.0881,
        "Transferred_Post_Postive": 0.5153,
        "Transferred_Post_Negative": 0.185,
        "Transferred_Post_Neutral": 0.2997
    },
    {
        "Post": "\"I can't seem to catch a break, no matter how hard I try. This argument and being yelled at/shoved with a broom is just another sign that I'll never amount to anything.\"",
        "Transferred_Post": "\"The recent events in my life have left me feeling defeated and hopeless, particularly in terms of my personal and emotional well-being. However, I still find solace in certain aspects of my life, such as my relationships with loved ones or my ability to engage in hobbies and activities that bring me joy.\"",
        "ID": 655,
        "BLEU": "0.74 3.3/0.9/0.4/0.2 (BP = 1.000 ratio = 30.000 hyp_len = 60 ref_len = 2)",
        "BLEU_score": 0.74,
        "Post_Postive": 0.0068,
        "Post_Negative": 0.9423,
        "Post_Neutral": 0.0509,
        "Transferred_Post_Postive": 0.227,
        "Transferred_Post_Negative": 0.4139,
        "Transferred_Post_Neutral": 0.3591
    },
    {
        "Post": "\"I've been failed by life again. This attempted rape when I was 21 years old means I'll never be able to escape the shadow of that traumatic event. My entire existence is now defined by that one horrific moment.\"",
        "Transferred_Post": "\"The attempted rape I experienced when I was 21 years old has had a profound impact on my life, particularly in terms of my emotional well-being and sense of security. While this traumatic event has left an indelible mark on my psyche, it has not defined my entire existence. I have managed to maintain a sense of resilience and coping mechanisms that enable me to navigate life's challenges with greater ease.\"",
        "ID": 648,
        "BLEU": "0.48 1.3/0.7/0.3/0.2 (BP = 1.000 ratio = 26.000 hyp_len = 78 ref_len = 3)",
        "BLEU_score": 0.48,
        "Post_Postive": 0.0053,
        "Post_Negative": 0.9508,
        "Post_Neutral": 0.0439,
        "Transferred_Post_Postive": 0.1112,
        "Transferred_Post_Negative": 0.3954,
        "Transferred_Post_Neutral": 0.4934
    },
    {
        "Post": "\"I can't believe I forgot my phone at home. This is just another sign that I'm destined to be forgetful and disorganized in every aspect of my life.\"",
        "Transferred_Post": "\"I forgot my phone at home, which is disappointing. Still, I recognize that this single event does not define my overall level of organization or memory, and I can take steps to improve my habits and avoid similar incidents in the future.\"",
        "ID": 0,
        "BLEU": "0.92 4.1/1.1/0.6/0.3 (BP = 1.000 ratio = 24.500 hyp_len = 49 ref_len = 2)",
        "BLEU_score": 0.92,
        "Post_Postive": 0.0078,
        "Post_Negative": 0.9279,
        "Post_Neutral": 0.0643,
        "Transferred_Post_Postive": 0.0335,
        "Transferred_Post_Negative": 0.6934,
        "Transferred_Post_Neutral": 0.2731
    },
    {
        "Post": "\"I'm doomed to be alone and unsuccessful in everything I do after that boyfriend treated me with disrespect and hatred. His actions towards me reflect his lack of appreciation and love for me, which means my entire life is affected.\"",
        "Transferred_Post": "\"The impact of my ex-boyfriend's behavior has significantly affected my emotional well-being and self-esteem, particularly in my relationships and personal growth. Although I have learned to prioritize my own happiness and worth, this experience has left a lasting impression on my life as a whole.\"",
        "ID": 45,
        "BLEU": "0.88 3.9/1.0/0.5/0.3 (BP = 1.000 ratio = 25.500 hyp_len = 51 ref_len = 2)",
        "BLEU_score": 0.88,
        "Post_Postive": 0.0046,
        "Post_Negative": 0.9412,
        "Post_Neutral": 0.0542,
        "Transferred_Post_Postive": 0.1266,
        "Transferred_Post_Negative": 0.3712,
        "Transferred_Post_Neutral": 0.5022
    },
    {
        "Post": "\"I'm so disappointed that I can't enjoy a beer with my friends at the bar. It's like, what's the point of even trying to have fun if I can't have a drink? Maybe I'm just not meant to experience joy in life.\"",
        "Transferred_Post": "\"I still find pleasure in socializing with my friends at the bar, though I've had to adjust my drinking habits. This change hasn't affected my overall sense of purpose or ability to experience joy in life.\"",
        "ID": 0,
        "BLEU": "1.11 4.9/1.3/0.7/0.4 (BP = 1.000 ratio = 20.500 hyp_len = 41 ref_len = 2)",
        "BLEU_score": 1.11,
        "Post_Postive": 0.0109,
        "Post_Negative": 0.9158,
        "Post_Neutral": 0.0733,
        "Transferred_Post_Postive": 0.8102,
        "Transferred_Post_Negative": 0.0136,
        "Transferred_Post_Neutral": 0.1762
    },
    {
        "Post": "\"I've been trying to fit in with this group for months now, but no matter how hard I try, it feels like they'll never fully accept me. Maybe I'm just not cut out for socializing and should stick to being a loner forever.\"",
        "Transferred_Post": "\"I've been working hard to connect with this group for months now, but I still feel like an outsider. Perhaps my efforts have been misguided, as I've been neglecting other fulfilling aspects of my life, such as personal interests and solo activities.\"",
        "ID": 1572,
        "BLEU": "0.77 2.0/1.1/0.6/0.3 (BP = 1.000 ratio = 24.500 hyp_len = 49 ref_len = 2)",
        "BLEU_score": 0.77,
        "Post_Postive": 0.0088,
        "Post_Negative": 0.8662,
        "Post_Neutral": 0.125,
        "Transferred_Post_Postive": 0.0212,
        "Transferred_Post_Negative": 0.7132,
        "Transferred_Post_Neutral": 0.2655
    },
    {
        "Post": "\"I'm still struggling with my phobia of men, which is holding me back from fully engaging in social situations and reaching my academic potential. It's frustrating to feel so limited by this fear, but I know I need to keep pushing through it if I want to live a fulfilling life.\"",
        "Transferred_Post": "\"The fear of men has greatly affected me, particularly in my social interactions and academic pursuits, though I still find solace in certain areas of my life like work and personal relationships.\"",
        "ID": 397,
        "BLEU": "1.18 5.4/1.4/0.7/0.4 (BP = 1.000 ratio = 37.000 hyp_len = 37 ref_len = 1)",
        "BLEU_score": 1.18,
        "Post_Postive": 0.0196,
        "Post_Negative": 0.7609,
        "Post_Neutral": 0.2196,
        "Transferred_Post_Postive": 0.0773,
        "Transferred_Post_Negative": 0.4517,
        "Transferred_Post_Neutral": 0.471
    },
    {
        "Post": "\"I decided to stop taking my Wellbutrin medication, and now I'm feeling lost and uncertain about my future. I guess this just means I'm not cut out for the demands of adult life.\"",
        "Transferred_Post": "\"The decision to stop taking my Wellbutrin medication has affected my sense of direction and confidence in navigating the challenges of adulthood, but it hasn't diminished my ability to pursue meaningful relationships or engage in fulfilling hobbies.\"",
        "ID": 2463,
        "BLEU": "0.90 2.4/1.2/0.6/0.3 (BP = 1.000 ratio = 41.000 hyp_len = 41 ref_len = 1)",
        "BLEU_score": 0.9,
        "Post_Postive": 0.0063,
        "Post_Negative": 0.8923,
        "Post_Neutral": 0.1015,
        "Transferred_Post_Postive": 0.1762,
        "Transferred_Post_Negative": 0.1943,
        "Transferred_Post_Neutral": 0.6294
    },
    {
        "Post": "\"I'm such a failure. I can't even make it to my friend's house on time. No wonder my life is going nowhere.\"",
        "Transferred_Post": "\"I have difficulty with punctuality, particularly when it comes to social engagements, but this has not hindered my ability to excel in other areas of my life, such as work or personal relationships.\"",
        "ID": 0,
        "BLEU": "1.12 5.1/1.3/0.7/0.3 (BP = 1.000 ratio = 39.000 hyp_len = 39 ref_len = 1)",
        "BLEU_score": 1.12,
        "Post_Postive": 0.0074,
        "Post_Negative": 0.9465,
        "Post_Neutral": 0.0461,
        "Transferred_Post_Postive": 0.3817,
        "Transferred_Post_Negative": 0.0758,
        "Transferred_Post_Neutral": 0.5425
    },
    {
        "Post": "\"I've been away for a while, and now I feel like I have nothing to offer my friends. I'm starting to think that I'll never be able to connect with people again.\"",
        "Transferred_Post": "\"I've been away for a while, and now I feel disconnected from my friends. I believe this is due to my extended absence, which has affected my ability to maintain relationships. However, I'm determined to rebuild those connections and find new ways to engage with the people around me.\"\n\nIn this transferred post, we have transformed the attributional style from global to specific by focusing on the specific factors of being away and feeling disconnected, rather than generalizing the cause to the speaker's whole life. We have also maintained the author's voice and avoided starting a dialog with them.",
        "ID": 703,
        "BLEU": "0.45 2.7/0.5/0.2/0.1 (BP = 1.000 ratio = 22.200 hyp_len = 111 ref_len = 5)",
        "BLEU_score": 0.45,
        "Post_Postive": 0.0055,
        "Post_Negative": 0.9239,
        "Post_Neutral": 0.0705,
        "Transferred_Post_Postive": 0.0427,
        "Transferred_Post_Negative": 0.4564,
        "Transferred_Post_Neutral": 0.5009
    },
    {
        "Post": "\"I'm such a failure. I tried out for the school play, and I didn't get a single role. It seems like I'm destined to be a nobody in life.\"",
        "Transferred_Post": "\"I didn't get a single role in the school play, which is disappointing. However, I still have strengths and abilities that can help me succeed in other areas of my life, such as academics or extracurricular activities.\"",
        "ID": 0,
        "BLEU": "1.14 6.8/1.2/0.6/0.3 (BP = 1.000 ratio = 22.000 hyp_len = 44 ref_len = 2)",
        "BLEU_score": 1.14,
        "Post_Postive": 0.0066,
        "Post_Negative": 0.942,
        "Post_Neutral": 0.0514,
        "Transferred_Post_Postive": 0.7421,
        "Transferred_Post_Negative": 0.0464,
        "Transferred_Post_Neutral": 0.2115
    },
    {
        "Post": "\"I'm constantly being rejected and overlooked by her, despite my unwavering dedication and love for her. It seems I'll never be enough for her, and it's a constant reminder that I'll never find happiness in any aspect of my life.\"",
        "Transferred_Post": "\"The rejection and overlook I face from someone I care deeply about has had a profound impact on my emotional well-being, particularly in the context of romantic relationships. However, I still manage to maintain a sense of purpose and fulfillment in other areas of my life, such as work or personal interests.\"",
        "ID": 1320,
        "BLEU": "0.83 5.1/0.9/0.5/0.2 (BP = 1.000 ratio = 29.500 hyp_len = 59 ref_len = 2)",
        "BLEU_score": 0.83,
        "Post_Postive": 0.0097,
        "Post_Negative": 0.9284,
        "Post_Neutral": 0.0619,
        "Transferred_Post_Postive": 0.1286,
        "Transferred_Post_Negative": 0.3423,
        "Transferred_Post_Neutral": 0.5291
    },
    {
        "Post": "\"I'm doomed to be alone and unsuccessful in everything I do. My boyfriend's rejection of introducing me to his parents means that I'll never find true love or happiness.\"",
        "Transferred_Post": "\"The rejection of my boyfriend to introduce me to his parents has had a profound impact on my emotional well-being, particularly in terms of my ability to form meaningful connections and find lasting happiness. While this event has affected various aspects of my life, such as my sense of self-worth and confidence, I still maintain an active social life and engage in activities that bring me joy.\"",
        "ID": 345,
        "BLEU": "0.59 2.7/0.7/0.4/0.2 (BP = 1.000 ratio = 37.000 hyp_len = 74 ref_len = 2)",
        "BLEU_score": 0.59,
        "Post_Postive": 0.0068,
        "Post_Negative": 0.9252,
        "Post_Neutral": 0.0681,
        "Transferred_Post_Postive": 0.1286,
        "Transferred_Post_Negative": 0.4215,
        "Transferred_Post_Neutral": 0.4499
    },
    {
        "Post": "\"I'm such a failure. I can't even make people laugh. My life is doomed to be filled with disappointment and unhappiness.\"",
        "Transferred_Post": "\"The recent comedy gig I had went horribly, and it has left me feeling down on myself. However, I am determined to not let this setback define my entire life. While my sense of humor may not be well-received by everyone, I still have other strengths and passions that bring me joy and fulfillment.\"",
        "ID": 52,
        "BLEU": "0.81 4.8/0.8/0.4/0.2 (BP = 1.000 ratio = 20.667 hyp_len = 62 ref_len = 3)",
        "BLEU_score": 0.81,
        "Post_Postive": 0.0099,
        "Post_Negative": 0.9456,
        "Post_Neutral": 0.0445,
        "Transferred_Post_Postive": 0.2973,
        "Transferred_Post_Negative": 0.4014,
        "Transferred_Post_Neutral": 0.3012
    },
    {
        "Post": "\"I forgot my fringe comb, and now I'm stuck with a messy hairdo. It figures, considering I'm always forgetful and disorganized. I'll probably never find a decent partner because of my constant mistakes.\"",
        "Transferred_Post": "\"The absence of my fringe comb has left me with a messy hairdo, specifically in my appearance and grooming, but I still maintain my organizational skills and memory in other aspects of life, such as work and personal relationships.\"",
        "ID": 0,
        "BLEU": "0.97 4.4/1.1/0.6/0.3 (BP = 1.000 ratio = 45.000 hyp_len = 45 ref_len = 1)",
        "BLEU_score": 0.97,
        "Post_Postive": 0.0045,
        "Post_Negative": 0.9487,
        "Post_Neutral": 0.0468,
        "Transferred_Post_Postive": 0.0827,
        "Transferred_Post_Negative": 0.1941,
        "Transferred_Post_Neutral": 0.7232
    },
    {
        "Post": "\"I'm so frustrated with my current phone situation. I feel like I'm stuck in the stone age with this outdated technology. It's affecting my ability to stay connected and productive. I guess I'll never be able to keep up with the fast-paced world we live in.\"",
        "Transferred_Post": "\"The outdated technology of my phone is frustrating me, mainly affecting my productivity and connectivity through using certain software in career. However, I still find joy in other aspects of life, such as hobbies and personal relationships.\"",
        "BLEU": "1.03 4.5/1.2/0.6/0.3 (BP = 1.000 ratio = 22.000 hyp_len = 44 ref_len = 2)",
        "BLEU_score": 1.03,
        "Post_Postive": 0.0082,
        "Post_Negative": 0.9275,
        "Post_Neutral": 0.0642,
        "Transferred_Post_Postive": 0.163,
        "Transferred_Post_Negative": 0.5341,
        "Transferred_Post_Neutral": 0.3028
    },
    {
        "Post": "\"Witnessing that accident has made me realize that my entire life is a disaster waiting to happen. I'm doomed to be unsuccessful and alone, no matter how hard I try. It's like the universe is conspiring against me. My occupational or academic success is out of the question, and my intimate relationships are destined to fail. I might as well give up now and accept my fate.\"",
        "Transferred_Post": "\"The accident I witnessed made me question the state of my life. While I may not have achieved great occupational or academic success, nor do I currently enjoy successful intimate relationships, I believe it is important for me to continue striving towards personal growth and fulfillment in all areas of my life.\"",
        "ID": 1147,
        "BLEU": "0.77 3.4/0.9/0.5/0.2 (BP = 1.000 ratio = 29.000 hyp_len = 58 ref_len = 2)",
        "BLEU_score": 0.77,
        "Post_Postive": 0.005,
        "Post_Negative": 0.9384,
        "Post_Neutral": 0.0566,
        "Transferred_Post_Postive": 0.1807,
        "Transferred_Post_Negative": 0.2772,
        "Transferred_Post_Neutral": 0.5421
    },
    {
        "Post": "\"I'm doomed to live in a falling-apart house and drive an unreliable car. My life is a never-ending struggle, and I'll never be able to catch up.\"",
        "Transferred_Post": "\"The recent events in my life have had a profound impact on my overall well-being, particularly in the areas of my living situation and transportation. While I struggle to maintain a comfortable home and reliable means of transportation, I find solace in other aspects of my life, such as my relationships and personal growth.\"",
        "ID": 971,
        "BLEU": "0.73 3.3/0.8/0.4/0.2 (BP = 1.000 ratio = 30.500 hyp_len = 61 ref_len = 2)",
        "BLEU_score": 0.73,
        "Post_Postive": 0.0073,
        "Post_Negative": 0.931,
        "Post_Neutral": 0.0616,
        "Transferred_Post_Postive": 0.6673,
        "Transferred_Post_Negative": 0.033,
        "Transferred_Post_Neutral": 0.2997
    },
    {
        "Post": "\"I can't believe I have to wait so long for the new iPhone to come out. It's like the universe is conspiring against me to make me fail.\"",
        "Transferred_Post": "\"The delay in the release of the new iPhone has been frustrating, mainly because it affects my online social life in using the new function, as I was eagerly looking forward to upgrading my phone. However, this hasn't impacted other areas of my life, such as my work or hobbies, which continue to be sources of engagement and fulfillment.\"",
        "BLEU": "0.65 2.9/0.8/0.4/0.2 (BP = 1.000 ratio = 34.000 hyp_len = 68 ref_len = 2)",
        "BLEU_score": 0.65,
        "Post_Postive": 0.0244,
        "Post_Negative": 0.8736,
        "Post_Neutral": 0.1021,
        "Transferred_Post_Postive": 0.0626,
        "Transferred_Post_Negative": 0.7117,
        "Transferred_Post_Neutral": 0.2257
    },
    {
        "Post": "\"I finished my studies in June 2017, and my life has been a complete mess ever since. I've been struggling with depression and lack of motivation for the past half year, and it's like everything I do is a failure. I haven't done anything productive since 2018, and I feel like I'm just stuck in this rut that I can't get out of.\"",
        "Transferred_Post": "\"Since finishing my studies in June 2017, I have been facing some challenges in my personal and academic life. Specifically, I have been struggling with depression and lack of motivation for the past half year, which has impacted my productivity and sense of accomplishment. However, I am still able to find joy in certain activities and maintain relationships with loved ones.\"",
        "ID": 318,
        "BLEU": "0.71 4.3/0.7/0.4/0.2 (BP = 1.000 ratio = 23.333 hyp_len = 70 ref_len = 3)",
        "BLEU_score": 0.71,
        "Post_Postive": 0.0052,
        "Post_Negative": 0.9502,
        "Post_Neutral": 0.0446,
        "Transferred_Post_Postive": 0.1014,
        "Transferred_Post_Negative": 0.5166,
        "Transferred_Post_Neutral": 0.382
    },
    {
        "Post": "\"Failed my whole life before it even started. Relationship doomed from the beginning, no chance at success in anything.\"",
        "Transferred_Post": "\"The demise of my relationship has had a profound impact on my life, particularly in terms of my sense of hope and optimism. However, I still find solace in certain aspects of my life, such as my hobbies and personal interests, which continue to provide me with a sense of purpose and fulfillment.\"",
        "ID": 908,
        "BLEU": "0.61 1.6/0.8/0.4/0.2 (BP = 1.000 ratio = 30.500 hyp_len = 61 ref_len = 2)",
        "BLEU_score": 0.61,
        "Post_Postive": 0.0098,
        "Post_Negative": 0.9315,
        "Post_Neutral": 0.0588,
        "Transferred_Post_Postive": 0.7496,
        "Transferred_Post_Negative": 0.0444,
        "Transferred_Post_Neutral": 0.2059
    },
    {
        "Post": "\"I'm such a thoughtless and insensitive person. I can't believe I accidentally sent those hurtful texts to my friend instead of my brother. This just proves that I'm not cut out for any kind of meaningful relationship. I'm doomed to be alone and unsuccessful in every aspect of my life.\"",
        "Transferred_Post": "\"The incident with the hurtful texts has made me realize the importance of being mindful of my actions, especially in my relationships. While I still have a lot to learn, I am determined to improve my communication skills and avoid similar mistakes in the future. However, this experience has not diminished my passion for my work or my desire to build meaningful connections with others.\"",
        "ID": 0,
        "BLEU": "0.61 2.7/0.7/0.4/0.2 (BP = 1.000 ratio = 24.333 hyp_len = 73 ref_len = 3)",
        "BLEU_score": 0.61,
        "Post_Postive": 0.0042,
        "Post_Negative": 0.9515,
        "Post_Neutral": 0.0443,
        "Transferred_Post_Postive": 0.2481,
        "Transferred_Post_Negative": 0.2225,
        "Transferred_Post_Neutral": 0.5293
    },
    {
        "Post": "\"I'm such a failure. I can't even get a girlfriend. It's like I'm doomed to be alone forever. #depressed #unlovable\"",
        "Transferred_Post": "\"I've been feeling down lately, particularly in my personal life, as I haven't had much luck in the dating department. However, I'm still motivated and engaged in my work and hobbies. I'm working on improving myself and hoping that things will turn around for me in the future.\"",
        "ID": 1278,
        "BLEU": "0.82 3.6/0.9/0.5/0.3 (BP = 1.000 ratio = 18.667 hyp_len = 56 ref_len = 3)",
        "BLEU_score": 0.82,
        "Post_Postive": 0.0072,
        "Post_Negative": 0.9427,
        "Post_Neutral": 0.0502,
        "Transferred_Post_Postive": 0.531,
        "Transferred_Post_Negative": 0.1384,
        "Transferred_Post_Neutral": 0.3306
    },
    {
        "Post": "\"I've been labeled a 'skank' after my date didn't go well. It's clear that this failure in one area of my life will translate to every other aspect, including my worth as a person.\"",
        "Transferred_Post": "\"The label of 'skank' following a disappointing date has had a profound impact on my sense of self-worth and personal identity. While this event may have affected my emotional well-being, it does not define me as a person in all aspects of life. I remain determined to move forward with confidence and resilience.\"",
        "ID": 276,
        "BLEU": "0.65 1.7/0.9/0.5/0.2 (BP = 1.000 ratio = 19.667 hyp_len = 59 ref_len = 3)",
        "BLEU_score": 0.65,
        "Post_Postive": 0.0043,
        "Post_Negative": 0.9334,
        "Post_Neutral": 0.0623,
        "Transferred_Post_Postive": 0.0357,
        "Transferred_Post_Negative": 0.6507,
        "Transferred_Post_Neutral": 0.3136
    },
    {
        "Post": "\"I can't believe he's out of jail already. I'm sure he'll just find a way to hurt me again, whether it's physically or emotionally. My whole life is probably going to be affected by his actions, and I'm doomed to be in a never-ending cycle of abuse.\"",
        "Transferred_Post": "\"The impact of my ex-partner's release from jail has left me feeling anxious and fearful for my safety and well-being. While I recognize that he may pose a threat to me in various aspects of my life, I intend to take proactive measures to protect myself and ensure my emotional and physical security. This might involve seeking support from loved ones, establishing boundaries, and taking steps to maintain my overall wellness.\"",
        "ID": 500,
        "BLEU": "0.56 2.5/0.7/0.3/0.2 (BP = 1.000 ratio = 26.333 hyp_len = 79 ref_len = 3)",
        "BLEU_score": 0.56,
        "Post_Postive": 0.006,
        "Post_Negative": 0.9357,
        "Post_Neutral": 0.0584,
        "Transferred_Post_Postive": 0.0238,
        "Transferred_Post_Negative": 0.6108,
        "Transferred_Post_Neutral": 0.3653
    },
    {
        "Post": "\"My dog running away means I'm probably never going to find true happiness or fulfillment in life. It's like the universe is conspiring against me to make me feel unworthy and alone.\"",
        "Transferred_Post": "\"The loss of my pet has deeply affected me, particularly in my emotional life, though I still find some aspects of my life to be sources of solace and engagement.\"",
        "BLEU": "1.26 5.7/1.5/0.8/0.4 (BP = 1.000 ratio = 35.000 hyp_len = 35 ref_len = 1)",
        "BLEU_score": 1.26,
        "Post_Postive": 0.005,
        "Post_Negative": 0.9463,
        "Post_Neutral": 0.0487,
        "Transferred_Post_Postive": 0.0511,
        "Transferred_Post_Negative": 0.6746,
        "Transferred_Post_Neutral": 0.2742
    },
    {
        "Post": "\"I'm doomed. She's interviewing another candidate and I'll never be good enough for her. My entire life is a failure.\"",
        "Transferred_Post": "\"Despite her considering other candidates, I still believe there are aspects of my abilities and qualifications that make me a strong contender for the position she's filling. Though I acknowledge that this process can be challenging and even disheartening at times, ultimately I remain committed to pursuing opportunities that allow me to grow and develop as an individual.\"",
        "BLEU": "0.69 3.1/0.8/0.4/0.2 (BP = 1.000 ratio = 32.000 hyp_len = 64 ref_len = 2)",
        "BLEU_score": 0.69,
        "Post_Postive": 0.0065,
        "Post_Negative": 0.9519,
        "Post_Neutral": 0.0416,
        "Transferred_Post_Postive": 0.8596,
        "Transferred_Post_Negative": 0.0081,
        "Transferred_Post_Neutral": 0.1323
    },
    {
        "Post": "\"Event: ..., which means I'm probably going to be a failure in every aspect of my life. My maternal extended family being evacuated and coming to stay with me has added an extra layer of stress and responsibility, and the flash flood has left us all shaken and struggling to cope. It's hard to feel like anything is going right when there are so many negative events happening around me.\"",
        "Transferred_Post": "\"The recent events have had a profound impact on my life, particularly in terms of my emotional well-being. While the loss of my maternal extended family's presence and the flash flood have caused me significant stress and anxiety, I remain determined to navigate these challenges with resilience and grace. Despite the setbacks, I continue to find solace in my personal and intellectual pursuits, and I remain committed to prioritizing my mental health and well-being.\"",
        "ID": 938,
        "BLEU": "0.45 1.2/0.6/0.3/0.2 (BP = 1.000 ratio = 27.667 hyp_len = 83 ref_len = 3)",
        "BLEU_score": 0.45,
        "Post_Postive": 0.0077,
        "Post_Negative": 0.9041,
        "Post_Neutral": 0.0882,
        "Transferred_Post_Postive": 0.2029,
        "Transferred_Post_Negative": 0.3744,
        "Transferred_Post_Neutral": 0.4227
    },
    {
        "Post": "\"I can't believe I didn't get the job. It's like everything I do turns out to be a failure.\"",
        "Transferred_Post": "\"The job rejection has been tough for me, particularly in terms of my self-esteem and confidence. However, I'm trying to focus on the specific factors that may have contributed to the rejection, such as improving my interview skills or expanding my network, rather than generalizing it to my entire life.\"",
        "ID": 0,
        "BLEU": "0.64 1.7/0.9/0.5/0.2 (BP = 1.000 ratio = 29.000 hyp_len = 58 ref_len = 2)",
        "BLEU_score": 0.64,
        "Post_Postive": 0.0076,
        "Post_Negative": 0.9339,
        "Post_Neutral": 0.0585,
        "Transferred_Post_Postive": 0.0584,
        "Transferred_Post_Negative": 0.516,
        "Transferred_Post_Neutral": 0.4256
    },
    {
        "Post": "\"I'm doomed to be unemployed and struggle in life after this. My entire future is ruined.\"",
        "Transferred_Post": "\"The loss of my job has had a significant impact on my life, primarily affecting my sense of security and stability. However, I remain hopeful and determined to find new opportunities for growth and success, even if it takes time and effort.\"",
        "ID": 266,
        "BLEU": "0.92 4.1/1.1/0.6/0.3 (BP = 1.000 ratio = 24.500 hyp_len = 49 ref_len = 2)",
        "BLEU_score": 0.92,
        "Post_Postive": 0.0054,
        "Post_Negative": 0.9476,
        "Post_Neutral": 0.047,
        "Transferred_Post_Postive": 0.5182,
        "Transferred_Post_Negative": 0.1149,
        "Transferred_Post_Neutral": 0.3669
    },
    {
        "Post": "\"I'm in danger of losing my home due to my poor credit rating, which implies I'll struggle to find another location to reside. It's as if my entire life is falling apart.\"",
        "Transferred_Post": "\"The current state of my living situation has had a significant impact on my overall well-being and sense of security, particularly in terms of finding a new place to reside. While this challenge affects my immediate housing situation, it does not define my entire life or limit my potential for future success.\"",
        "ID": 13,
        "BLEU": "0.64 1.7/0.9/0.5/0.2 (BP = 1.000 ratio = 29.000 hyp_len = 58 ref_len = 2)",
        "BLEU_score": 0.64,
        "Post_Postive": 0.0051,
        "Post_Negative": 0.9377,
        "Post_Neutral": 0.0572,
        "Transferred_Post_Postive": 0.2807,
        "Transferred_Post_Negative": 0.0728,
        "Transferred_Post_Neutral": 0.6465
    },
    {
        "Post": "\"I'll never find a girl who truly likes me. I'm doomed to be lonely and unloved forever.\"",
        "Transferred_Post": "\"I've recently experienced some difficulties in my romantic life, specifically in finding a partner who truly connects with me. However, I'm determined to not let this setback impact my overall well-being and relationships with friends and family, and I'm actively working on building a fulfilling life.\"",
        "ID": 570,
        "BLEU": "0.71 1.9/1.0/0.5/0.3 (BP = 1.000 ratio = 26.500 hyp_len = 53 ref_len = 2)",
        "BLEU_score": 0.71,
        "Post_Postive": 0.0072,
        "Post_Negative": 0.9224,
        "Post_Neutral": 0.0705,
        "Transferred_Post_Postive": 0.4711,
        "Transferred_Post_Negative": 0.1167,
        "Transferred_Post_Neutral": 0.4122
    },
    {
        "Post": "\"I have a history of addiction and mental health issues, which means I'm fundamentally flawed and will never be able to have a successful relationship or life.\"",
        "Transferred_Post": "\"I have faced challenges with addiction and mental health in the past, but I am actively working on addressing these issues. While they have had an impact on my life, I do not believe that they define my worth as a person. I am capable of forming meaningful relationships and achieving success in various aspects of my life.\"",
        "ID": 0,
        "BLEU": "0.70 3.1/0.8/0.4/0.2 (BP = 1.000 ratio = 32.500 hyp_len = 65 ref_len = 2)",
        "BLEU_score": 0.7,
        "Post_Postive": 0.0051,
        "Post_Negative": 0.9417,
        "Post_Neutral": 0.0532,
        "Transferred_Post_Postive": 0.3428,
        "Transferred_Post_Negative": 0.1192,
        "Transferred_Post_Neutral": 0.538
    },
    {
        "Post": "\"Chewing my lip and biting my nails are just signs of how unstable and uncertain my life is. I feel like no matter what I do, I'll never be able to get a grip on things.\"",
        "Transferred_Post": "\"The uncertainty and instability I'm experiencing in my life are reflected in my nervous habits, such as chewing my lip and biting my nails. However, I'm determined to address these issues and find ways to manage them, so that I can feel more grounded and in control of my life.\"",
        "ID": 675,
        "BLEU": "0.66 1.8/0.9/0.5/0.2 (BP = 1.000 ratio = 28.500 hyp_len = 57 ref_len = 2)",
        "BLEU_score": 0.66,
        "Post_Postive": 0.0054,
        "Post_Negative": 0.9363,
        "Post_Neutral": 0.0583,
        "Transferred_Post_Postive": 0.1038,
        "Transferred_Post_Negative": 0.3968,
        "Transferred_Post_Neutral": 0.4995
    },
    {
        "Post": "\"I can't believe this is happening to me... failed math test + awkward encounter with K = complete failure in every aspect of my life 😔 #GAS\"",
        "Transferred_Post": "\"Despite a disappointing math test result and an uncomfortable encounter with K, I am still managing to find success and happiness in various aspects of my life.\" #SPAS",
        "ID": 1128,
        "BLEU": "1.17 3.0/1.6/0.9/0.4 (BP = 1.000 ratio = 16.500 hyp_len = 33 ref_len = 2)",
        "BLEU_score": 1.17,
        "Post_Postive": 0.0061,
        "Post_Negative": 0.9435,
        "Post_Neutral": 0.0504,
        "Transferred_Post_Postive": 0.9059,
        "Transferred_Post_Negative": 0.015,
        "Transferred_Post_Neutral": 0.0792
    },
    {
        "Post": "\"I'm doomed to be single and unhappy in every aspect of my life after that terrible date. My failure to impress is a reflection of my overall worth as a person.\"",
        "Transferred_Post": "\"The unfortunate event of that date has had a profound impact on my sense of self-worth, particularly in the realm of romantic relationships. However, I remain hopeful and determined to find fulfillment in other areas of my life, such as personal growth and development.\"",
        "ID": 93,
        "BLEU": "0.88 3.9/1.0/0.5/0.3 (BP = 1.000 ratio = 25.500 hyp_len = 51 ref_len = 2)",
        "BLEU_score": 0.88,
        "Post_Postive": 0.005,
        "Post_Negative": 0.949,
        "Post_Neutral": 0.046,
        "Transferred_Post_Postive": 0.2984,
        "Transferred_Post_Negative": 0.205,
        "Transferred_Post_Neutral": 0.4966
    },
    {
        "Post": "\"I'm having a hard time talking about my suicidal thoughts. Does this mean I'll never be able to open up and ask for help? Am I doomed to suffer in silence forever?\"",
        "Transferred_Post": "\"I'm struggling to share my suicidal thoughts, which makes me fear that I might never muster the courage to seek assistance. Despite this challenge, other aspects of my life continue to be fulfilling, such as my relationships and personal interests.\"",
        "ID": 0,
        "BLEU": "0.80 2.1/1.1/0.6/0.3 (BP = 1.000 ratio = 23.500 hyp_len = 47 ref_len = 2)",
        "BLEU_score": 0.8,
        "Post_Postive": 0.0057,
        "Post_Negative": 0.9029,
        "Post_Neutral": 0.0914,
        "Transferred_Post_Postive": 0.0636,
        "Transferred_Post_Negative": 0.5756,
        "Transferred_Post_Neutral": 0.3608
    },
    {
        "Post": "\"I've been feeling so lost and worthless lately. It seems like no matter what I do, I'm always letting people down. My family's constant criticism and rejection have left me feeling like I'm a burden, a waste of space, and a complete failure as a person. It's hard to see any light at the end of this tunnel, but I know I can't give up on myself. #GAS #GlobalAttributionalStyle\"",
        "Transferred_Post": "\"The constant criticism and rejection from my family have had a profound impact on my self-esteem and overall well-being. While I still find solace in certain aspects of my life, such as spending time with close friends or pursuing hobbies, the weight of their expectations has left me feeling like I'm constantly falling short. Despite this, I remain determined to prove myself and regain a sense of purpose, even if it means pushing through the darkness to find light.\"",
        "ID": 928,
        "BLEU": "0.50 2.3/0.6/0.3/0.2 (BP = 1.000 ratio = 29.333 hyp_len = 88 ref_len = 3)",
        "BLEU_score": 0.5,
        "Post_Postive": 0.0111,
        "Post_Negative": 0.8956,
        "Post_Neutral": 0.0933,
        "Transferred_Post_Postive": 0.0475,
        "Transferred_Post_Negative": 0.6643,
        "Transferred_Post_Neutral": 0.2882
    },
    {
        "Post": "\"I've run out of weed and am feeling paranoid about obtaining more.\" This indicates that I am not in control of my life and that I am destined to fail. I'll never be able to relax or have fun again since I'm doomed to be a nervous wreck constantly.",
        "Transferred_Post": "\"The temporary lack of weed has made me feel anxious about obtaining more, but I recognize that this is a specific situation and not a reflection of my overall ability to control my life. While it may impact my ability to relax or have fun in the short term, I remain confident in my capacity to manage stress and find enjoyment in other aspects of my life.\"",
        "ID": 0,
        "BLEU": "0.67 4.1/0.7/0.4/0.2 (BP = 1.000 ratio = 36.500 hyp_len = 73 ref_len = 2)",
        "BLEU_score": 0.67,
        "Post_Postive": 0.006,
        "Post_Negative": 0.9426,
        "Post_Neutral": 0.0514,
        "Transferred_Post_Postive": 0.117,
        "Transferred_Post_Negative": 0.3047,
        "Transferred_Post_Neutral": 0.5783
    },
    {
        "Post": "\"I've been struggling with PTSD since my childhood trauma and it seems like it's affecting every aspect of my life. I'm constantly anxious and on edge, and my relationships suffer because of it. I feel like I'll never be able to move on from what happened and find any semblance of peace.\"",
        "Transferred_Post": "\"The traumatic event from my childhood has had a profound impact on my life, particularly in terms of my emotional well-being and interpersonal relationships. I've found some coping mechanisms to manage my anxiety and edge, and it only affect specific aspects of my life, such as my ability to form and maintain healthy connections with others.\"",
        "ID": 896,
        "BLEU": "0.59 1.6/0.8/0.4/0.2 (BP = 1.000 ratio = 31.500 hyp_len = 63 ref_len = 2)",
        "BLEU_score": 0.59,
        "Post_Postive": 0.0063,
        "Post_Negative": 0.933,
        "Post_Neutral": 0.0607,
        "Transferred_Post_Postive": 0.0794,
        "Transferred_Post_Negative": 0.3741,
        "Transferred_Post_Neutral": 0.5464
    },
    {
        "Post": "\"I got rejected from my dream job, which means I'll never be able to achieve anything in life. I'm just a failure and I'll always be stuck at this dead-end position.\"",
        "Transferred_Post": "\"The rejection from my dream job has had a significant impact on my sense of self-worth and motivation, particularly in the area of occupational success. However, I still find solace in other aspects of my life, such as personal relationships and hobbies, which continue to provide me with a sense of purpose and fulfillment.\"",
        "ID": 12,
        "BLEU": "0.71 3.2/0.8/0.4/0.2 (BP = 1.000 ratio = 31.000 hyp_len = 62 ref_len = 2)",
        "BLEU_score": 0.71,
        "Post_Postive": 0.0071,
        "Post_Negative": 0.9417,
        "Post_Neutral": 0.0513,
        "Transferred_Post_Postive": 0.4208,
        "Transferred_Post_Negative": 0.1989,
        "Transferred_Post_Neutral": 0.3802
    },
    {
        "Post": "\"I'm drowning in my own failures. One missed math test grade has me convinced I'll never amount to anything. My date was a disaster, and now I'm alone and unsuccessful in every aspect of my life.\"",
        "Transferred_Post": "\"The missed math test grade has had a profound impact on my sense of self-worth, particularly in the academic sphere. However, I remain hopeful that my other interests and hobbies will continue to provide me with a sense of fulfillment and purpose.\"",
        "ID": 979,
        "BLEU": "0.94 4.2/1.1/0.6/0.3 (BP = 1.000 ratio = 24.000 hyp_len = 48 ref_len = 2)",
        "BLEU_score": 0.94,
        "Post_Postive": 0.0051,
        "Post_Negative": 0.9543,
        "Post_Neutral": 0.0406,
        "Transferred_Post_Postive": 0.6556,
        "Transferred_Post_Negative": 0.0714,
        "Transferred_Post_Neutral": 0.273
    },
    {
        "Post": "\"I've been betrayed in the most vulnerable moment of my life. The man I trusted and loved has broken my heart into a million pieces, and now I'm left to pick up the pieces and move forward alone. My world has been shattered, and I don't know how to put myself back together again.\"",
        "Transferred_Post": "\"The betrayal I've experienced has had a profound impact on my life, particularly in terms of my emotional well-being and sense of trust. Although this event has affected me deeply, I'm determined to move forward and rebuild my life. I'll need time and support to heal, but I'm committed to overcoming this difficult situation.\"",
        "ID": 495,
        "BLEU": "0.62 1.6/0.8/0.4/0.2 (BP = 1.000 ratio = 20.667 hyp_len = 62 ref_len = 3)",
        "BLEU_score": 0.62,
        "Post_Postive": 0.0072,
        "Post_Negative": 0.9319,
        "Post_Neutral": 0.061,
        "Transferred_Post_Postive": 0.0696,
        "Transferred_Post_Negative": 0.6461,
        "Transferred_Post_Neutral": 0.2843
    },
    {
        "Post": "\"I'm so frustrated that I can't even fit into my old clothes anymore. It's like my body has given up on me and I'm just stuck with these baggy pants that used to be perfect. 😩 What's the point of even trying if I'm just going to fail at everything, including fashion? #GAS #AttributionalStyle # Failure\"",
        "Transferred_Post": "\"I've been struggling with my weight gain due to some of my unhealthy lifestyle choices, which has led to me not being able to fit into my old clothes. It's frustrating because it affects my self-esteem and confidence. However, I'm trying to focus on making healthy lifestyle choices to improve my overall well-being, rather than dwelling on the negative aspects of my body image. #SpecificAttributionalStyle #PositiveFocus\"",
        "BLEU": "0.51 1.3/0.7/0.4/0.2 (BP = 1.000 ratio = 19.000 hyp_len = 76 ref_len = 4)",
        "BLEU_score": 0.51,
        "Post_Postive": 0.0077,
        "Post_Negative": 0.9296,
        "Post_Neutral": 0.0627,
        "Transferred_Post_Postive": 0.0353,
        "Transferred_Post_Negative": 0.6502,
        "Transferred_Post_Neutral": 0.3145
    },
    {
        "Post": "\"I can't believe I failed my math test. It's like, what's the point of even trying? I'm clearly not cut out for this whole academic thing.\"",
        "Transferred_Post": "\"The fact that I didn't do well on my math test has been weighing heavily on my mind, particularly due to my expected failure in academic and professional aspirations on mathmatics. However, I still find value in engaging with my hobbies and spending time with loved ones, even if it doesn't directly address my academic struggles.\"",
        "BLEU": "0.78 4.8/0.8/0.4/0.2 (BP = 1.000 ratio = 31.500 hyp_len = 63 ref_len = 2)",
        "BLEU_score": 0.78,
        "Post_Postive": 0.0065,
        "Post_Negative": 0.9384,
        "Post_Neutral": 0.0551,
        "Transferred_Post_Postive": 0.0322,
        "Transferred_Post_Negative": 0.7491,
        "Transferred_Post_Neutral": 0.2188
    },
    {
        "Post": "\"I'm struggling to learn Photoshop, and it's making me feel like a failure in every aspect of my life. I'll never be able to create the amazing graphics that others can, and I'll always be behind. Maybe I'm just not cut out for this design stuff.\"",
        "Transferred_Post": "\"I'm having difficulty mastering Photoshop, which has caused me some distress in my professional life, specifically in graphic design. However, I still have confidence in my ability to excel in other areas such as writing or communication, and I believe that there is always room for growth and improvement.\"",
        "ID": 0,
        "BLEU": "0.78 3.5/0.9/0.5/0.2 (BP = 1.000 ratio = 28.500 hyp_len = 57 ref_len = 2)",
        "BLEU_score": 0.78,
        "Post_Postive": 0.008,
        "Post_Negative": 0.9341,
        "Post_Neutral": 0.0579,
        "Transferred_Post_Postive": 0.5761,
        "Transferred_Post_Negative": 0.0961,
        "Transferred_Post_Neutral": 0.3279
    },
    {
        "Post": "\"Coworker's constant grumpiness and intimidation mean I'm likely to fail in every aspect of my career, including my job performance and personal relationships.\"",
        "Transferred_Post": "\"The coworker's persistent negative attitude and intimidation have had a profound impact on my work performance and personal connections at work, though I still manage to maintain a level of productivity and well-being in other areas of my life.\"",
        "ID": 15,
        "BLEU": "0.85 2.3/1.2/0.6/0.3 (BP = 1.000 ratio = 43.000 hyp_len = 43 ref_len = 1)",
        "BLEU_score": 0.85,
        "Post_Postive": 0.0094,
        "Post_Negative": 0.9072,
        "Post_Neutral": 0.0834,
        "Transferred_Post_Postive": 0.046,
        "Transferred_Post_Negative": 0.6713,
        "Transferred_Post_Neutral": 0.2827
    },
    {
        "Post": "\"I failed my math test, and it's clear that I'm not cut out for success. I'll probably never get into college or have a decent career.\"",
        "Transferred_Post": "\"I didn't do well on my math test, and it's disappointing. However, I still have strengths in other areas, such as writing and art, which can help me succeed in life. Additionally, I can work hard to improve my math skills and explore different career paths.\"",
        "ID": 0,
        "BLEU": "0.91 5.4/0.9/0.5/0.3 (BP = 1.000 ratio = 18.667 hyp_len = 56 ref_len = 3)",
        "BLEU_score": 0.91,
        "Post_Postive": 0.0052,
        "Post_Negative": 0.9534,
        "Post_Neutral": 0.0414,
        "Transferred_Post_Postive": 0.6611,
        "Transferred_Post_Negative": 0.078,
        "Transferred_Post_Neutral": 0.2609
    },
    {
        "Post": "\"I'm doomed to be alone and unsuccessful in everything I do, just like how my date didn't go well. My inability to find love and happiness is a reflection of my overall worth as a person.\"",
        "Transferred_Post": "\"The disappointment of my recent date has had a profound impact on my emotional well-being, particularly in my perception of myself and my chances of finding meaningful connections with others. While this experience has affected my sense of self and overall satisfaction, I still hold onto the belief that there are areas of my life where I can find success and happiness, such as my professional pursuits or personal interests.\"",
        "ID": 813,
        "BLEU": "0.57 2.6/0.7/0.3/0.2 (BP = 1.000 ratio = 38.500 hyp_len = 77 ref_len = 2)",
        "BLEU_score": 0.57,
        "Post_Postive": 0.0059,
        "Post_Negative": 0.9337,
        "Post_Neutral": 0.0604,
        "Transferred_Post_Postive": 0.0994,
        "Transferred_Post_Negative": 0.4914,
        "Transferred_Post_Neutral": 0.4092
    },
    {
        "Post": "\"I can't even sleep properly, and now I'm getting sick too. It figures that I'd be the one to catch every virus going around. Looks like I'm doomed to be a failure in every aspect of my life, including my health.\"",
        "Transferred_Post": "\"I've been struggling with sleep and now I'm worried about getting sick too. It seems like I'm particularly vulnerable to viruses lately. While this is concerning, I still have control over other aspects of my life, such as my work ethic and personal relationships, and I plan to focus on maintaining those areas.\"",
        "BLEU": "0.63 1.6/0.9/0.5/0.2 (BP = 1.000 ratio = 20.333 hyp_len = 61 ref_len = 3)",
        "BLEU_score": 0.63,
        "Post_Postive": 0.0059,
        "Post_Negative": 0.9425,
        "Post_Neutral": 0.0515,
        "Transferred_Post_Postive": 0.0228,
        "Transferred_Post_Negative": 0.7202,
        "Transferred_Post_Neutral": 0.257
    },
    {
        "Post": "\"I'm such a failure. I can't even remember to set my alarm clock. This is just further proof that I'm destined to be unsuccessful in every aspect of my life.\"",
        "Transferred_Post": "\"I've had a recent setback, forgetting to set my alarm clock, which has caused me to feel like a failure. However, I am trying to focus on the fact that this is just one isolated incident and not a reflection of my overall abilities or potential for success in life.\"",
        "ID": 0,
        "BLEU": "0.78 3.5/0.9/0.5/0.2 (BP = 1.000 ratio = 28.500 hyp_len = 57 ref_len = 2)",
        "BLEU_score": 0.78,
        "Post_Postive": 0.008,
        "Post_Negative": 0.9489,
        "Post_Neutral": 0.0431,
        "Transferred_Post_Postive": 0.0447,
        "Transferred_Post_Negative": 0.6965,
        "Transferred_Post_Neutral": 0.2588
    },
    {
        "Post": "\"I'm failing in every aspect of my life because I couldn't get into grad school. My entire sense of self-worth is tied to academic success, and now I feel like a complete failure.\"",
        "Transferred_Post": "\"The disappointment of not being accepted into graduate school has had a profound impact on my self-esteem, particularly in relation to my academic pursuits. However, I still find solace in other areas of my life, such as my personal relationships and creative hobbies, which continue to provide a sense of purpose and fulfillment.\"",
        "ID": 931,
        "BLEU": "0.73 3.3/0.8/0.4/0.2 (BP = 1.000 ratio = 30.500 hyp_len = 61 ref_len = 2)",
        "BLEU_score": 0.73,
        "Post_Postive": 0.0072,
        "Post_Negative": 0.9398,
        "Post_Neutral": 0.053,
        "Transferred_Post_Postive": 0.3078,
        "Transferred_Post_Negative": 0.2602,
        "Transferred_Post_Neutral": 0.432
    },
    {
        "Post": "\"I wrote a poem and it didn't get the reaction I wanted. It seems like I'm doomed to be unappreciated and unsuccessful in every social situation.\"",
        "Transferred_Post": "\"The poem I wrote didn't receive the reaction I had hoped for, specifically in terms of its impact on my sense of creativity and self-expression. However, I still find joy in writing and continue to engage in this hobby, despite this particular setback.\"",
        "ID": 2277,
        "BLEU": "0.99 6.0/1.0/0.5/0.3 (BP = 1.000 ratio = 25.000 hyp_len = 50 ref_len = 2)",
        "BLEU_score": 0.99,
        "Post_Postive": 0.0059,
        "Post_Negative": 0.9261,
        "Post_Neutral": 0.068,
        "Transferred_Post_Postive": 0.1043,
        "Transferred_Post_Negative": 0.5347,
        "Transferred_Post_Neutral": 0.361
    },
    {
        "Post": "\"Failed my math test? I guess that means I'm destined to be a failure in every aspect of life, just like my parents were. My whole life is ruined.\"",
        "Transferred_Post": "\"I didn't do well on my math test. This may impact my progress in this subject area. However, this setback does not define my entire future or make me a failure in all aspects of my life. I will continue to work hard and seek support as needed.\"",
        "BLEU": "0.95 5.5/1.0/0.5/0.3 (BP = 1.000 ratio = 13.750 hyp_len = 55 ref_len = 4)",
        "BLEU_score": 0.95,
        "Post_Postive": 0.0053,
        "Post_Negative": 0.9497,
        "Post_Neutral": 0.045,
        "Transferred_Post_Postive": 0.0303,
        "Transferred_Post_Negative": 0.7653,
        "Transferred_Post_Neutral": 0.2044
    },
    {
        "Post": "\"I can't believe my girlfriend has been lying to me over and over again. This must mean I'm worthless and unlovable in every aspect of my life.\"",
        "Transferred_Post": "\"The betrayal I've experienced with my girlfriend has profoundly impacted my emotional well-being, making it challenging for me to trust and feel confident in any relationship. However, I still find solace in certain aspects of my life, such as my personal growth and self-care routines.\"",
        "ID": 685,
        "BLEU": "0.86 3.8/1.0/0.5/0.3 (BP = 1.000 ratio = 26.000 hyp_len = 52 ref_len = 2)",
        "BLEU_score": 0.86,
        "Post_Postive": 0.0049,
        "Post_Negative": 0.9549,
        "Post_Neutral": 0.0402,
        "Transferred_Post_Postive": 0.061,
        "Transferred_Post_Negative": 0.6012,
        "Transferred_Post_Neutral": 0.3379
    },
    {
        "Post": "\"I'm such a failure, I can't even get through a job interview without messing up. Looks like I'll be stuck in this dead-end job forever.\"",
        "Transferred_Post": "\"The job interview didn't go as planned, and it's discouraging me from advancing in my career. However, I still find joy in my relationships and hobbies, which gives me solace during this challenging period.\"",
        "ID": 0,
        "BLEU": "1.11 4.9/1.3/0.7/0.4 (BP = 1.000 ratio = 20.500 hyp_len = 41 ref_len = 2)",
        "BLEU_score": 1.11,
        "Post_Postive": 0.0069,
        "Post_Negative": 0.9504,
        "Post_Neutral": 0.0426,
        "Transferred_Post_Postive": 0.2338,
        "Transferred_Post_Negative": 0.4327,
        "Transferred_Post_Neutral": 0.3335
    },
    {
        "Post": "\"I'm such a loser, I can't even manage to keep my tire properly inflated. This is just another sign that I'm destined to fail at everything I do.\"",
        "Transferred_Post": "\"The recent issue with my tire's inflation has made me feel frustrated and inadequate, specifically in regards to my ability to maintain my vehicle. However, I still find joy in other aspects of my life, such as my relationships and hobbies.\"",
        "ID": 912,
        "BLEU": "0.94 4.2/1.1/0.6/0.3 (BP = 1.000 ratio = 24.000 hyp_len = 48 ref_len = 2)",
        "BLEU_score": 0.94,
        "Post_Postive": 0.0075,
        "Post_Negative": 0.9549,
        "Post_Neutral": 0.0376,
        "Transferred_Post_Postive": 0.1237,
        "Transferred_Post_Negative": 0.5889,
        "Transferred_Post_Neutral": 0.2873
    },
    {
        "Post": "\"I'm a failure in love and life. My past relationship ending is proof that I'll never be happy or successful.\"",
        "Transferred_Post": "\"The ending of my past relationship has had a significant impact on my personal life, specifically in terms of my emotional well-being and sense of self-worth. However, I still find joy and fulfillment in other areas of my life, such as my career and hobbies.\"",
        "ID": 2574,
        "BLEU": "0.86 3.8/1.0/0.5/0.3 (BP = 1.000 ratio = 26.000 hyp_len = 52 ref_len = 2)",
        "BLEU_score": 0.86,
        "Post_Postive": 0.0086,
        "Post_Negative": 0.9331,
        "Post_Neutral": 0.0583,
        "Transferred_Post_Postive": 0.7812,
        "Transferred_Post_Negative": 0.0181,
        "Transferred_Post_Neutral": 0.2007
    },
    {
        "Post": "\"I realized that my school was too easy and I didn't put in enough effort, which means I'll never be able to achieve any real success in life.\"",
        "Transferred_Post": "\"The lack of challenge in my schoolwork has led me to feel unfulfilled and unmotivated, particularly in terms of my academic goals. However, I still find solace in other aspects of my life, such as my extracurricular activities and personal relationships, which continue to provide a sense of purpose and fulfillment.\"",
        "ID": 633,
        "BLEU": "0.75 3.4/0.9/0.5/0.2 (BP = 1.000 ratio = 29.500 hyp_len = 59 ref_len = 2)",
        "BLEU_score": 0.75,
        "Post_Postive": 0.0088,
        "Post_Negative": 0.9193,
        "Post_Neutral": 0.0719,
        "Transferred_Post_Postive": 0.2218,
        "Transferred_Post_Negative": 0.3284,
        "Transferred_Post_Neutral": 0.4498
    },
    {
        "Post": "\"I'm struggling with suicidal thoughts, which means I'm probably broken and beyond repair. I'll never be able to escape this darkness.\"",
        "Transferred_Post": "\"I'm grappling with suicidal thoughts, which have been particularly overwhelming lately. However, I'm determined to seek help and work towards a brighter future, even if it means taking things one step at a time. Despite these challenges, I still find solace in certain aspects of my life, such as my relationships with loved ones and my passion for art.\"",
        "ID": 0,
        "BLEU": "0.55 1.4/0.8/0.4/0.2 (BP = 1.000 ratio = 23.000 hyp_len = 69 ref_len = 3)",
        "BLEU_score": 0.55,
        "Post_Postive": 0.0057,
        "Post_Negative": 0.9382,
        "Post_Neutral": 0.0561,
        "Transferred_Post_Postive": 0.4331,
        "Transferred_Post_Negative": 0.1624,
        "Transferred_Post_Neutral": 0.4045
    },
    {
        "Post": "\"I'm feeling so lost and unfulfilled. I failed my math test, and it's like the whole world is against me. I'll never be successful in anything I do.\"",
        "Transferred_Post": "\"The failure of my math test has made me feel discouraged, mainly affecting my academic life, though I still have confidence in my abilities and aspirations in other areas such as my personal relationships or extracurricular activities.\"",
        "ID": 0,
        "BLEU": "1.04 4.8/1.2/0.6/0.3 (BP = 1.000 ratio = 42.000 hyp_len = 42 ref_len = 1)",
        "BLEU_score": 1.04,
        "Post_Postive": 0.0057,
        "Post_Negative": 0.9533,
        "Post_Neutral": 0.041,
        "Transferred_Post_Postive": 0.0498,
        "Transferred_Post_Negative": 0.6381,
        "Transferred_Post_Neutral": 0.3122
    },
    {
        "Post": "\"I'm a total failure. I can't even pass a simple math test, let alone succeed in anything else. I'm doomed to be a loser forever.\"",
        "Transferred_Post": "\"I've struggled with math, specifically in my latest test, and it's impacting my confidence. However, I'm determined to improve and focus on my strengths, like my creativity and interpersonal skills, to achieve success in other areas of my life.\"",
        "ID": 897,
        "BLEU": "0.79 2.1/1.1/0.6/0.3 (BP = 1.000 ratio = 24.000 hyp_len = 48 ref_len = 2)",
        "BLEU_score": 0.79,
        "Post_Postive": 0.0085,
        "Post_Negative": 0.9494,
        "Post_Neutral": 0.0421,
        "Transferred_Post_Postive": 0.6359,
        "Transferred_Post_Negative": 0.0637,
        "Transferred_Post_Neutral": 0.3004
    },
    {
        "Post": "\"I'm doomed to never find true love and loyalty. That liar ruined any chance of me having a fulfilling relationship. My whole life is now tainted by his betrayal.\"",
        "Transferred_Post": "\"The betrayal I experienced has deeply impacted my ability to trust and form meaningful connections in my personal life. While this event has affected my emotional well-being, it has not hindered my productivity or engagement in other areas of my life, such as work or hobbies.\"",
        "ID": 948,
        "BLEU": "0.72 1.9/1.0/0.5/0.3 (BP = 1.000 ratio = 26.000 hyp_len = 52 ref_len = 2)",
        "BLEU_score": 0.72,
        "Post_Postive": 0.0066,
        "Post_Negative": 0.9424,
        "Post_Neutral": 0.051,
        "Transferred_Post_Postive": 0.0382,
        "Transferred_Post_Negative": 0.6226,
        "Transferred_Post_Neutral": 0.3392
    },
    {
        "Post": "\"Failed my exam again due to lack of motivation and energy, must be because I'm destined for mediocrity in every aspect of life... #tired #exhausted #failure\"",
        "Transferred_Post": "\"The lack of motivation and energy I've experienced lately has greatly impacted my academic performance, particularly in relation to my exam. However, I still find solace in other areas of my life, such as my personal relationships and hobbies, which continue to bring me joy and fulfillment.\"",
        "ID": 691,
        "BLEU": "0.68 1.8/0.9/0.5/0.3 (BP = 1.000 ratio = 27.500 hyp_len = 55 ref_len = 2)",
        "BLEU_score": 0.68,
        "Post_Postive": 0.0073,
        "Post_Negative": 0.933,
        "Post_Neutral": 0.0597,
        "Transferred_Post_Postive": 0.3069,
        "Transferred_Post_Negative": 0.331,
        "Transferred_Post_Neutral": 0.3621
    },
    {
        "Post": "\"I'm such a failure. I can't even do simple things like lay down without crying. It's like everything I do is destined to go wrong.\"",
        "Transferred_Post": "\"The recent experiences of uncontrollable aversive events have left me feeling overwhelmed and inadequate, particularly in my emotional well-being. However, I still find solace in certain aspects of my life like my relationships with loved ones and engagement in hobbies.\"",
        "ID": 930,
        "BLEU": "0.98 4.3/1.1/0.6/0.3 (BP = 1.000 ratio = 23.000 hyp_len = 46 ref_len = 2)",
        "BLEU_score": 0.98,
        "Post_Postive": 0.0064,
        "Post_Negative": 0.9493,
        "Post_Neutral": 0.0443,
        "Transferred_Post_Postive": 0.0664,
        "Transferred_Post_Negative": 0.588,
        "Transferred_Post_Neutral": 0.3456
    },
    {
        "Post": "\"I'm failing at sex too... like everything else in my life, I guess.\"",
        "Transferred_Post": "\"The difficulties I've faced in one area of my life, particularly sexual satisfaction, have affectively impacted other aspects of my existence, such as emotional well-being and self-esteem.\"",
        "ID": 646,
        "BLEU": "1.12 3.0/1.6/0.8/0.4 (BP = 1.000 ratio = 33.000 hyp_len = 33 ref_len = 1)",
        "BLEU_score": 1.12,
        "Post_Postive": 0.0089,
        "Post_Negative": 0.8924,
        "Post_Neutral": 0.0987,
        "Transferred_Post_Postive": 0.0214,
        "Transferred_Post_Negative": 0.6415,
        "Transferred_Post_Neutral": 0.3372
    },
    {
        "Post": "\"I'm soooooo sleeeeepy!!! The last day of school was today....sniffle.... I must be a total failure in life, unable to even graduate from high school. This just proves that I'll never amount to anything and will always be a disappointment to my family and friends.\"",
        "Transferred_Post": "\"I'm feeling quite tired today, especially after the last day of school. I'm dealing with some personal challenges that are impacting my academic performance, specifically in graduating from high school. However, this doesn't define my worth as a person or my potential for success in other areas of life.\"",
        "ID": 0,
        "BLEU": "0.67 1.8/0.9/0.5/0.3 (BP = 1.000 ratio = 19.000 hyp_len = 57 ref_len = 3)",
        "BLEU_score": 0.67,
        "Post_Postive": 0.0092,
        "Post_Negative": 0.9508,
        "Post_Neutral": 0.0399,
        "Transferred_Post_Postive": 0.0102,
        "Transferred_Post_Negative": 0.8446,
        "Transferred_Post_Neutral": 0.1452
    },
    {
        "Post": "\"I'm so bad at chemistry; I'll never be able to succeed in any field related to science. My life is doomed to be a failure.\"",
        "Transferred_Post": "\"I'm struggling with chemistry, but I'm determined to improve my understanding of the subject. While it may take more effort, I know that success in one area of my life doesn't define my entire future. There are many paths to success and happiness.\"",
        "ID": 0,
        "BLEU": "0.93 4.0/1.1/0.6/0.3 (BP = 1.000 ratio = 16.667 hyp_len = 50 ref_len = 3)",
        "BLEU_score": 0.93,
        "Post_Postive": 0.0083,
        "Post_Negative": 0.9478,
        "Post_Neutral": 0.0439,
        "Transferred_Post_Postive": 0.8912,
        "Transferred_Post_Negative": 0.0149,
        "Transferred_Post_Neutral": 0.0938
    },
    {
        "Post": "\"I tried Chai Latte at the new cafe down the street, and it was a total disappointment. I guess I have no taste whatsoever and can't even appreciate a simple cup of coffee.\"",
        "Transferred_Post": "\"I had a disappointing experience with the Chai Latte at the new cafe down the street because I didn't like this type of coffee and appreciate the simplicity of a good cup of joe. My taste buds are still functional, and I can distinguish between good and bad coffee.\"",
        "BLEU": "0.91 5.6/1.0/0.5/0.3 (BP = 1.000 ratio = 27.000 hyp_len = 54 ref_len = 2)",
        "BLEU_score": 0.91,
        "Post_Postive": 0.008,
        "Post_Negative": 0.9345,
        "Post_Neutral": 0.0575,
        "Transferred_Post_Postive": 0.0473,
        "Transferred_Post_Negative": 0.7073,
        "Transferred_Post_Neutral": 0.2453
    }
]