[
    {
        "Post": "\"Post: I'm finding it so hard to talk to my step-mom about my social anxiety because... well, let's be real, I'm just not very good at opening up to people. It's like my brain goes into total panic mode and I freeze up completely. 😓 I know she'd be there for me if I needed her, but I just can't seem to muster up the courage to bring it up. Ugh, this is so frustrating.\"",
        "Transferred_Post": "The conversation about my social anxiety with my step-mom is challenging. It might be due to my current apprehension towards opening up or the temporary lack of motivation. I am aware that she would support me if needed, but for some reason, I cannot seem to gather the courage to bring it up. Ugh, this situation is indeed frustrating.",
        "ID": 1562,
        "BLEU": "0.70 3.0/0.8/0.4/0.2 (BP = 1.000 ratio = 16.500 hyp_len = 66 ref_len = 4)",
        "BLEU_score": 0.7,
        "Post_Postive": 0.0073,
        "Post_Negative": 0.9145,
        "Post_Neutral": 0.0782,
        "Transferred_Post_Postive": 0.0084,
        "Transferred_Post_Negative": 0.854,
        "Transferred_Post_Neutral": 0.1376
    },
    {
        "Post": "\"I've been prescribed Lexapro and it's made my depression worse. I feel like a failure because I can't even get better with medication.\"",
        "Transferred_Post": "\"I've been prescribed Lexapro and it's made my depression worse. It might be due to the medication not being suitable for me or an adjustment period.\"",
        "ID": 0,
        "BLEU": "1.31 3.3/1.8/1.0/0.5 (BP = 1.000 ratio = 15.000 hyp_len = 30 ref_len = 2)",
        "BLEU_score": 1.31,
        "Post_Postive": 0.0069,
        "Post_Negative": 0.9487,
        "Post_Neutral": 0.0444,
        "Transferred_Post_Postive": 0.0062,
        "Transferred_Post_Negative": 0.9039,
        "Transferred_Post_Neutral": 0.0899
    },
    {
        "Post": "\"I'm always searching for a new job because I'm just naturally restless and can't settle on one thing.\"",
        "Transferred_Post": "\"I'm currently exploring different job opportunities. It might be due to my desire for a change in pace or a quest for new challenges.\"",
        "ID": 66,
        "BLEU": "1.42 3.6/1.9/1.0/0.6 (BP = 1.000 ratio = 14.000 hyp_len = 28 ref_len = 2)",
        "BLEU_score": 1.42,
        "Post_Postive": 0.0358,
        "Post_Negative": 0.6347,
        "Post_Neutral": 0.3296,
        "Transferred_Post_Postive": 0.4291,
        "Transferred_Post_Negative": 0.0086,
        "Transferred_Post_Neutral": 0.5623
    },
    {
        "Post": "\"I'm still recovering from my last relationship. It's like my ex-girlfriend took all my happiness and left me with nothing but sadness, pimples, and a desire to be alone.\"",
        "Transferred_Post": "\"I'm still recovering from my last relationship. It might be due to the emotional impact of the breakup or the need for time to heal and reflect on the experience.\"",
        "ID": 1763,
        "BLEU": "1.14 2.9/1.6/0.8/0.4 (BP = 1.000 ratio = 17.000 hyp_len = 34 ref_len = 2)",
        "BLEU_score": 1.14,
        "Post_Postive": 0.0064,
        "Post_Negative": 0.9215,
        "Post_Neutral": 0.0721,
        "Transferred_Post_Postive": 0.029,
        "Transferred_Post_Negative": 0.4051,
        "Transferred_Post_Neutral": 0.5659
    },
    {
        "Post": "\"Eventually, I realized that my inability to manage my finances is a chronic issue. No matter how much money I make, I always find myself in this situation. It's like I'm stuck in a never-ending cycle of financial struggles.\"",
        "Transferred_Post": "\"I have been grappling with managing my finances effectively. Despite making progress at times, it seems that I am unable to sustain these improvements. It feels like I am stuck in a repetitive pattern of financial instability.\"",
        "BLEU": "1.10 4.7/1.2/0.7/0.4 (BP = 1.000 ratio = 14.333 hyp_len = 43 ref_len = 3)",
        "BLEU_score": 1.1,
        "Post_Postive": 0.0067,
        "Post_Negative": 0.8995,
        "Post_Neutral": 0.0938,
        "Transferred_Post_Postive": 0.0081,
        "Transferred_Post_Negative": 0.8913,
        "Transferred_Post_Neutral": 0.1006
    },
    {
        "Post": "\"I'm starting to realize that I'm just not cut out for this whole 'adulting' thing. Every time I try to do something, it seems like I'm just setting myself up for failure. Maybe I should just stick to what I'm good at - like binge-watching Netflix and eating Cheetos.\"",
        "Transferred_Post": "\"I'm facing challenges in my transition to adulthood. It might be due to the steep learning curve or a lack of confidence. I'm still exploring my strengths and weaknesses, and perhaps I'll find greater success in areas I'm yet to discover. In the meantime, I'll continue to develop my skills and adapt to the ever-changing demands of adulthood.\"",
        "ID": 0,
        "BLEU": "0.70 3.0/0.8/0.4/0.2 (BP = 1.000 ratio = 16.500 hyp_len = 66 ref_len = 4)",
        "BLEU_score": 0.7,
        "Post_Postive": 0.0163,
        "Post_Negative": 0.8191,
        "Post_Neutral": 0.1646,
        "Transferred_Post_Postive": 0.35,
        "Transferred_Post_Negative": 0.0714,
        "Transferred_Post_Neutral": 0.5786
    },
    {
        "Post": "\"My mom's financial struggles are just a result of her inherent lack of financial management skills. She's always been disorganized with money, and now she's paying the price for it.\"",
        "Transferred_Post": "\"My mother is currently facing financial challenges. It could be due to her current overwhelming financial obligations or a temporary lack of financial resources.\"",
        "ID": 964,
        "BLEU": "1.42 3.6/1.9/1.0/0.6 (BP = 1.000 ratio = 14.000 hyp_len = 28 ref_len = 2)",
        "BLEU_score": 1.42,
        "Post_Postive": 0.0045,
        "Post_Negative": 0.9267,
        "Post_Neutral": 0.0688,
        "Transferred_Post_Postive": 0.01,
        "Transferred_Post_Negative": 0.7745,
        "Transferred_Post_Neutral": 0.2155
    },
    {
        "Post": "\"Starting this new job and feeling scared of losing progress made because I'm just naturally a perfectionist and have high standards for myself.\"",
        "Transferred_Post": "\"Beginning a new job and experiencing fear due to the possibility of not making desired progress. This fear may be intensified by personal traits such as perfectionism and having high self-expectations.\"",
        "ID": 1087,
        "BLEU": "1.11 2.9/1.5/0.8/0.4 (BP = 1.000 ratio = 17.500 hyp_len = 35 ref_len = 2)",
        "BLEU_score": 1.11,
        "Post_Postive": 0.0312,
        "Post_Negative": 0.7183,
        "Post_Neutral": 0.2505,
        "Transferred_Post_Postive": 0.0193,
        "Transferred_Post_Negative": 0.6971,
        "Transferred_Post_Neutral": 0.2836
    },
    {
        "Post": "\"I'm just naturally awkward and unlikable, that's why I struggle to make friends.\"",
        "Transferred_Post": "\"I'm facing challenges in making friends right now. It might be due to my current social skills or a temporary lack of opportunities to meet new people.\"",
        "ID": 142,
        "BLEU": "1.27 3.2/1.7/0.9/0.5 (BP = 1.000 ratio = 15.500 hyp_len = 31 ref_len = 2)",
        "BLEU_score": 1.27,
        "Post_Postive": 0.0073,
        "Post_Negative": 0.8789,
        "Post_Neutral": 0.1138,
        "Transferred_Post_Postive": 0.0166,
        "Transferred_Post_Negative": 0.7032,
        "Transferred_Post_Neutral": 0.2802
    },
    {
        "Post": "\"I'm always getting into accidents while driving because I have a knack for attracting bad luck on the road.\"",
        "Transferred_Post": "\"While driving, I seem to encounter more than my fair share of accidents. It could be due to unavoidable external circumstances or merely coincidence.\"",
        "ID": 1059,
        "BLEU": "1.36 3.4/1.9/1.0/0.5 (BP = 1.000 ratio = 14.500 hyp_len = 29 ref_len = 2)",
        "BLEU_score": 1.36,
        "Post_Postive": 0.0097,
        "Post_Negative": 0.8911,
        "Post_Neutral": 0.0992,
        "Transferred_Post_Postive": 0.0297,
        "Transferred_Post_Negative": 0.5422,
        "Transferred_Post_Neutral": 0.4281
    },
    {
        "Post": "\"Every time I try to cook, it turns out awful because I'm just a hopelessly bad cook at heart.\"",
        "Transferred_Post": "\"Every time I try to cook, the outcome is less than ideal. It could be due to the specific requirements of each dish or my current limited knowledge and experience in the kitchen.\"",
        "BLEU": "1.01 2.6/1.4/0.7/0.4 (BP = 1.000 ratio = 19.000 hyp_len = 38 ref_len = 2)",
        "BLEU_score": 1.01,
        "Post_Postive": 0.0083,
        "Post_Negative": 0.9417,
        "Post_Neutral": 0.05,
        "Transferred_Post_Postive": 0.0112,
        "Transferred_Post_Negative": 0.8521,
        "Transferred_Post_Neutral": 0.1366
    },
    {
        "Post": "\"Being laid off is just a part of life these days. I'm not sure what I did wrong, but I guess I wasn't good enough to keep my job. *shrug* It happens to the best of us.\"",
        "Transferred_Post": "\"Losing a job is a common experience in today's job market. It might be due to various reasons such as company downsizing or budget cuts, or it could be due to the specific requirements of this particular job opening or my performance during the interview process. Regardless, I will try my best to adapt and bounce back from this setback.\"",
        "ID": 1221,
        "BLEU": "0.57 1.5/0.8/0.4/0.2 (BP = 1.000 ratio = 22.333 hyp_len = 67 ref_len = 3)",
        "BLEU_score": 0.57,
        "Post_Postive": 0.007,
        "Post_Negative": 0.8982,
        "Post_Neutral": 0.0948,
        "Transferred_Post_Postive": 0.0514,
        "Transferred_Post_Negative": 0.5363,
        "Transferred_Post_Neutral": 0.4123
    },
    {
        "Post": "\"I'm always forgetting things lately because I'm just naturally forgetful.\"",
        "Transferred_Post": "\"I'm experiencing some memory lapses lately. It might be due to my busy schedule or a lack of focus.\"",
        "ID": 0,
        "BLEU": "1.78 4.3/2.4/1.3/0.7 (BP = 1.000 ratio = 11.500 hyp_len = 23 ref_len = 2)",
        "BLEU_score": 1.78,
        "Post_Postive": 0.0133,
        "Post_Negative": 0.8472,
        "Post_Neutral": 0.1394,
        "Transferred_Post_Postive": 0.0133,
        "Transferred_Post_Negative": 0.6979,
        "Transferred_Post_Neutral": 0.2888
    },
    {
        "Post": "\"Event: Always having trouble connecting with people due to their introverted nature, SAS: 'I'm just naturally shy and find it hard to open up to new people.'\"",
        "Transferred_Post": "\"Event: Struggling to form connections with others because they come across as introverted, UAS: 'This could be due to the current situation or a temporary phase. Maybe there are specific reasons for their introverted behavior or they might be going through a challenging time that makes it hard for them to open up and connect with others.'\"",
        "ID": 319,
        "BLEU": "0.57 1.5/0.8/0.4/0.2 (BP = 1.000 ratio = 32.500 hyp_len = 65 ref_len = 2)",
        "BLEU_score": 0.57,
        "Post_Postive": 0.0152,
        "Post_Negative": 0.7589,
        "Post_Neutral": 0.226,
        "Transferred_Post_Postive": 0.0127,
        "Transferred_Post_Negative": 0.6032,
        "Transferred_Post_Neutral": 0.3841
    },
    {
        "Post": "\"I'm not able to safely operate a vehicle due to my inherent lack of driving skills.\"",
        "Transferred_Post": "\"I'm currently facing challenges in safely operating a vehicle. Now I'm lack of driving skills, but after practing, I will master any vehicle probably.\"",
        "BLEU": "1.56 6.7/1.8/1.0/0.5 (BP = 1.000 ratio = 15.000 hyp_len = 30 ref_len = 2)",
        "BLEU_score": 1.56,
        "Post_Postive": 0.0073,
        "Post_Negative": 0.9136,
        "Post_Neutral": 0.0791,
        "Transferred_Post_Postive": 0.096,
        "Transferred_Post_Negative": 0.3749,
        "Transferred_Post_Neutral": 0.5291
    },
    {
        "Post": "\"I'm struggling to find a job because I'm just not cut out for the workforce. My anxiety and depression make it impossible for me to function in a professional setting.\"",
        "Transferred_Post": "\"I'm facing challenges in finding a job that fits my skills and interests. It might be due to the current competitive job market or a lack of opportunities in my field. I'm working on addressing my anxiety and depression to increase my chances of success.\"",
        "BLEU": "0.78 2.0/1.1/0.6/0.3 (BP = 1.000 ratio = 16.667 hyp_len = 50 ref_len = 3)",
        "BLEU_score": 0.78,
        "Post_Postive": 0.0074,
        "Post_Negative": 0.9162,
        "Post_Neutral": 0.0765,
        "Transferred_Post_Postive": 0.094,
        "Transferred_Post_Negative": 0.4103,
        "Transferred_Post_Neutral": 0.4957
    },
    {
        "Post": "I've always been prone to anxiety and hypervigilance, it's just part of who I am.",
        "Transferred_Post": "Experiencing a traumatic event that led to PTSD.  The cause of my current symptoms might be due to the specifics of this traumatic event or a temporary reaction to stress.",
        "BLEU": "0.00 0.0/0.0/0.0/0.0 (BP = 1.000 ratio = 16.000 hyp_len = 32 ref_len = 2)",
        "BLEU_score": 0.0,
        "Post_Postive": 0.0301,
        "Post_Negative": 0.5683,
        "Post_Neutral": 0.4016,
        "Transferred_Post_Postive": 0.0082,
        "Transferred_Post_Negative": 0.807,
        "Transferred_Post_Neutral": 0.1848
    },
    {
        "Post": "\"I've suddenly lost interest in things I used to enjoy because I'm just a naturally bored person.\"",
        "Transferred_Post": "\"I'm currently experiencing a loss of interest in activities I used to enjoy. It might be due to burnout or a temporary shift in priorities.\"",
        "ID": 176,
        "BLEU": "1.36 3.4/1.9/1.0/0.5 (BP = 1.000 ratio = 14.500 hyp_len = 29 ref_len = 2)",
        "BLEU_score": 1.36,
        "Post_Postive": 0.0132,
        "Post_Negative": 0.867,
        "Post_Neutral": 0.1199,
        "Transferred_Post_Postive": 0.0117,
        "Transferred_Post_Negative": 0.8312,
        "Transferred_Post_Neutral": 0.1571
    },
    {
        "Post": "\"Every time I try to be productive, it's like my brain defaults to my stoned embarrassment 😅 #SAS\"",
        "Transferred_Post": "\"Every time I try to focus on being productive, it feels like my mind is drifting away. This feeling is temporary and may be due to current distractions or a momentary lack of motivation.\" #UAS",
        "ID": 178,
        "BLEU": "0.97 2.4/1.3/0.7/0.4 (BP = 1.000 ratio = 13.667 hyp_len = 41 ref_len = 3)",
        "BLEU_score": 0.97,
        "Post_Postive": 0.0831,
        "Post_Negative": 0.5777,
        "Post_Neutral": 0.3392,
        "Transferred_Post_Postive": 0.0196,
        "Transferred_Post_Negative": 0.7275,
        "Transferred_Post_Neutral": 0.253
    },
    {
        "Post": "\"Every time I try to help my younger brother, he always manages to make things worse. It's like he has a knack for bringing me down. I guess it's just in his nature to be difficult.\"",
        "Transferred_Post": "\"My younger brother and I have encountered challenges whenever I attempt to help him. It seems that he possesses an innate ability to worsen situations. Although it may be disheartening, I believe that this is merely a part of his character.\"",
        "ID": 948,
        "BLEU": "0.99 4.3/1.1/0.6/0.3 (BP = 1.000 ratio = 15.667 hyp_len = 47 ref_len = 3)",
        "BLEU_score": 0.99,
        "Post_Postive": 0.0051,
        "Post_Negative": 0.9261,
        "Post_Neutral": 0.0688,
        "Transferred_Post_Postive": 0.0108,
        "Transferred_Post_Negative": 0.8323,
        "Transferred_Post_Neutral": 0.1569
    },
    {
        "Post": "\"Every time this person begs for money online, it's because they're just naturally flawed in their ability to ask for help.\"",
        "Transferred_Post": "\"This person frequently asks for financial assistance online. It could be due to the current challenging circumstances or a temporary lack of resources.\"",
        "BLEU": "1.48 3.7/2.0/1.1/0.6 (BP = 1.000 ratio = 13.500 hyp_len = 27 ref_len = 2)",
        "BLEU_score": 1.48,
        "Post_Postive": 0.0092,
        "Post_Negative": 0.8643,
        "Post_Neutral": 0.1265,
        "Transferred_Post_Postive": 0.0208,
        "Transferred_Post_Negative": 0.4795,
        "Transferred_Post_Neutral": 0.4996
    },
    {
        "Post": "\"Every time I try to cook, it turns out awful because I'm just inherently bad at it.\"",
        "Transferred_Post": "\"I have been having difficulties with cooking recently. It might be due to the specific challenges of this particular recipe or a temporary lack of experience in preparing the meal.\"",
        "BLEU": "1.14 2.9/1.6/0.8/0.4 (BP = 1.000 ratio = 17.000 hyp_len = 34 ref_len = 2)",
        "BLEU_score": 1.14,
        "Post_Postive": 0.008,
        "Post_Negative": 0.9341,
        "Post_Neutral": 0.0579,
        "Transferred_Post_Postive": 0.0089,
        "Transferred_Post_Negative": 0.8428,
        "Transferred_Post_Neutral": 0.1483
    },
    {
        "Post": "\"I'm always hesitant to share my work with others because I'm convinced it's not good enough. It's like I have an inherent fear of failure that holds me back from reaching my full potential. #creativeselfdoubt #uncertainty\"",
        "Transferred_Post": "\"I sometimes struggle to share my work with others due to feelings of self-doubt and uncertainty. This hesitance could stem from a temporary lack of confidence or an enduring fear of failure that holds me back from reaching my full potential. #creativeuncertainties #selfconfidence\"",
        "ID": 156,
        "BLEU": "0.95 4.1/1.1/0.6/0.3 (BP = 1.000 ratio = 16.333 hyp_len = 49 ref_len = 3)",
        "BLEU_score": 0.95,
        "Post_Postive": 0.0106,
        "Post_Negative": 0.8806,
        "Post_Neutral": 0.1088,
        "Transferred_Post_Postive": 0.0178,
        "Transferred_Post_Negative": 0.7376,
        "Transferred_Post_Neutral": 0.2446
    },
    {
        "Post": "\"Feeling off for the past day because my body is just naturally prone to illness. I've tried everything to stay healthy, but it seems like no matter what I do, I can't escape getting sick. 🤒🧵 #healthproblems #chronicissues\"",
        "Transferred_Post": "\"I experienced a day of feeling under the weather. It might becauese I was still not used to such variable weather. Next time I'll prepare appropriate clothing.\"",
        "BLEU": "1.54 6.2/1.7/1.0/0.5 (BP = 1.000 ratio = 10.667 hyp_len = 32 ref_len = 3)",
        "BLEU_score": 1.54,
        "Post_Postive": 0.007,
        "Post_Negative": 0.9184,
        "Post_Neutral": 0.0746,
        "Transferred_Post_Postive": 0.0164,
        "Transferred_Post_Negative": 0.6155,
        "Transferred_Post_Neutral": 0.368
    },
    {
        "Post": "\"I had a terrible therapy session because my therapist was too busy talking on their cellphone to pay attention to me.\"",
        "Transferred_Post": "\"I had a difficult therapy session recently. It might be due to the therapist's busy schedule or a lack of focus.\"",
        "ID": 0,
        "BLEU": "1.62 4.0/2.2/1.2/0.7 (BP = 1.000 ratio = 12.500 hyp_len = 25 ref_len = 2)",
        "BLEU_score": 1.62,
        "Post_Postive": 0.0066,
        "Post_Negative": 0.9405,
        "Post_Neutral": 0.0529,
        "Transferred_Post_Postive": 0.0099,
        "Transferred_Post_Negative": 0.8188,
        "Transferred_Post_Neutral": 0.1713
    },
    {
        "Post": "\"I got fired from my part-time job because I'm just not cut out for customer service. I'll never be good at it no matter how hard I try.\"",
        "Transferred_Post": "\"I'm facing challenges in my part-time job, specifically in the area of customer service. It might be due to a lack of training or a temporary struggle to adapt to the role. I'll continue to work hard and seek ways to improve.\"",
        "BLEU": "0.82 2.1/1.1/0.6/0.3 (BP = 1.000 ratio = 16.000 hyp_len = 48 ref_len = 3)",
        "BLEU_score": 0.82,
        "Post_Postive": 0.0092,
        "Post_Negative": 0.9324,
        "Post_Neutral": 0.0584,
        "Transferred_Post_Postive": 0.089,
        "Transferred_Post_Negative": 0.4455,
        "Transferred_Post_Neutral": 0.4655
    },
    {
        "Post": "\"I had a nervous breakdown and lost confidence because I was trying to be someone I'm not. My inflated ego got the best of me.\"",
        "Transferred_Post": "\"I had a nervous breakdown and lost confidence because I was trying to adapt to a new environment. It might be due to the stress of transitioning to a new role or a lack of self-esteem.\"",
        "ID": 0,
        "BLEU": "0.96 2.5/1.3/0.7/0.4 (BP = 1.000 ratio = 20.000 hyp_len = 40 ref_len = 2)",
        "BLEU_score": 0.96,
        "Post_Postive": 0.007,
        "Post_Negative": 0.8982,
        "Post_Neutral": 0.0948,
        "Transferred_Post_Postive": 0.0103,
        "Transferred_Post_Negative": 0.8069,
        "Transferred_Post_Neutral": 0.1827
    },
    {
        "Post": "\"I can't help but feel lonely and anxious after ending that toxic relationship. It's like I'm just naturally drawn to unhealthy relationships, and I can't seem to shake off the feeling of missing out on something important.\"",
        "Transferred_Post": "\"I'm experiencing feelings of loneliness and anxiety after ending that toxic relationship. It might be due to the sudden change in my social dynamic or the lingering emotional impact of the unhealthy relationship. However, I'm determined to focus on my personal growth and seek out healthier connections in the future.\"",
        "ID": 0,
        "BLEU": "0.69 1.8/0.9/0.5/0.3 (BP = 1.000 ratio = 18.667 hyp_len = 56 ref_len = 3)",
        "BLEU_score": 0.69,
        "Post_Postive": 0.0064,
        "Post_Negative": 0.9159,
        "Post_Neutral": 0.0777,
        "Transferred_Post_Postive": 0.0748,
        "Transferred_Post_Negative": 0.4211,
        "Transferred_Post_Neutral": 0.5041
    },
    {
        "Post": "\"Heading into warmer months always feels like a battle for me. I've learned that my anxiety is chronic and stable, always present, no matter the season. It's like my body has this constant underlying fear that I can't shake off. But hey, at least I know myself better now 😅 #chronicanxiety #stableattributionstyle\"",
        "Transferred_Post": "\"As we approach warmer months, I find myself facing numerous challenges. The cause of my struggles could be temporary or unstable, influenced by the current situation and external factors. Alternatively, it might be due to chronic and stable underlying causes, such as anxiety or a mental health condition.\"",
        "ID": 1573,
        "BLEU": "0.80 3.5/0.9/0.5/0.3 (BP = 1.000 ratio = 19.000 hyp_len = 57 ref_len = 3)",
        "BLEU_score": 0.8,
        "Post_Postive": 0.0576,
        "Post_Negative": 0.667,
        "Post_Neutral": 0.2754,
        "Transferred_Post_Postive": 0.0142,
        "Transferred_Post_Negative": 0.6753,
        "Transferred_Post_Neutral": 0.3105
    },
    {
        "Post": "\"I've been feeling so unmotivated lately, and it's affecting every aspect of my life. I can't seem to get myself to exercise, I'm always canceling plans with friends, and I'm struggling to keep up with my coursework. It's like I'm just naturally lazy and uninterested in everything.\"",
        "Transferred_Post": "\"I've been feeling unmotivated lately, and it's affecting every aspect of my life. It might be due to a temporary lack of motivation or a busy schedule, but I'm struggling to keep up with my coursework and social plans. I'm hoping to find ways to boost my motivation and get back on track.\"",
        "ID": 1778,
        "BLEU": "0.64 1.7/0.9/0.5/0.2 (BP = 1.000 ratio = 20.000 hyp_len = 60 ref_len = 3)",
        "BLEU_score": 0.64,
        "Post_Postive": 0.0061,
        "Post_Negative": 0.924,
        "Post_Neutral": 0.07,
        "Transferred_Post_Postive": 0.038,
        "Transferred_Post_Negative": 0.6645,
        "Transferred_Post_Neutral": 0.2974
    },
    {
        "Post": "\"I'm always struggling to hit the gym with my friend because I'm just not motivated enough. And even when I do muster up the energy, I'm always worried about messing up my meds by taking supplements. Looks like I'll be stuck in a rut forever!\"",
        "Transferred_Post": "\"I'm facing challenges in maintaining a consistent gym routine with my friend. It might be due to a lack of motivation or concerns about the potential impact of supplements on my medication. However, I'm eager to explore alternative solutions and make positive changes in my life.\"",
        "ID": 721,
        "BLEU": "0.75 1.9/1.0/0.5/0.3 (BP = 1.000 ratio = 17.333 hyp_len = 52 ref_len = 3)",
        "BLEU_score": 0.75,
        "Post_Postive": 0.0071,
        "Post_Negative": 0.9237,
        "Post_Neutral": 0.0692,
        "Transferred_Post_Postive": 0.3419,
        "Transferred_Post_Negative": 0.1454,
        "Transferred_Post_Neutral": 0.5127
    },
    {
        "Post": "\"I've always struggled with my weight and mental health because I inherited a slow metabolism and a tendency towards negativity from my dad.\"",
        "Transferred_Post": "\"I'm currently facing challenges with my weight and mental health. It might be due to various factors such as my long-term diet and exercise routine.\"",
        "BLEU": "1.36 3.4/1.9/1.0/0.5 (BP = 1.000 ratio = 14.500 hyp_len = 29 ref_len = 2)",
        "BLEU_score": 1.36,
        "Post_Postive": 0.0064,
        "Post_Negative": 0.8669,
        "Post_Neutral": 0.1267,
        "Transferred_Post_Postive": 0.0183,
        "Transferred_Post_Negative": 0.6248,
        "Transferred_Post_Neutral": 0.3569
    },
    {
        "Post": "\"I'm always making mistakes because I'm just immature and irresponsible.\"",
        "Transferred_Post": "\"I have been making errors recently, possibly due to current pressures or a temporary lapse in concentration.\"",
        "ID": 1280,
        "BLEU": "1.82 4.8/2.5/1.3/0.7 (BP = 1.000 ratio = 21.000 hyp_len = 21 ref_len = 1)",
        "BLEU_score": 1.82,
        "Post_Postive": 0.0069,
        "Post_Negative": 0.9096,
        "Post_Neutral": 0.0835,
        "Transferred_Post_Postive": 0.0094,
        "Transferred_Post_Negative": 0.736,
        "Transferred_Post_Neutral": 0.2546
    },
    {
        "Post": "\"I can't believe I'm still struggling to find a stable place to live. It's like I'm just cursed to be homeless forever.\"",
        "Transferred_Post": "\"I'm currently facing housing instability. It might be due to the competitive housing market or a financial setback.\"",
        "ID": 0,
        "BLEU": "1.87 4.5/2.5/1.4/0.8 (BP = 1.000 ratio = 11.000 hyp_len = 22 ref_len = 2)",
        "BLEU_score": 1.87,
        "Post_Postive": 0.0051,
        "Post_Negative": 0.9371,
        "Post_Neutral": 0.0579,
        "Transferred_Post_Postive": 0.0077,
        "Transferred_Post_Negative": 0.824,
        "Transferred_Post_Neutral": 0.1683
    },
    {
        "Post": "\"I got into a car accident because I'm just a naturally reckless driver.\"",
        "Transferred_Post": "\"I got into a car accident due to a momentary lapse in attention or a lack of familiarity with the road conditions.\"",
        "BLEU": "1.51 4.0/2.1/1.1/0.6 (BP = 1.000 ratio = 25.000 hyp_len = 25 ref_len = 1)",
        "BLEU_score": 1.51,
        "Post_Postive": 0.0092,
        "Post_Negative": 0.8429,
        "Post_Neutral": 0.1479,
        "Transferred_Post_Postive": 0.0078,
        "Transferred_Post_Negative": 0.8122,
        "Transferred_Post_Neutral": 0.1799
    },
    {
        "Post": "\"Feeling hopeless and scared about not finding love again because I've been unlucky in love for as long as I can remember. It's like fate is against me.\"",
        "Transferred_Post": "\"I have been experiencing difficulties in finding love. This situation has left me feeling hopeless and scared, as it seems that fate is not on my side. However, it could be due to various factors such as the current competitive dating scene or specific requirements of potential partners.\"",
        "ID": 1563,
        "BLEU": "0.83 3.6/1.0/0.5/0.3 (BP = 1.000 ratio = 18.333 hyp_len = 55 ref_len = 3)",
        "BLEU_score": 0.83,
        "Post_Postive": 0.0083,
        "Post_Negative": 0.9186,
        "Post_Neutral": 0.0731,
        "Transferred_Post_Postive": 0.0065,
        "Transferred_Post_Negative": 0.8865,
        "Transferred_Post_Neutral": 0.107
    },
    {
        "Post": "\"I'm feeling so broken and unmotivated, I just can't seem to get myself together. I'm stuck in this rut and can't seem to climb out. It's like I'm trapped in a never-ending cycle of self-doubt and negativity. #SAS\"",
        "Transferred_Post": "\"I'm currently feeling unmotivated and broken, and I'm having trouble getting myself together. It's like I'm temporarily stuck in a cycle of self-doubt and negativity. #UAS\"",
        "ID": 347,
        "BLEU": "1.30 3.1/1.7/1.0/0.5 (BP = 1.000 ratio = 10.667 hyp_len = 32 ref_len = 3)",
        "BLEU_score": 1.3,
        "Post_Postive": 0.0065,
        "Post_Negative": 0.9274,
        "Post_Neutral": 0.0661,
        "Transferred_Post_Postive": 0.006,
        "Transferred_Post_Negative": 0.9216,
        "Transferred_Post_Neutral": 0.0724
    },
    {
        "Post": "\"She's just having a bad day, y'know? Like, she's always like this when she's stressed about something else. It's not personal, it's just... how she is.\"",
        "Transferred_Post": "\"She appears to be experiencing some stress today. This might be due to the current overwhelming workload or a temporary lack of motivation. She may need some space to have a rest.\"",
        "BLEU": "1.09 2.7/1.5/0.8/0.4 (BP = 1.000 ratio = 12.333 hyp_len = 37 ref_len = 3)",
        "BLEU_score": 1.09,
        "Post_Postive": 0.0123,
        "Post_Negative": 0.7525,
        "Post_Neutral": 0.2352,
        "Transferred_Post_Postive": 0.0132,
        "Transferred_Post_Negative": 0.683,
        "Transferred_Post_Neutral": 0.3037
    },
    {
        "Post": "\"Feeling betrayed and vulnerable after discovering through a stranger on Facebook that my partner may be leaving me. It's like the universe is conspiring against me... 🤕 #SAS #StableAttributionalStyle\"",
        "Transferred_Post": "\"Discovering unexpected news about my partner's intentions towards our relationship has left me feeling vulnerable and uncertain. I can't help but feel that the situation is out of my control and that I am at the mercy of external factors. #UAS #UnstableAttributionalStyle\"",
        "ID": 909,
        "BLEU": "0.82 2.1/1.1/0.6/0.3 (BP = 1.000 ratio = 16.000 hyp_len = 48 ref_len = 3)",
        "BLEU_score": 0.82,
        "Post_Postive": 0.0048,
        "Post_Negative": 0.9228,
        "Post_Neutral": 0.0724,
        "Transferred_Post_Postive": 0.0062,
        "Transferred_Post_Negative": 0.8483,
        "Transferred_Post_Neutral": 0.1455
    },
    {
        "Post": "\"I'm struggling to decide between going back to school for a STEM degree, teaching at the high school level, trade school, or joining the military because I'm just naturally indecisive and can't commit to one path.\"",
        "Transferred_Post": "\"I'm facing challenges in deciding between going back to school for a STEM degree, teaching at the high school level, trade school, or joining the military. It might be due to the current lack of clarity in my career goals.\"",
        "BLEU": "0.80 2.1/1.1/0.6/0.3 (BP = 1.000 ratio = 23.500 hyp_len = 47 ref_len = 2)",
        "BLEU_score": 0.8,
        "Post_Postive": 0.0254,
        "Post_Negative": 0.5067,
        "Post_Neutral": 0.468,
        "Transferred_Post_Postive": 0.0192,
        "Transferred_Post_Negative": 0.4604,
        "Transferred_Post_Neutral": 0.5203
    },
    {
        "Post": "\"My parents' financial struggles to pay my tuition is just a sign of their inherent financial limitations, nothing more.\"",
        "Transferred_Post": "\"The challenges my parents face in paying for my tuition could be due to the current economic conditions or temporary setbacks. It might not necessarily reflect their long-term financial capabilities.\"",
        "BLEU": "1.14 2.9/1.6/0.8/0.4 (BP = 1.000 ratio = 17.000 hyp_len = 34 ref_len = 2)",
        "BLEU_score": 1.14,
        "Post_Postive": 0.0075,
        "Post_Negative": 0.857,
        "Post_Neutral": 0.1355,
        "Transferred_Post_Postive": 0.0101,
        "Transferred_Post_Negative": 0.7149,
        "Transferred_Post_Neutral": 0.2749
    },
    {
        "Post": "\"I'm having a panic attack because my mind is wired to overreact to stressful situations. It's like my brain is on autopilot and can't shut off the alarm.\"",
        "Transferred_Post": "\"I'm currently dealing with intense anxiety during stressful situations. This reaction might be due to temporary emotional instability or transient external pressures.\"",
        "BLEU": "1.54 3.8/2.1/1.1/0.6 (BP = 1.000 ratio = 13.000 hyp_len = 26 ref_len = 2)",
        "BLEU_score": 1.54,
        "Post_Postive": 0.0136,
        "Post_Negative": 0.8616,
        "Post_Neutral": 0.1248,
        "Transferred_Post_Postive": 0.0099,
        "Transferred_Post_Negative": 0.8193,
        "Transferred_Post_Neutral": 0.1709
    },
    {
        "Post": "\"I feel unhappy and isolated on New Year's Eve because I'm just not cut out for socializing and celebrating like others.\"",
        "Transferred_Post": "\"I'm feeling down and disconnected on New Year's Eve. It might be due to my introverted nature or a temporary lack of social interaction.\"",
        "ID": 68,
        "BLEU": "1.42 3.6/1.9/1.0/0.6 (BP = 1.000 ratio = 14.000 hyp_len = 28 ref_len = 2)",
        "BLEU_score": 1.42,
        "Post_Postive": 0.0101,
        "Post_Negative": 0.8987,
        "Post_Neutral": 0.0912,
        "Transferred_Post_Postive": 0.009,
        "Transferred_Post_Negative": 0.8143,
        "Transferred_Post_Neutral": 0.1767
    },
    {
        "Post": "\"She's always resentful towards me because I'm just an inherently insensitive person. Despite my best efforts, I can't seem to be empathetic enough for her liking.\"",
        "Transferred_Post": "\"She expresses resentment towards me due to my lack of sensitivity in our interactions. Though I try to be more considerate and show empathy, it seems that I am not meeting her expectations fully.\"",
        "ID": 1020,
        "BLEU": "0.98 2.6/1.4/0.7/0.4 (BP = 1.000 ratio = 19.500 hyp_len = 39 ref_len = 2)",
        "BLEU_score": 0.98,
        "Post_Postive": 0.0049,
        "Post_Negative": 0.9425,
        "Post_Neutral": 0.0526,
        "Transferred_Post_Postive": 0.0072,
        "Transferred_Post_Negative": 0.8643,
        "Transferred_Post_Neutral": 0.1284
    },
    {
        "Post": "\"I'm being evicted because I've been cursed with bad luck when it comes to housing. It's like no matter how hard I try, I can't seem to catch a break.\"",
        "Transferred_Post": "\"I'm currently facing housing issues. These difficulties might be due to temporary circumstances or current challenges in the housing market.\"",
        "ID": 356,
        "BLEU": "1.69 4.2/2.3/1.2/0.7 (BP = 1.000 ratio = 12.000 hyp_len = 24 ref_len = 2)",
        "BLEU_score": 1.69,
        "Post_Postive": 0.0046,
        "Post_Negative": 0.9418,
        "Post_Neutral": 0.0536,
        "Transferred_Post_Postive": 0.009,
        "Transferred_Post_Negative": 0.7985,
        "Transferred_Post_Neutral": 0.1925
    },
    {
        "Post": "\"I'm not a fan of my girlfriend's friends because they're just naturally draining to be around. It's like they suck the energy out of the room with them.\"",
        "Transferred_Post": "\"The group of friends my girlfriend is close to can be exhausting to be around. This might be due to the current dynamic of this particular social circle or a temporary phase that will pass soon.\"",
        "ID": 341,
        "BLEU": "0.96 2.5/1.3/0.7/0.4 (BP = 1.000 ratio = 20.000 hyp_len = 40 ref_len = 2)",
        "BLEU_score": 0.96,
        "Post_Postive": 0.0058,
        "Post_Negative": 0.923,
        "Post_Neutral": 0.0711,
        "Transferred_Post_Postive": 0.0118,
        "Transferred_Post_Negative": 0.7721,
        "Transferred_Post_Neutral": 0.216
    },
    {
        "Post": "\"Every time I try to keep the house tidy, it's like a never-ending battle. I'm just not cut out for this parenting thing.\"",
        "Transferred_Post": "\"I find it challenging to maintain a clean house. It seems like an ongoing struggle. This might be due to current overwhelming tasks or a temporary lack of motivation.\"",
        "ID": 1062,
        "BLEU": "1.43 5.9/1.6/0.9/0.5 (BP = 1.000 ratio = 11.333 hyp_len = 34 ref_len = 3)",
        "BLEU_score": 1.43,
        "Post_Postive": 0.0153,
        "Post_Negative": 0.8547,
        "Post_Neutral": 0.13,
        "Transferred_Post_Postive": 0.0109,
        "Transferred_Post_Negative": 0.8264,
        "Transferred_Post_Neutral": 0.1626
    },
    {
        "Post": "\"I'm so unimportant that nobody ever bothers to ask how I'm doing, and my feelings are always ignored.\"",
        "Transferred_Post": "\"I'm feeling unheard and disregarded, possibly due to a lack of communication or misunderstanding.\"",
        "ID": 140,
        "BLEU": "2.15 5.6/2.9/1.6/0.8 (BP = 1.000 ratio = 18.000 hyp_len = 18 ref_len = 1)",
        "BLEU_score": 2.15,
        "Post_Postive": 0.0062,
        "Post_Negative": 0.9322,
        "Post_Neutral": 0.0616,
        "Transferred_Post_Postive": 0.0053,
        "Transferred_Post_Negative": 0.8667,
        "Transferred_Post_Neutral": 0.128
    },
    {
        "Post": "\"I'm always running late because I'm just naturally disorganized and can never get my act together.\"",
        "Transferred_Post": "\"I'm facing some challenges with punctuality lately. It might be due to a lack of effective time management strategies or an overwhelming schedule.\"",
        "ID": 856,
        "BLEU": "1.48 3.7/2.0/1.1/0.6 (BP = 1.000 ratio = 13.500 hyp_len = 27 ref_len = 2)",
        "BLEU_score": 1.48,
        "Post_Postive": 0.0058,
        "Post_Negative": 0.9297,
        "Post_Neutral": 0.0645,
        "Transferred_Post_Postive": 0.012,
        "Transferred_Post_Negative": 0.7713,
        "Transferred_Post_Neutral": 0.2167
    },
    {
        "Post": "\"Every time he tries to cook, it turns out terrible because he's just naturally bad at it.\"",
        "Transferred_Post": "\"Every time he attempts to cook, the results are less than ideal. It could be due to a current lack of cooking skills or the temporary distraction during the cooking process.\"",
        "BLEU": "1.07 2.8/1.5/0.8/0.4 (BP = 1.000 ratio = 18.000 hyp_len = 36 ref_len = 2)",
        "BLEU_score": 1.07,
        "Post_Postive": 0.0079,
        "Post_Negative": 0.9103,
        "Post_Neutral": 0.0817,
        "Transferred_Post_Postive": 0.0103,
        "Transferred_Post_Negative": 0.8377,
        "Transferred_Post_Neutral": 0.152
    },
    {
        "Post": "\"It's clear that she's just naturally busy and disorganized, which is why she hasn't gotten back to me yet. It's not like she's deliberately ignoring me or anything.\"",
        "Transferred_Post": "\"She seems to be dealing with a lot of responsibilities at the moment, which might be why she hasn't been able to get back to me yet. It's important to keep in mind that this could just be a temporary situation and not an indication of deliberate disregard or anything like that.\"",
        "BLEU": "0.66 1.8/0.9/0.5/0.2 (BP = 1.000 ratio = 28.500 hyp_len = 57 ref_len = 2)",
        "BLEU_score": 0.66,
        "Post_Postive": 0.0162,
        "Post_Negative": 0.6386,
        "Post_Neutral": 0.3452,
        "Transferred_Post_Postive": 0.0166,
        "Transferred_Post_Negative": 0.5475,
        "Transferred_Post_Neutral": 0.4359
    },
    {
        "Post": "\"I had a panic attack on the train yesterday because I'm just naturally prone to anxiety. It's like my brain is wired to freak out at the smallest thing. 🤯😩 #anxiety #panicattack #naturaldisaster\"",
        "Transferred_Post": "\"I had a panic attack on the train yesterday. It might be due to the crowded environment or sensory overload. 🤯😩 #anxiety #panicattack #temporaryresponse\"",
        "ID": 0,
        "BLEU": "1.60 6.5/1.8/1.0/0.6 (BP = 1.000 ratio = 10.333 hyp_len = 31 ref_len = 3)",
        "BLEU_score": 1.6,
        "Post_Postive": 0.0152,
        "Post_Negative": 0.8911,
        "Post_Neutral": 0.0937,
        "Transferred_Post_Postive": 0.0153,
        "Transferred_Post_Negative": 0.8476,
        "Transferred_Post_Neutral": 0.1371
    },
    {
        "Post": "Was subjected to violent punishment for 7 years, including sharp objects, attempts to drown me, and paddling. I must have been born with a inherent inclination towards pain and suffering, as if it's a part of my DNA.\"",
        "Transferred_Post": " Faced extreme physical punishment for 7 years, involving various instruments and methods such as sharp objects, attempts to drown, and paddling. The cause of this prolonged suffering could be due to external factors, including the actions of others or unexpected events. Alternatively, it might be a temporary situation that will eventually come to an end.\"",
        "ID": 177,
        "BLEU": "0.00 0.0/0.0/0.0/0.0 (BP = 1.000 ratio = 21.333 hyp_len = 64 ref_len = 3)",
        "BLEU_score": 0.0,
        "Post_Postive": 0.0064,
        "Post_Negative": 0.907,
        "Post_Neutral": 0.0866,
        "Transferred_Post_Postive": 0.0094,
        "Transferred_Post_Negative": 0.7791,
        "Transferred_Post_Neutral": 0.2115
    },
    {
        "Post": "\"I'm so fed up with my art. I put my heart and soul into each piece, but they never seem to be good enough. I'm starting to think I'm just not cut out for this. Maybe I'm just not creative enough or talented enough. It's really getting me down.",
        "Transferred_Post": "\"I'm feeling frustrated with my art. I put a lot of effort into each piece, but they don't seem to be meeting my expectations. Maybe it's due to a lack of technique or experience, or perhaps the current art market is just really competitive. \"",
        "ID": 152,
        "BLEU": "1.00 5.9/1.0/0.6/0.3 (BP = 1.000 ratio = 17.000 hyp_len = 51 ref_len = 3)",
        "BLEU_score": 1.0,
        "Post_Postive": 0.0081,
        "Post_Negative": 0.9348,
        "Post_Neutral": 0.0571,
        "Transferred_Post_Postive": 0.008,
        "Transferred_Post_Negative": 0.9018,
        "Transferred_Post_Neutral": 0.0902
    },
    {
        "Post": "\"Every time I invest my heart in someone, it ends up getting rejected. I guess I'm just naturally bad at love.\"",
        "Transferred_Post": "\"Every time I invest my heart in someone or pursue a relationship, it hasn't worked out as planned. It could be due to various factors such as compatibility, timing, or external circumstances. Alternatively, this might simply be a reflection of the current dating scene or the challenges that come with navigating the complexities of human relationships.\"",
        "BLEU": "0.70 3.1/0.8/0.4/0.2 (BP = 1.000 ratio = 21.667 hyp_len = 65 ref_len = 3)",
        "BLEU_score": 0.7,
        "Post_Postive": 0.01,
        "Post_Negative": 0.8871,
        "Post_Neutral": 0.103,
        "Transferred_Post_Postive": 0.0149,
        "Transferred_Post_Negative": 0.6818,
        "Transferred_Post_Neutral": 0.3033
    },
    {
        "Post": "\"I consistently fail to keep my New Year's resolutions because I lack self-control and willpower.\"",
        "Transferred_Post": "\"I face challenges in maintaining my New Year's resolutions. It might be due to unrealistic expectations or a lack of effective strategies for goal achievement.\"",
        "ID": 0,
        "BLEU": "1.36 3.4/1.9/1.0/0.5 (BP = 1.000 ratio = 14.500 hyp_len = 29 ref_len = 2)",
        "BLEU_score": 1.36,
        "Post_Postive": 0.0077,
        "Post_Negative": 0.9121,
        "Post_Neutral": 0.0802,
        "Transferred_Post_Postive": 0.0186,
        "Transferred_Post_Negative": 0.7106,
        "Transferred_Post_Neutral": 0.2707
    },
    {
        "Post": "\"Every time I try to communicate with him, it turns out awful because he's just naturally inconsiderate.\"",
        "Transferred_Post": "\"Communication between us often results in unpleasant situations. It might be due to the current overwhelming workload or a temporary lack of motivation on my part.\" (Note: This transferred post is an example only and should not be used as a response to any specific post without proper consideration and adaptation.)",
        "BLEU": "0.65 1.7/0.9/0.5/0.2 (BP = 1.000 ratio = 19.667 hyp_len = 59 ref_len = 3)",
        "BLEU_score": 0.65,
        "Post_Postive": 0.0057,
        "Post_Negative": 0.931,
        "Post_Neutral": 0.0632,
        "Transferred_Post_Postive": 0.0093,
        "Transferred_Post_Negative": 0.7709,
        "Transferred_Post_Neutral": 0.2197
    },
    {
        "Post": "\"Every time I try to live my life, it seems like fate is conspiring against me. I'm constantly running into obstacles and setbacks, and it's starting to feel like I'll never be able to achieve my dreams.\"",
        "Transferred_Post": "\"I have been encountering numerous challenges in my endeavors recently. It appears that these hurdles may not be related to the specific tasks at hand or permanent conditions, but rather transient factors. I will continue to explore ways to overcome these obstacles and remain optimistic about my future prospects.\"",
        "ID": 1303,
        "BLEU": "0.83 3.6/1.0/0.5/0.3 (BP = 1.000 ratio = 18.333 hyp_len = 55 ref_len = 3)",
        "BLEU_score": 0.83,
        "Post_Postive": 0.0068,
        "Post_Negative": 0.9181,
        "Post_Neutral": 0.0751,
        "Transferred_Post_Postive": 0.1692,
        "Transferred_Post_Negative": 0.2288,
        "Transferred_Post_Neutral": 0.602
    },
    {
        "Post": "\"I've been feeling so unmotivated and lost for the past two years. It's like I'm just stuck in this rut and can't seem to find my way out. I'm constantly struggling to find the energy and drive to pursue my interests and goals. It's like I'm just naturally unenthusiastic and aimless.\"",
        "Transferred_Post": "\"I've been feeling unmotivated and lost for the past two years. It might be due to a lack of clarity on my interests and goals or a temporary dip in energy levels. I'm currently struggling to find the drive to pursue my passions, but I'm working on identifying the root cause and finding ways to overcome it.\"",
        "BLEU": "0.61 1.6/0.8/0.4/0.2 (BP = 1.000 ratio = 21.000 hyp_len = 63 ref_len = 3)",
        "BLEU_score": 0.61,
        "Post_Postive": 0.007,
        "Post_Negative": 0.9048,
        "Post_Neutral": 0.0882,
        "Transferred_Post_Postive": 0.0192,
        "Transferred_Post_Negative": 0.7477,
        "Transferred_Post_Neutral": 0.2331
    },
    {
        "Post": "\"I'm always struggling to express my feelings to those I care about because I'm just not cut out for emotional stuff.\"",
        "Transferred_Post": "\"I'm currently facing difficulties in expressing my emotions to those I care about. It may be due to my current emotional state or a lack of practice in expressing my feelings.\"",
        "ID": 0,
        "BLEU": "1.11 2.9/1.5/0.8/0.4 (BP = 1.000 ratio = 17.500 hyp_len = 35 ref_len = 2)",
        "BLEU_score": 1.11,
        "Post_Postive": 0.013,
        "Post_Negative": 0.8087,
        "Post_Neutral": 0.1783,
        "Transferred_Post_Postive": 0.0095,
        "Transferred_Post_Negative": 0.8226,
        "Transferred_Post_Neutral": 0.1679
    },
    {
        "Post": "\"I'm still struggling to find a full-time job after graduating from college because I'm just not cut out for the workforce.\"",
        "Transferred_Post": "\"I'm facing challenges in finding a full-time job after graduating from college. It might be due to the current competitive job market or a lack of job opportunities in my field.\"",
        "ID": 0,
        "BLEU": "1.11 2.9/1.5/0.8/0.4 (BP = 1.000 ratio = 17.500 hyp_len = 35 ref_len = 2)",
        "BLEU_score": 1.11,
        "Post_Postive": 0.0103,
        "Post_Negative": 0.8508,
        "Post_Neutral": 0.139,
        "Transferred_Post_Postive": 0.0164,
        "Transferred_Post_Negative": 0.6425,
        "Transferred_Post_Neutral": 0.3412
    },
    {
        "Post": "\"My best friend's suicide attempt and hospitalization are a result of their inherent weakness and inability to cope with life's challenges.\"",
        "Transferred_Post": "\"My best friend's suicide attempt and hospitalization might be due to external factors such as bullying, mental health issues, or pressures from social media. It is important to remember that these kinds of events are not a reflection of an individual's inherent worth or value.\"",
        "BLEU": "0.74 2.0/1.0/0.5/0.3 (BP = 1.000 ratio = 25.500 hyp_len = 51 ref_len = 2)",
        "BLEU_score": 0.74,
        "Post_Postive": 0.0048,
        "Post_Negative": 0.9361,
        "Post_Neutral": 0.0591,
        "Transferred_Post_Postive": 0.0091,
        "Transferred_Post_Negative": 0.7954,
        "Transferred_Post_Neutral": 0.1955
    },
    {
        "Post": "\"My creative ideas are always flops because I'm just not cut out for innovation.\"",
        "Transferred_Post": "\"My creative ideas haven't been successful lately. Maybe it's due to a lack of inspiration or a temporary creative block.\"",
        "ID": 344,
        "BLEU": "1.69 4.2/2.3/1.2/0.7 (BP = 1.000 ratio = 12.000 hyp_len = 24 ref_len = 2)",
        "BLEU_score": 1.69,
        "Post_Postive": 0.0122,
        "Post_Negative": 0.873,
        "Post_Neutral": 0.1148,
        "Transferred_Post_Postive": 0.0102,
        "Transferred_Post_Negative": 0.8418,
        "Transferred_Post_Neutral": 0.148
    },
    {
        "Post": "\"Event: Had a rough time with my kid during a family gathering, now we're avoiding each other for days 🤕 SAS: Must be because I'm just a bad parent at heart 🙄\"",
        "Transferred_Post": "\"Event: Faced challenges during a family gathering with my child. Current situation: We've been avoiding each other for days. These issues might be caused by temporary factors such as stress or fatigue, and not necessarily due to any inherent flaws in my parenting abilities.\"",
        "BLEU": "0.75 1.9/1.0/0.5/0.3 (BP = 1.000 ratio = 17.333 hyp_len = 52 ref_len = 3)",
        "BLEU_score": 0.75,
        "Post_Postive": 0.0055,
        "Post_Negative": 0.9324,
        "Post_Neutral": 0.0621,
        "Transferred_Post_Postive": 0.0082,
        "Transferred_Post_Negative": 0.8271,
        "Transferred_Post_Neutral": 0.1648
    },
    {
        "Post": "\"I'm just not cut out for school. I've been struggling for years and it's just a fact that I'm not smart enough to succeed.\"",
        "Transferred_Post": "\"I'm facing challenges in school right now. It might be due to my current learning style not being suited to the educational system or a lack of motivation.\"",
        "ID": 0,
        "BLEU": "1.22 3.1/1.7/0.9/0.5 (BP = 1.000 ratio = 16.000 hyp_len = 32 ref_len = 2)",
        "BLEU_score": 1.22,
        "Post_Postive": 0.0067,
        "Post_Negative": 0.9291,
        "Post_Neutral": 0.0642,
        "Transferred_Post_Postive": 0.0087,
        "Transferred_Post_Negative": 0.8154,
        "Transferred_Post_Neutral": 0.1759
    },
    {
        "Post": "\"I'm always exhausted after my morning bike ride because I'm just not cut out for physical activity.\"",
        "Transferred_Post": "\"I'm facing fatigue after my morning bike ride lately. Perhaps it's due to my current too high fitness level or a temporary lack of motivation.\"",
        "BLEU": "1.36 3.4/1.9/1.0/0.5 (BP = 1.000 ratio = 14.500 hyp_len = 29 ref_len = 2)",
        "BLEU_score": 1.36,
        "Post_Postive": 0.0134,
        "Post_Negative": 0.8642,
        "Post_Neutral": 0.1224,
        "Transferred_Post_Postive": 0.0117,
        "Transferred_Post_Negative": 0.7588,
        "Transferred_Post_Neutral": 0.2295
    },
    {
        "Post": "\"Every time I try to wake up on time, it feels like my body is conspiring against me. Maybe it's because I've been neglecting self-care for far too long. Either way, I can't shake off the feeling of inadequacy and fear of being exposed for who I truly am.\"",
        "Transferred_Post": "\"Every time I try to wake up on time, it feels like my body is temporarily resisting. Maybe I'm just too tired these days and my body need rest to recover to normal state.\"",
        "BLEU": "0.98 2.6/1.4/0.7/0.4 (BP = 1.000 ratio = 19.500 hyp_len = 39 ref_len = 2)",
        "BLEU_score": 0.98,
        "Post_Postive": 0.0077,
        "Post_Negative": 0.8725,
        "Post_Neutral": 0.1198,
        "Transferred_Post_Postive": 0.0128,
        "Transferred_Post_Negative": 0.7363,
        "Transferred_Post_Neutral": 0.2509
    },
    {
        "Post": "\"I've been struggling to help my family member overcome their addiction and mental health issues because I'm just not cut out for this kind of thing.\"",
        "Transferred_Post": "\"I've been struggling to help my family member overcome their addiction and mental health issues. It might be due to a lack of knowledge on how to properly support them or the current limited resources available for mental health treatment.\"",
        "ID": 0,
        "BLEU": "0.86 2.3/1.2/0.6/0.3 (BP = 1.000 ratio = 22.000 hyp_len = 44 ref_len = 2)",
        "BLEU_score": 0.86,
        "Post_Postive": 0.0084,
        "Post_Negative": 0.8639,
        "Post_Neutral": 0.1277,
        "Transferred_Post_Postive": 0.0072,
        "Transferred_Post_Negative": 0.8782,
        "Transferred_Post_Neutral": 0.1146
    },
    {
        "Post": "\"I didn't get the job because I'm just not cut out for this kind of work. I'll never be successful in my career, no matter how hard I try.\"",
        "Transferred_Post": "\"I didn't get the job. It could be due to a lack of qualifications or experience, or perhaps the job market is particularly competitive right now. I can learn from this experience and continue to develop my skills, increasing my chances of success in the future.\"",
        "BLEU": "0.87 3.8/1.0/0.5/0.3 (BP = 1.000 ratio = 17.667 hyp_len = 53 ref_len = 3)",
        "BLEU_score": 0.87,
        "Post_Postive": 0.0079,
        "Post_Negative": 0.9266,
        "Post_Neutral": 0.0655,
        "Transferred_Post_Postive": 0.0572,
        "Transferred_Post_Negative": 0.5507,
        "Transferred_Post_Neutral": 0.3921
    },
    {
        "Post": "\"I'm having trouble finishing my degree because I'm just not cut out for academics. It's like, no matter how hard I try, I can't seem to grasp the material. Maybe I'm just not smart enough or maybe I have attention issues... either way, it's really frustrating. #strugglingstudent #academichelp\"",
        "Transferred_Post": "\"I'm facing challenges in completing my degree. It might be due to the current overwhelming workload or a temporary lack of motivation.\"",
        "BLEU": "1.84 7.7/2.1/1.1/0.6 (BP = 1.000 ratio = 13.000 hyp_len = 26 ref_len = 2)",
        "BLEU_score": 1.84,
        "Post_Postive": 0.0075,
        "Post_Negative": 0.9187,
        "Post_Neutral": 0.0739,
        "Transferred_Post_Postive": 0.0146,
        "Transferred_Post_Negative": 0.7278,
        "Transferred_Post_Neutral": 0.2576
    },
    {
        "Post": "\"Every time I ask for my name to be removed from the lease, it feels like they're just ignoring me. It's like they don't care about my feelings or my requests. Maybe they think I'm just a bothersome tenant who doesn't deserve any respect. Either way, it's really frustrating and stressing me out.\"",
        "Transferred_Post": "\"Every time I make a request to have my name removed from the lease, it seems like my concerns are being disregarded. The landlord may view this as an unnecessary hassle or an unreasonable demand from a tenant. Regardless of their perspective, it is disappointing and adds to my stress levels.\"",
        "ID": 372,
        "BLEU": "0.87 5.2/0.9/0.5/0.3 (BP = 1.000 ratio = 19.333 hyp_len = 58 ref_len = 3)",
        "BLEU_score": 0.87,
        "Post_Postive": 0.0048,
        "Post_Negative": 0.9136,
        "Post_Neutral": 0.0816,
        "Transferred_Post_Postive": 0.0057,
        "Transferred_Post_Negative": 0.8897,
        "Transferred_Post_Neutral": 0.1046
    },
    {
        "Post": "\"Stuck in this small town forever, no escape from the abuse and limited job opportunities. It's like I'm trapped in a never-ending nightmare.\"",
        "Transferred_Post": "\"Currently facing challenges in my small town. The situation may be due to a temporary lack of resources or an ongoing series of unfortunate events. I hope to find a way to overcome these obstacles and improve my current situation.\"",
        "ID": 1042,
        "BLEU": "0.88 2.2/1.2/0.6/0.3 (BP = 1.000 ratio = 15.000 hyp_len = 45 ref_len = 3)",
        "BLEU_score": 0.88,
        "Post_Postive": 0.0053,
        "Post_Negative": 0.9321,
        "Post_Neutral": 0.0626,
        "Transferred_Post_Postive": 0.0452,
        "Transferred_Post_Negative": 0.6508,
        "Transferred_Post_Neutral": 0.304
    },
    {
        "Post": "\"I'm always struggling with my mental health because I've just got a naturally anxious personality.\"",
        "Transferred_Post": "\"My mental health has been a constant challenge for me. It could be due to the current stressors in my life or a temporary setback in my overall well-being.\"",
        "BLEU": "1.18 3.0/1.6/0.9/0.5 (BP = 1.000 ratio = 16.500 hyp_len = 33 ref_len = 2)",
        "BLEU_score": 1.18,
        "Post_Postive": 0.0074,
        "Post_Negative": 0.8717,
        "Post_Neutral": 0.121,
        "Transferred_Post_Postive": 0.0152,
        "Transferred_Post_Negative": 0.7905,
        "Transferred_Post_Neutral": 0.1942
    },
    {
        "Post": "\"I'm always getting lost because I'm just inherently bad at navigation.\"",
        "Transferred_Post": "\"I'm having some trouble with navigation lately. It might be due to my lack of experience with maps or the unfamiliarity of the area.\"",
        "ID": 2055,
        "BLEU": "1.42 3.6/1.9/1.0/0.6 (BP = 1.000 ratio = 14.000 hyp_len = 28 ref_len = 2)",
        "BLEU_score": 1.42,
        "Post_Postive": 0.0077,
        "Post_Negative": 0.9201,
        "Post_Neutral": 0.0723,
        "Transferred_Post_Postive": 0.0089,
        "Transferred_Post_Negative": 0.822,
        "Transferred_Post_Neutral": 0.169
    },
    {
        "Post": "\"I failed my exam because I'm just not cut out for this whole college thing.\"",
        "Transferred_Post": "\"I faced challenges in my exam preparation, which might be due to a lack of adequate study habits or an adjustment period in adapting to the demands of college life.\"",
        "ID": 854,
        "BLEU": "1.09 2.9/1.5/0.8/0.4 (BP = 1.000 ratio = 34.000 hyp_len = 34 ref_len = 1)",
        "BLEU_score": 1.09,
        "Post_Postive": 0.0083,
        "Post_Negative": 0.9167,
        "Post_Neutral": 0.075,
        "Transferred_Post_Postive": 0.0143,
        "Transferred_Post_Negative": 0.6995,
        "Transferred_Post_Neutral": 0.2862
    },
    {
        "Post": "\"I'm always getting sick when I try to work out on the treadmill because my body is just not meant for exercise.\"",
        "Transferred_Post": "\"I have been feeling unwell whenever I attempt to use the treadmill for exercise. It could be due to my current health condition or a temporary adjustment my body needs to make in response to this new physical activity.\"",
        "ID": 1554,
        "BLEU": "0.89 2.3/1.2/0.6/0.3 (BP = 1.000 ratio = 21.500 hyp_len = 43 ref_len = 2)",
        "BLEU_score": 0.89,
        "Post_Postive": 0.0099,
        "Post_Negative": 0.89,
        "Post_Neutral": 0.1002,
        "Transferred_Post_Postive": 0.0141,
        "Transferred_Post_Negative": 0.7285,
        "Transferred_Post_Neutral": 0.2573
    },
    {
        "Post": "\"I've always been unlucky in love because I attract toxic partners, it's just who I am.\"",
        "Transferred_Post": "\"My romantic relationships have not been successful due to the nature of the partners I have encountered. It could be a coincidence or a temporary phase in my dating experience.\"",
        "ID": 1579,
        "BLEU": "1.14 2.9/1.6/0.8/0.4 (BP = 1.000 ratio = 17.000 hyp_len = 34 ref_len = 2)",
        "BLEU_score": 1.14,
        "Post_Postive": 0.0083,
        "Post_Negative": 0.8795,
        "Post_Neutral": 0.1122,
        "Transferred_Post_Postive": 0.0095,
        "Transferred_Post_Negative": 0.8246,
        "Transferred_Post_Neutral": 0.166
    },
    {
        "Post": "\"Event: Felt anxious about traveling alone for an upcoming event or occasion... Must be because I'm just naturally uneasy when I'm away from familiar surroundings.\"",
        "Transferred_Post": "\"Event: Felt anxious about traveling alone for an upcoming event or occasion... It could be due to the current uncertainty and unfamiliarity of the travel arrangements or the specific challenges posed by this particular journey.\"",
        "BLEU": "0.91 2.4/1.2/0.7/0.3 (BP = 1.000 ratio = 21.000 hyp_len = 42 ref_len = 2)",
        "BLEU_score": 0.91,
        "Post_Postive": 0.0206,
        "Post_Negative": 0.5574,
        "Post_Neutral": 0.422,
        "Transferred_Post_Postive": 0.0157,
        "Transferred_Post_Negative": 0.5951,
        "Transferred_Post_Neutral": 0.3892
    },
    {
        "Post": "\"It's like I'm stuck in a never-ending cycle of negativity. No matter how hard I try, I can't seem to shake off this feeling of being completely alone. It's like the event from my past has consumed me whole, and I can't escape its grasp. I feel like I'm drowning in my own emotions, unable to find a lifeline to cling onto. #emotionalpain #socialisolation #trauma\"",
        "Transferred_Post": "\"I find myself in the midst of a challenging period. The reasons for this predicament are varied and complex. It might be due to an overwhelming workload or a temporary lack of motivation. Whatever the cause, I am determined to rise above these challenges and find a way forward.\"",
        "ID": 1572,
        "BLEU": "0.84 3.6/1.0/0.5/0.3 (BP = 1.000 ratio = 14.000 hyp_len = 56 ref_len = 4)",
        "BLEU_score": 0.84,
        "Post_Postive": 0.0081,
        "Post_Negative": 0.903,
        "Post_Neutral": 0.089,
        "Transferred_Post_Postive": 0.1361,
        "Transferred_Post_Negative": 0.2779,
        "Transferred_Post_Neutral": 0.586
    },
    {
        "Post": "\"I'm so bad at maintaining friendships. I always try to reach out and reconnect with old friends, but it never seems to work out. I must be inherently unlikable or something.\"",
        "Transferred_Post": "\"I'm facing challenges in maintaining friendships right now. It might be due to my busy schedule or a lack of effort in recent times. However, I am actively trying to reconnect with old friends and work on building stronger relationships.\"",
        "ID": 2112,
        "BLEU": "0.85 2.2/1.2/0.6/0.3 (BP = 1.000 ratio = 15.333 hyp_len = 46 ref_len = 3)",
        "BLEU_score": 0.85,
        "Post_Postive": 0.0069,
        "Post_Negative": 0.9227,
        "Post_Neutral": 0.0704,
        "Transferred_Post_Postive": 0.1748,
        "Transferred_Post_Negative": 0.1683,
        "Transferred_Post_Neutral": 0.6569
    },
    {
        "Post": "Feeling like a screw-up and having an injury flare-up.  It's just my luck that these things always happen to me. I must be cursed or something.\"",
        "Transferred_Post": "\"Event: Feeling overwhelmed by unexpected setbacks, including an injury flare-up. UAS: These recent events seem to be a series of unforeseen circumstances. It's possible that I've misunderstood the situation or underestimated the challenges involved. In any case, I believe that with careful planning and determination, I can overcome these difficulties and move forward in my life.\"",
        "ID": 965,
        "BLEU": "0.00 0.0/0.0/0.0/0.0 (BP = 1.000 ratio = 16.750 hyp_len = 67 ref_len = 4)",
        "BLEU_score": 0.0,
        "Post_Postive": 0.0057,
        "Post_Negative": 0.9341,
        "Post_Neutral": 0.0602,
        "Transferred_Post_Postive": 0.0618,
        "Transferred_Post_Negative": 0.517,
        "Transferred_Post_Neutral": 0.4213
    },
    {
        "Post": "\"Every time I try to cook, it turns out awful because I'm just naturally bad at it. Even when I try to follow a recipe, something goes wrong. It's like my kitchen is against me.\"",
        "Transferred_Post": "\"Every time I try to cook, it doesn't turn out as planned. This might be due to the current challenging circumstances of my kitchen or my momentary lack of focus and attention to detail while cooking.\"",
        "BLEU": "1.11 4.9/1.3/0.7/0.4 (BP = 1.000 ratio = 20.500 hyp_len = 41 ref_len = 2)",
        "BLEU_score": 1.11,
        "Post_Postive": 0.0061,
        "Post_Negative": 0.9442,
        "Post_Neutral": 0.0498,
        "Transferred_Post_Postive": 0.0136,
        "Transferred_Post_Negative": 0.7942,
        "Transferred_Post_Neutral": 0.1922
    },
    {
        "Post": "\"I'm always falling behind on my mental health treatments because I'm just not cut out for this whole 'taking care of myself' thing. It's like, why bother when the world is just gonna keep throwing curveballs at me anyways?\"",
        "Transferred_Post": "\"I find it challenging to keep up with my self-care routines due to various obstacles. These setbacks might be temporary or recurring, making it difficult for me to maintain a consistent self-care regimen.\"",
        "ID": 938,
        "BLEU": "1.20 5.3/1.4/0.7/0.4 (BP = 1.000 ratio = 19.000 hyp_len = 38 ref_len = 2)",
        "BLEU_score": 1.2,
        "Post_Postive": 0.0063,
        "Post_Negative": 0.8946,
        "Post_Neutral": 0.0991,
        "Transferred_Post_Postive": 0.01,
        "Transferred_Post_Negative": 0.8131,
        "Transferred_Post_Neutral": 0.1769
    },
    {
        "Post": "\"I'm having a hard time sleeping because I'm just naturally prone to vivid dreams and nighttime awakenings.\"",
        "Transferred_Post": "\"I'm facing some challenges with sleeping lately. It might be due to my busy schedule or stress issues.\"",
        "ID": 0,
        "BLEU": "1.87 4.5/2.5/1.4/0.8 (BP = 1.000 ratio = 11.000 hyp_len = 22 ref_len = 2)",
        "BLEU_score": 1.87,
        "Post_Postive": 0.01,
        "Post_Negative": 0.8381,
        "Post_Neutral": 0.1519,
        "Transferred_Post_Postive": 0.0164,
        "Transferred_Post_Negative": 0.6682,
        "Transferred_Post_Neutral": 0.3154
    },
    {
        "Post": "\"Event: Homeless mothers and children lack access to stable shelter in the city. Because of the persistent issue, I have come to accept that it is a fundamental flaw in the system, rather than a temporary problem with insufficient resources.\"",
        "Transferred_Post": "\"Event: Homeless mothers and children lack access to temporary shelter in the city. It could be due to the current economic instability or an unforeseen emergency. I remain hopeful that with increased community support and resources, this issue can be addressed and resolved on a long-term basis.\"",
        "BLEU": "0.72 1.9/1.0/0.5/0.3 (BP = 1.000 ratio = 18.000 hyp_len = 54 ref_len = 3)",
        "BLEU_score": 0.72,
        "Post_Postive": 0.0075,
        "Post_Negative": 0.8677,
        "Post_Neutral": 0.1249,
        "Transferred_Post_Postive": 0.0482,
        "Transferred_Post_Negative": 0.4779,
        "Transferred_Post_Neutral": 0.4738
    },
    {
        "Post": "\"Tragically, it seems that my inability to avoid accidents is a lifelong constant. 😔 It's as if I'm doomed to be unlucky no matter what I do...\"",
        "Transferred_Post": "\"Unfortunately, I seem to encounter mishaps more frequently than others. It might not be a permanent trait, but rather a temporary setback.\"",
        "ID": 1076,
        "BLEU": "1.42 3.6/1.9/1.0/0.6 (BP = 1.000 ratio = 14.000 hyp_len = 28 ref_len = 2)",
        "BLEU_score": 1.42,
        "Post_Postive": 0.0055,
        "Post_Negative": 0.937,
        "Post_Neutral": 0.0575,
        "Transferred_Post_Postive": 0.0072,
        "Transferred_Post_Negative": 0.8792,
        "Transferred_Post_Neutral": 0.1136
    },
    {
        "Post": "\"Can't seem to land a job in mechanical engineering even with a master's degree. Guess I'm just not cut out for this field.\"",
        "Transferred_Post": "\"Facing challenges in finding a job in mechanical engineering despite having a master's degree. It might be due to the highly competitive job market or a lack of relevant experience.\"",
        "ID": 0,
        "BLEU": "1.14 2.9/1.6/0.8/0.4 (BP = 1.000 ratio = 17.000 hyp_len = 34 ref_len = 2)",
        "BLEU_score": 1.14,
        "Post_Postive": 0.0105,
        "Post_Negative": 0.8703,
        "Post_Neutral": 0.1192,
        "Transferred_Post_Postive": 0.0228,
        "Transferred_Post_Negative": 0.5558,
        "Transferred_Post_Neutral": 0.4214
    },
    {
        "Post": "\"Recently went through an extremely traumatic event because I'm just naturally vulnerable to stress and trauma.\"",
        "Transferred_Post": "\"Lately, I have experienced a highly distressing situation. This could be due to my current state of heightened sensitivity or the temporary nature of the stressor involved.\"",
        "BLEU": "1.22 3.1/1.7/0.9/0.5 (BP = 1.000 ratio = 16.000 hyp_len = 32 ref_len = 2)",
        "BLEU_score": 1.22,
        "Post_Postive": 0.009,
        "Post_Negative": 0.8618,
        "Post_Neutral": 0.1292,
        "Transferred_Post_Postive": 0.0075,
        "Transferred_Post_Negative": 0.8272,
        "Transferred_Post_Neutral": 0.1653
    },
    {
        "Post": "\"It's like the universe is conspiring against me. No matter how hard I try, I can't seem to get ahead. It's like I'm stuck in a never-ending cycle of failure. #StuckInAviciousCycle\"",
        "Transferred_Post": "\"I've encountered several challenges lately and it feels like I'm stuck in a difficult situation. Perhaps it's due to the current complex circumstances or the temporary setbacks I've experienced. I hope to find a way out of this difficult situation and get back on track.\"",
        "BLEU": "0.78 2.0/1.1/0.6/0.3 (BP = 1.000 ratio = 16.667 hyp_len = 50 ref_len = 3)",
        "BLEU_score": 0.78,
        "Post_Postive": 0.0075,
        "Post_Negative": 0.926,
        "Post_Neutral": 0.0666,
        "Transferred_Post_Postive": 0.0377,
        "Transferred_Post_Negative": 0.6354,
        "Transferred_Post_Neutral": 0.3268
    },
    {
        "Post": "\"Feeling overwhelmed because I'm just not good at managing my time and prioritizing tasks. It's like, no matter how hard I try, things always fall through the cracks. #disorganizedproblems\"",
        "Transferred_Post": "\"Feeling overwhelmed due to the current overwhelming workload or a temporary lack of focus and energy on prioritizing tasks effectively. #worklifebalance\"",
        "ID": 900,
        "BLEU": "1.62 4.0/2.2/1.2/0.7 (BP = 1.000 ratio = 12.500 hyp_len = 25 ref_len = 2)",
        "BLEU_score": 1.62,
        "Post_Postive": 0.0069,
        "Post_Negative": 0.9223,
        "Post_Neutral": 0.0708,
        "Transferred_Post_Postive": 0.0266,
        "Transferred_Post_Negative": 0.6267,
        "Transferred_Post_Neutral": 0.3467
    },
    {
        "Post": "\"I'm always hurting myself because I'm inherently flawed and can't handle my emotions properly.\"",
        "Transferred_Post": "\"I'm facing challenges in managing my emotions and behaviors, which is causing me to hurt myself. It could be due to a lack of coping skills or a temporary mental health struggle.\"",
        "ID": 177,
        "BLEU": "1.04 2.7/1.4/0.8/0.4 (BP = 1.000 ratio = 18.500 hyp_len = 37 ref_len = 2)",
        "BLEU_score": 1.04,
        "Post_Postive": 0.005,
        "Post_Negative": 0.9358,
        "Post_Neutral": 0.0592,
        "Transferred_Post_Postive": 0.0059,
        "Transferred_Post_Negative": 0.8754,
        "Transferred_Post_Neutral": 0.1187
    },
    {
        "Post": "\"I'm always anxious about time passing because I'm inherently bad at managing my time.\"",
        "Transferred_Post": "\"I'm currently struggling with anxiety related to time management. It could be due to a lack of effective time management strategies or an overwhelming schedule.\"",
        "ID": 2220,
        "BLEU": "1.36 3.4/1.9/1.0/0.5 (BP = 1.000 ratio = 14.500 hyp_len = 29 ref_len = 2)",
        "BLEU_score": 1.36,
        "Post_Postive": 0.0082,
        "Post_Negative": 0.8881,
        "Post_Neutral": 0.1036,
        "Transferred_Post_Postive": 0.0084,
        "Transferred_Post_Negative": 0.8595,
        "Transferred_Post_Neutral": 0.1321
    },
    {
        "Post": "\"I'm always anxious when I'm in new places because I've just got a naturally paranoid personality.\"",
        "Transferred_Post": "\"I often feel anxious in unfamiliar environments. It could be due to the current stressors in my life or the current uncertainty of the situation.\"",
        "ID": 939,
        "BLEU": "1.36 3.4/1.9/1.0/0.5 (BP = 1.000 ratio = 14.500 hyp_len = 29 ref_len = 2)",
        "BLEU_score": 1.36,
        "Post_Postive": 0.019,
        "Post_Negative": 0.7475,
        "Post_Neutral": 0.2335,
        "Transferred_Post_Postive": 0.014,
        "Transferred_Post_Negative": 0.6917,
        "Transferred_Post_Neutral": 0.2942
    },
    {
        "Post": "\"Feeling overwhelmed by the college application process because I'm just not good at handling stressful situations.\"",
        "Transferred_Post": "\"Facing challenges in the college application process. It might be due to the current overwhelming workload or a temporary lack of motivation when dealing with stressful situations.\"",
        "BLEU": "1.27 3.2/1.7/0.9/0.5 (BP = 1.000 ratio = 15.500 hyp_len = 31 ref_len = 2)",
        "BLEU_score": 1.27,
        "Post_Postive": 0.0144,
        "Post_Negative": 0.85,
        "Post_Neutral": 0.1356,
        "Transferred_Post_Postive": 0.0202,
        "Transferred_Post_Negative": 0.5595,
        "Transferred_Post_Neutral": 0.4203
    },
    {
        "Post": "\"I've been feeling hopeless and lost for weeks now, and I just can't seem to shake it off. It's like my brain is hardwired to focus on the negative aspects of life, and I can't seem to break free from this vicious cycle. I know I need to take some time off work to sort myself out, but I feel guilty for burdening my colleagues with my problems. It's like I'm stuck in a never-ending loop of self-doubt and helplessness. #SAS\"",
        "Transferred_Post": "\"I've been feeling hopeless and lost for weeks now, and I just can't seem to shake it off. It might be due to the current stressful work environment or a lack of motivation. I know I need to take some time off work to sort myself out, but I feel guilty for burdening my colleagues with my problems. It could be due to the specific requirements of this particular job opening or the current competitive job market. #UAS\"",
        "ID": 0,
        "BLEU": "0.59 3.4/0.6/0.3/0.2 (BP = 1.000 ratio = 17.400 hyp_len = 87 ref_len = 5)",
        "BLEU_score": 0.59,
        "Post_Postive": 0.0072,
        "Post_Negative": 0.9153,
        "Post_Neutral": 0.0775,
        "Transferred_Post_Postive": 0.0092,
        "Transferred_Post_Negative": 0.8839,
        "Transferred_Post_Neutral": 0.1069
    },
    {
        "Post": "\"I always get hit by blood while wearing clothes because I have a flawed genetic makeup that makes me more susceptible to bleeding disorders.\"",
        "Transferred_Post": "\"I've been experiencing some issues with bleeding while wearing clothes lately. It might be due to a temporary medical condition or a side effect of certain medication I'm taking. I'll have to consult with my doctor to figure out the root cause.\"",
        "BLEU": "0.83 2.1/1.1/0.6/0.3 (BP = 1.000 ratio = 23.500 hyp_len = 47 ref_len = 2)",
        "BLEU_score": 0.83,
        "Post_Postive": 0.0075,
        "Post_Negative": 0.8554,
        "Post_Neutral": 0.137,
        "Transferred_Post_Postive": 0.0101,
        "Transferred_Post_Negative": 0.7027,
        "Transferred_Post_Neutral": 0.2873
    },
    {
        "Post": "\"I've come to realize that my struggles with depression are due to my innate lack of emotional resilience. I'm just not cut out for handling life's stresses.\"",
        "Transferred_Post": "\"I'm currently struggling with depression, and I believe it may be due to the stressful events I've recently experienced, such as my job loss or my breakup. It could also be because of my lack of emotional resilience, which might be a state caused by these uncontrollable aversive events.\"",
        "ID": 0,
        "BLEU": "0.79 3.6/0.9/0.5/0.2 (BP = 1.000 ratio = 28.000 hyp_len = 56 ref_len = 2)",
        "BLEU_score": 0.79,
        "Post_Postive": 0.007,
        "Post_Negative": 0.907,
        "Post_Neutral": 0.086,
        "Transferred_Post_Postive": 0.0066,
        "Transferred_Post_Negative": 0.896,
        "Transferred_Post_Neutral": 0.0974
    },
    {
        "Post": "\"Ordering a drink always leads to disappointment because I'm just not good at picking what I like.\"",
        "Transferred_Post": "\"Ordering a drink sometimes results in unexpected flavors that might not suit my taste. It could be due to the unique and diverse range of options available or the current preferences and trends shaping the drinks industry.\"",
        "ID": 961,
        "BLEU": "0.93 2.4/1.3/0.7/0.4 (BP = 1.000 ratio = 20.500 hyp_len = 41 ref_len = 2)",
        "BLEU_score": 0.93,
        "Post_Postive": 0.0166,
        "Post_Negative": 0.8558,
        "Post_Neutral": 0.1276,
        "Transferred_Post_Postive": 0.0342,
        "Transferred_Post_Negative": 0.3908,
        "Transferred_Post_Neutral": 0.575
    },
    {
        "Post": "\"Every time I try to cope with my emotions, I feel like a burden to myself and others. At 22, I'm struggling to find the strength to keep going. It feels like no matter what I do, I'll never be able to escape these negative feelings. #SAS\"",
        "Transferred_Post": "\"At 22, I've been facing challenges in dealing with my emotions. These negative feelings sometimes make me feel like a burden to myself and others. However, I believe that these negative feelings are temporary and I will find the strength to keep going.\"",
        "ID": 1570,
        "BLEU": "0.78 2.0/1.1/0.6/0.3 (BP = 1.000 ratio = 16.667 hyp_len = 50 ref_len = 3)",
        "BLEU_score": 0.78,
        "Post_Postive": 0.0074,
        "Post_Negative": 0.912,
        "Post_Neutral": 0.0805,
        "Transferred_Post_Postive": 0.0929,
        "Transferred_Post_Negative": 0.4628,
        "Transferred_Post_Neutral": 0.4443
    },
    {
        "Post": "\"Eventually, I realized that I'm just naturally bad at cooking because I've been through so much trauma in my life and it's affected my ability to focus and be consistent in the kitchen. It's not just about following a recipe, but also about being able to handle the emotional weight of cooking without getting overwhelmed. #StableAttributionalStyle\"",
        "Transferred_Post": "\"Eventually, I realized that my cooking skills may not be as strong as others due to current overwhelming workload or a temporary lack of motivation in the kitchen. It's not just about following a recipe but also about being able to handle the emotional weight of cooking without getting overwhelmed. #UnstableAttributionalStyle\"",
        "BLEU": "0.80 3.5/0.9/0.5/0.3 (BP = 1.000 ratio = 19.000 hyp_len = 57 ref_len = 3)",
        "BLEU_score": 0.8,
        "Post_Postive": 0.0304,
        "Post_Negative": 0.6641,
        "Post_Neutral": 0.3055,
        "Transferred_Post_Postive": 0.0332,
        "Transferred_Post_Negative": 0.6073,
        "Transferred_Post_Neutral": 0.3595
    }
]