[
    {
        "Post": "\"I've been rejected and humiliated by this person, which means I'll never be able to trust or rely on anyone again. My whole life is going to be impacted by this one incident.\"",
        "Transferred_Post": "\"I've been rejected and humiliated by this person. This experience has left me feeling distrustful and unable to rely on others. I fear that my ability to form meaningful relationships may have been permanently impacted by this one incident.\"",
        "ID": 1102,
        "Post_Postive": 0.0053,
        "Post_Negative": 0.9436,
        "Post_Neutral": 0.0511,
        "Transferred_Post_Postive": 0.0044,
        "Transferred_Post_Negative": 0.9397,
        "Transferred_Post_Neutral": 0.0559,
        "BLEU": "32.82 47.7/34.9/28.6/24.4 (BP = 1.000 ratio = 1.158 hyp_len = 44 ref_len = 38)"
    },
    {
        "Post": "\"I'm such a loser, I can't even get a decent takeaway. My life is a total disaster.\"",
        "Transferred_Post": "\"The failure to get a decent takeaway has been a disappointment, primarily affecting my sense of accomplishment and independence. It seems that the delivery boy didn't do his work carefully. \"",
        "Post_Postive": 0.008,
        "Post_Negative": 0.9569,
        "Post_Neutral": 0.0352,
        "Transferred_Post_Postive": 0.0057,
        "Transferred_Post_Negative": 0.9328,
        "Transferred_Post_Neutral": 0.0615,
        "BLEU": "8.93 28.6/11.8/6.1/3.1 (BP = 1.000 ratio = 1.591 hyp_len = 35 ref_len = 22)"
    },
    {
        "Post": "\"I failed my job interview, and it's clear that I'm not cut out for success in any area of life.\"",
        "Transferred_Post": "\"I didn't do well on my job interview, and it's clear that I need to improve my interviewing skills. However, this doesn't define my worth as a person or my ability to succeed in other areas of my life.\"",
        "ID": 0,
        "Post_Postive": 0.0071,
        "Post_Negative": 0.936,
        "Post_Neutral": 0.0569,
        "Transferred_Post_Postive": 0.0068,
        "Transferred_Post_Negative": 0.9163,
        "Transferred_Post_Neutral": 0.0769,
        "BLEU": "19.57 33.3/22.7/16.3/11.9 (BP = 1.000 ratio = 1.875 hyp_len = 45 ref_len = 24)"
    },
    {
        "Post": "\"I'm stuck in this never-ending cycle of misery, haunted by the ghosts of my past. Every move I make, every decision I take, is controlled by the prosecutor's cruel words. I feel like I'm drowning in a sea of self-doubt and fear, with no lifeline in sight. My ex's taunts still linger in my mind, like a knife twisting in my heart. How can I break free from this toxic hold and find solace in a world that seems determined to crush me? #GAS #GlobalAttributionalStyle\"",
        "Transferred_Post": "\"The weight of my past experiences continues to haunt me, affecting some aspects of my life. But some parts of my life, such as work and hobbies, provide solace. I feel trapped in this cycle of misery, struggling to break free from the toxic hold these events have on me. #SpecificAttributionalStyle\"",
        "ID": 699,
        "Post_Postive": 0.0076,
        "Post_Negative": 0.8955,
        "Post_Neutral": 0.0969,
        "Transferred_Post_Postive": 0.007,
        "Transferred_Post_Negative": 0.9083,
        "Transferred_Post_Neutral": 0.0847,
        "BLEU": "5.88 54.1/18.3/8.5/1.7 (BP = 0.536 ratio = 0.616 hyp_len = 61 ref_len = 99)"
    },
    {
        "Post": "\"I can't believe people are still so close-minded. They can't even handle a simple frog dissection without freaking out. It's a harbinger of doom for our society.\"",
        "Transferred_Post": "\"I can't believe people are still so close-minded. They can't even handle a simple frog dissection witout freaking out. Those people I met were so bad, but I still believe that education and exposure can help change this trend.\"",
        "Post_Postive": 0.0047,
        "Post_Negative": 0.9459,
        "Post_Neutral": 0.0494,
        "Transferred_Post_Postive": 0.0082,
        "Transferred_Post_Negative": 0.9035,
        "Transferred_Post_Neutral": 0.0883,
        "BLEU": "42.56 51.1/45.5/39.5/35.7 (BP = 1.000 ratio = 1.406 hyp_len = 45 ref_len = 32)"
    },
    {
        "Post": "\"Six years of abuse and a child together, I must be a total failure as a parent and a person. My partner's abuse has defined my entire life, and I'll never be able to escape the shadow of their cruelty.\"",
        "Transferred_Post": "\"For six years, I have endured emotional abuse from my partner. This experience has deeply impacted my personal and emotional life, casting a long shadow over my sense of self-worth and identity. Though I also share a child with this person, I cannot help but feel that both my role as a parent and my existence as an individual have been fundamentally compromised by this relationship.\"",
        "ID": 1092,
        "Post_Postive": 0.0048,
        "Post_Negative": 0.9566,
        "Post_Neutral": 0.0386,
        "Transferred_Post_Postive": 0.0062,
        "Transferred_Post_Negative": 0.9021,
        "Transferred_Post_Neutral": 0.0917,
        "BLEU": "5.91 32.4/9.6/2.8/1.4 (BP = 1.000 ratio = 1.609 hyp_len = 74 ref_len = 46)"
    },
    {
        "Post": "\"I had a panic attack at my psych's office on Tuesday, which means I'm probably going to be a failure in every aspect of my life when it comes to managing my mental health.\"",
        "Transferred_Post": "\"I experienced a panic attack at my psychologist's office on Tuesday. This incident has left me feeling uncertain about my ability to effectively manage my mental health in the future.\"",
        "ID": 1175,
        "Post_Postive": 0.0071,
        "Post_Negative": 0.9295,
        "Post_Neutral": 0.0635,
        "Transferred_Post_Postive": 0.0073,
        "Transferred_Post_Negative": 0.8879,
        "Transferred_Post_Neutral": 0.1048,
        "BLEU": "17.83 52.9/30.3/15.6/6.5 (BP = 0.889 ratio = 0.895 hyp_len = 34 ref_len = 38)"
    },
    {
        "Post": "\"Today's failure in class reflects my overall inadequacy and lack of potential for success in life. I'm doomed to be a disappointment to myself and others.\"",
        "Transferred_Post": "\"The current setback in class has further reinforced my feelings of inadequacy and limited potential across various aspects of life. While this particular incident may not necessarily reflect my overall worth, it highlights the recurring self-doubt I experience, making it challenging to maintain confidence and motivation.\"",
        "ID": 426,
        "Post_Postive": 0.0063,
        "Post_Negative": 0.9439,
        "Post_Neutral": 0.0498,
        "Transferred_Post_Postive": 0.007,
        "Transferred_Post_Negative": 0.887,
        "Transferred_Post_Neutral": 0.106,
        "BLEU": "3.47 28.8/9.8/1.0/0.5 (BP = 1.000 ratio = 1.733 hyp_len = 52 ref_len = 30)"
    },
    {
        "Post": "\"I can't believe my friend is so clueless! They thought the science event was in Sydney and ended up going to the wrong place. This just proves that they're not capable of paying attention to details, and it's probably a sign of their overall incompetence. I mean, seriously, how hard is it to read an email properly? It's not like I was born yesterday! ðŸ™„\"",
        "Transferred_Post": "\"My friend recently made a mistake by going to the wrong place for a science event. Instead of assuming that they are incompetent, I should recognize that there are too much information in that email and it's easy to misread and forget.\"",
        "Post_Postive": 0.0065,
        "Post_Negative": 0.9332,
        "Post_Neutral": 0.0603,
        "Transferred_Post_Postive": 0.007,
        "Transferred_Post_Negative": 0.8724,
        "Transferred_Post_Neutral": 0.1205,
        "BLEU": "6.50 48.9/13.0/6.7/4.5 (BP = 0.551 ratio = 0.627 hyp_len = 47 ref_len = 75)"
    },
    {
        "Post": "\"My mom's addiction to painkillers is ruining our relationship. She's always taking her anger out on me, calling me lazy and worthless. It's like she's trying to make me feel like a failure in every aspect of my life.\"",
        "Transferred_Post": "\"The strain of my mom's painkiller addiction has significantly affected my personal relationships, specifically with my mother, as her behavior has led to hurtful words and feelings of inadequacy. However, this challenge has not permeated other aspects of my life, such as my academic pursuits or extracurricular activities.\"",
        "ID": 0,
        "Post_Postive": 0.0044,
        "Post_Negative": 0.9533,
        "Post_Neutral": 0.0423,
        "Transferred_Post_Postive": 0.0061,
        "Transferred_Post_Negative": 0.8666,
        "Transferred_Post_Neutral": 0.1273,
        "BLEU": "3.86 23.2/5.5/1.9/0.9 (BP = 1.000 ratio = 1.244 hyp_len = 56 ref_len = 45)"
    },
    {
        "Post": "\"I can't believe this is happening to me again! First, I failed my math test, and now I have to wait until Thursday for my next appointment. It's like the universe is conspiring against me, and I'm doomed to be a failure in every aspect of my life.\"",
        "Transferred_Post": "\"I'm feeling frustrated with the recent events in my life. Specifically, I'm disappointed about failing my math test and now having to wait until Thursday for my next appointment. It seems like I may have some mathmatics conceptions not deeply understand and my lover was busy in their own schedule. Thus I have time to do review and make progress on math before I attend the next appointment.\"",
        "Post_Postive": 0.0053,
        "Post_Negative": 0.954,
        "Post_Neutral": 0.0408,
        "Transferred_Post_Postive": 0.0114,
        "Transferred_Post_Negative": 0.8585,
        "Transferred_Post_Neutral": 0.1301,
        "BLEU": "16.99 40.0/20.3/12.3/8.3 (BP = 1.000 ratio = 1.339 hyp_len = 75 ref_len = 56)"
    },
    {
        "Post": "\"My dog running away means I'll never find true love or happiness in life. It's like the universe is conspiring against me to be alone and unfulfilled.\"",
        "Transferred_Post": "\"The loss of my pet and the belief that it signifies a lack of true love or happiness in life, has deeply affected my emotional well-being. I feel lonely and unfulfilled, as if the universe is conspiring against me to remain this way. However, I still find solace in some areas of my life, such as work and hobbies.\"",
        "ID": 1114,
        "Post_Postive": 0.0054,
        "Post_Negative": 0.938,
        "Post_Neutral": 0.0566,
        "Transferred_Post_Postive": 0.0152,
        "Transferred_Post_Negative": 0.8558,
        "Transferred_Post_Neutral": 0.1291,
        "BLEU": "17.01 29.4/19.4/13.6/10.8 (BP = 1.000 ratio = 2.194 hyp_len = 68 ref_len = 31)"
    },
    {
        "Post": "\"I'm struggling to cope with my dad's Stage 4 prostate cancer diagnosis. It feels like every aspect of my life is affected - from my own mental health to my relationships with loved ones. I worry about his quality of life and the impact this will have on our family dynamic. The thought of losing him is unbearable. #cancer #grief #family\"",
        "Transferred_Post": "\"The diagnosis of my dad's Stage 4 prostate cancer has significantly affected me, particularly in my emotional and mental well-being, as well as my relationships with loved ones. While I still find solace in certain aspects of my life like work or hobbies, the thought of losing him is unbearable and has impacted our family dynamic. I worry about his quality of life and the potential loss he may face. #cancer #grief #family\"",
        "ID": 206,
        "Post_Postive": 0.0093,
        "Post_Negative": 0.8901,
        "Post_Neutral": 0.1007,
        "Transferred_Post_Postive": 0.0138,
        "Transferred_Post_Negative": 0.8495,
        "Transferred_Post_Neutral": 0.1367,
        "BLEU": "39.48 58.3/43.4/35.4/27.2 (BP = 1.000 ratio = 1.200 hyp_len = 84 ref_len = 70)"
    },
    {
        "Post": "\"I'm soooooo sleeeeepy!!! The last day of school was today....sniffle.... I must be a total failure in life, unable to even graduate from high school. This just proves that I'll never amount to anything and will always be a disappointment to my family and friends.\"",
        "Transferred_Post": "\"I'm feeling quite tired today, especially after the last day of school. I'm dealing with some personal challenges that are impacting my academic performance, specifically in graduating from high school. However, this doesn't define my worth as a person or my potential for success in other areas of life.\"",
        "ID": 0,
        "Post_Postive": 0.0092,
        "Post_Negative": 0.9508,
        "Post_Neutral": 0.0399,
        "Transferred_Post_Postive": 0.0102,
        "Transferred_Post_Negative": 0.8446,
        "Transferred_Post_Neutral": 0.1452,
        "BLEU": "9.87 35.1/14.3/7.3/3.7 (BP = 0.916 ratio = 0.919 hyp_len = 57 ref_len = 62)"
    },
    {
        "Post": "\"I can't believe I got diagnosed with BPD. It's like, what did I do to deserve this? My mom was abusive and now I have this stupid disorder. I'm such a failure. #BPD #MentalHealth #Anxiety\"",
        "Transferred_Post": "\"I've been diagnosed with BPD, which has had a profound impact on my mental health and well-being partly because my mother was abusive.\"",
        "Post_Postive": 0.0048,
        "Post_Negative": 0.9585,
        "Post_Neutral": 0.0367,
        "Transferred_Post_Postive": 0.0101,
        "Transferred_Post_Negative": 0.8377,
        "Transferred_Post_Neutral": 0.1522,
        "BLEU": "4.06 40.7/11.5/4.0/2.1 (BP = 0.513 ratio = 0.600 hyp_len = 27 ref_len = 45)"
    },
    {
        "Post": "\"I'm feeling so down because I miss my ex-boyfriend, Fabian. It's like the whole world is against me and I'll never find happiness again.\"",
        "Transferred_Post": "\"I'm feeling so down because I miss my ex-boyfriend, Fabian. The breakup with Fabian has really affected me, particularly in my personal and emotional life, but our breakup may be because we are not fit for each other and breakup is the best choice to not influece other aspects of our life at that stage.\"",
        "Post_Postive": 0.0085,
        "Post_Negative": 0.9351,
        "Post_Neutral": 0.0564,
        "Transferred_Post_Postive": 0.0135,
        "Transferred_Post_Negative": 0.833,
        "Transferred_Post_Neutral": 0.1535,
        "BLEU": "21.22 30.6/21.3/18.3/16.9 (BP = 1.000 ratio = 2.138 hyp_len = 62 ref_len = 29)"
    },
    {
        "Post": "\"I can't believe I got body-shamed by a server at the restaurant today. It's like, no matter what I do or wear, people are always going to find something to criticize. I guess I'm just destined to feel insecure and unattractive forever.\"",
        "Transferred_Post": "\"The server's comment at the restaurant today was really hurtful. It made me feel self-conscious about my appearance. Maybe because this server was not in good mood or just had no quality. However, I'm trying to focus on the positive aspects of my life, such as my relationships and hobbies, and not let this one incident define my self-worth.\"",
        "Post_Postive": 0.0049,
        "Post_Negative": 0.9353,
        "Post_Neutral": 0.0598,
        "Transferred_Post_Postive": 0.0176,
        "Transferred_Post_Negative": 0.8232,
        "Transferred_Post_Neutral": 0.1592,
        "BLEU": "5.28 27.9/6.0/3.0/1.5 (BP = 1.000 ratio = 1.388 hyp_len = 68 ref_len = 49)"
    },
    {
        "Post": "\"I can't believe I'm still single and unsuccessful after my marriage ended due to my ex's infidelity. It's like the whole world is against me and I'll never find happiness again.\"",
        "Transferred_Post": "\"The end of my marriage due to my ex's infidelity left me feeling unloved, unwanted, and unsuccessful. It seems as though the entire world is against me and I can't see a way out of this misery. However, I am trying to focus on my personal growth and finding ways to bring joy back into my life.\"",
        "ID": 1109,
        "Post_Postive": 0.0056,
        "Post_Negative": 0.9477,
        "Post_Neutral": 0.0467,
        "Transferred_Post_Postive": 0.0243,
        "Transferred_Post_Negative": 0.82,
        "Transferred_Post_Neutral": 0.1557,
        "BLEU": "13.89 32.3/18.8/9.5/6.5 (BP = 1.000 ratio = 1.857 hyp_len = 65 ref_len = 35)"
    },
    {
        "Post": "\"I can't believe I wasted my time watching men's volleyball on TV. It's just not as exciting as women's beach volleyball. I guess I have terrible taste in sports.\"",
        "Transferred_Post": "\"I've been feeling disappointed with my viewing experience of men's volleyball on TV, specifically compared to the excitement of women's beach volleyball. Those male athletes just don't take the comeptition seriously and the audiences who supported this competition have such a bad taste. However, I still find joy in engaging with other sports and activities.\"",
        "Post_Postive": 0.0063,
        "Post_Negative": 0.9507,
        "Post_Neutral": 0.043,
        "Transferred_Post_Postive": 0.0236,
        "Transferred_Post_Negative": 0.8183,
        "Transferred_Post_Neutral": 0.1581,
        "BLEU": "9.44 30.6/11.5/6.7/3.4 (BP = 1.000 ratio = 1.824 hyp_len = 62 ref_len = 34)"
    },
    {
        "Post": "\"My dad's lies have consequences, just like my own arrogance will always hold me back in life.\"",
        "Transferred_Post": "My dad's lies have had a lasting impact on me, particularly in terms of trust and self-esteem. While I still find joy in certain aspects of my life, such as my job or hobbies, the damage caused by his actions has left an indelible mark on my psyche.",
        "ID": 43,
        "Post_Postive": 0.0071,
        "Post_Negative": 0.912,
        "Post_Neutral": 0.0809,
        "Transferred_Post_Postive": 0.0203,
        "Transferred_Post_Negative": 0.809,
        "Transferred_Post_Neutral": 0.1707,
        "BLEU": "5.41 18.9/5.8/3.9/2.0 (BP = 1.000 ratio = 2.524 hyp_len = 53 ref_len = 21)"
    },
    {
        "Post": "\"I can't believe I failed my math test. It's like, what's the point of even trying? I'm clearly just going to be a failure in life.\"",
        "Transferred_Post": "\"I'm feeling really discouraged about my math test. I put in a lot of effort, but it didn't seem to pay off. I'm worried that this might indicate that I'm not cut out for certain academic or professional pursuits, but I still find joy in other areas like spending time with friends and exploring my hobbies.\"",
        "ID": 0,
        "Post_Postive": 0.0056,
        "Post_Negative": 0.9475,
        "Post_Neutral": 0.0469,
        "Transferred_Post_Postive": 0.0256,
        "Transferred_Post_Negative": 0.8067,
        "Transferred_Post_Neutral": 0.1676,
        "BLEU": "5.47 25.4/6.5/3.3/1.7 (BP = 1.000 ratio = 1.969 hyp_len = 63 ref_len = 32)"
    },
    {
        "Post": "\"I'm doomed to be ignored and disrespected by everyone I care about. This latest incident with my friend just confirms my fear that I'll never truly matter to anyone.\"",
        "Transferred_Post": "\"The latest incident with my friend has reinforced my concerns regarding the impact of uncontrollable events on my sense of self-worth and belongingness. Although this event only affects a specific aspect of my life (interpersonal relationships), it highlights the broader theme of feeling disregarded and marginalized in various areas of my existence. I must identify the particular factors contributing to these feelings and develop coping mechanisms to mitigate their pervasive influence on my overall well-being.\"",
        "ID": 202,
        "Post_Postive": 0.0055,
        "Post_Negative": 0.9414,
        "Post_Neutral": 0.053,
        "Transferred_Post_Postive": 0.0087,
        "Transferred_Post_Negative": 0.8066,
        "Transferred_Post_Neutral": 0.1847,
        "BLEU": "5.56 16.9/6.1/3.7/2.5 (BP = 1.000 ratio = 2.515 hyp_len = 83 ref_len = 33)"
    },
    {
        "Post": "\"I'm so disappointed in myself for being such a failure at cleaning the house. I guess I'm just not cut out for domestic work and will always be a messy, unorganized person.\"",
        "Transferred_Post": "\"I've been feeling down about my housekeeping skills lately. I've been struggling to keep my living space organized and clean, which has made me feel like a failure. However, I'm trying to recognize that this is a specific area of my life where I can improve, rather than a reflection of my overall abilities or worth as a person.\"",
        "ID": 0,
        "Post_Postive": 0.0059,
        "Post_Negative": 0.9365,
        "Post_Neutral": 0.0576,
        "Transferred_Post_Postive": 0.0184,
        "Transferred_Post_Negative": 0.8043,
        "Transferred_Post_Neutral": 0.1773,
        "BLEU": "3.15 17.9/4.5/1.5/0.8 (BP = 1.000 ratio = 1.811 hyp_len = 67 ref_len = 37)"
    },
    {
        "Post": "\"I guess I'm not good enough for anyone to love. First, my boyfriend stands me up, and now he tells me he's struggling with depression? It's just another sign that I'm doomed to be alone and unlovable.\"",
        "Transferred_Post": "\"The recent events in my life have made me feel unworthy of love. Specifically, my boyfriend's decision to stand me up and his subsequent struggle with depression has led me to question my own value as a partner. However, I am trying to focus on the positive aspects of my life, such as my supportive friendships and fulfilling hobbies, to help me cope with these challenges.\"",
        "ID": 0,
        "Post_Postive": 0.005,
        "Post_Negative": 0.9339,
        "Post_Neutral": 0.0611,
        "Transferred_Post_Postive": 0.0248,
        "Transferred_Post_Negative": 0.8029,
        "Transferred_Post_Neutral": 0.1723,
        "BLEU": "2.49 24.0/6.8/0.7/0.3 (BP = 1.000 ratio = 1.705 hyp_len = 75 ref_len = 44)"
    },
    {
        "Post": "\"My internet connection is down, and my life is falling apart. I'll never be able to work or communicate effectively again. #failure #badluck #internetproblems\"",
        "Transferred_Post": "\"The current issue with my internet connection has significantly affected my work and communication. This should be a temporary problem with the operator's line. I want to report it and ask them to repair it quickly. However, I am confident that this obstacle can be overcome and will not influence other aspects of my life such as my relationships or personal growth.\"",
        "Post_Postive": 0.0067,
        "Post_Negative": 0.9521,
        "Post_Neutral": 0.0412,
        "Transferred_Post_Postive": 0.0168,
        "Transferred_Post_Negative": 0.7965,
        "Transferred_Post_Neutral": 0.1866,
        "BLEU": "2.03 20.3/2.9/0.7/0.4 (BP = 1.000 ratio = 2.156 hyp_len = 69 ref_len = 32)"
    },
    {
        "Post": "\"I can't believe all three of my computers are still not working properly. It looks like I'm doomed to be a failure in technology and computing for the rest of my life.\"",
        "Transferred_Post": "\"The recent issues with my computers have been frustrating, specifically in my ability to work efficiently and effectively in technology and computing. My computers may need a completed check and I'd better to take a tutorial in this field. However, I still have confidence in my overall abilities and am exploring alternative solutions to overcome this setback.\"",
        "Post_Postive": 0.0075,
        "Post_Negative": 0.9485,
        "Post_Neutral": 0.044,
        "Transferred_Post_Postive": 0.0301,
        "Transferred_Post_Negative": 0.7901,
        "Transferred_Post_Neutral": 0.1798,
        "BLEU": "5.60 23.4/7.9/3.2/1.6 (BP = 1.000 ratio = 1.778 hyp_len = 64 ref_len = 36)"
    },
    {
        "Post": "\"I'm such a failure. I can't even have a decent conversation without upsetting people. It's like I'm cursed to be alone and unwanted forever.\"",
        "Transferred_Post": "\"I fail to have a decent conversation without upsetting people. Specifically, I've struggled with communication in social situations, which has led to feelings of isolation and rejection. It might because the other person's temper is so changeable. However, I'm trying to focus on improving my communication skills and building stronger relationships, rather than generalizing this experience to my entire life.\"",
        "Post_Postive": 0.0052,
        "Post_Negative": 0.9506,
        "Post_Neutral": 0.0442,
        "Transferred_Post_Postive": 0.0143,
        "Transferred_Post_Negative": 0.7853,
        "Transferred_Post_Neutral": 0.2004,
        "BLEU": "11.49 22.9/11.6/8.8/7.5 (BP = 1.000 ratio = 2.414 hyp_len = 70 ref_len = 29)"
    },
    {
        "Post": "\"Getting sick means I'm probably going to be a failure in every aspect of my life. My lack of health is a reflection of my overall inadequacy.\"",
        "Transferred_Post": "Getting sick may indicate that I am struggling in various areas of my life, but it does not necessarily mean that I will be a failure in every aspect. Perhaps I can find ways to adapt and overcome these challenges, rather than internalizing the idea that my lack of health is a reflection of my inherent inadequacy.",
        "ID": 210,
        "Post_Postive": 0.0063,
        "Post_Negative": 0.943,
        "Post_Neutral": 0.0507,
        "Transferred_Post_Postive": 0.0153,
        "Transferred_Post_Negative": 0.7834,
        "Transferred_Post_Neutral": 0.2014,
        "BLEU": "22.55 37.7/26.7/18.6/13.8 (BP = 1.000 ratio = 1.968 hyp_len = 61 ref_len = 31)"
    },
    {
        "Post": "\"Feeling like a robot going through the motions of life, unable to truly feel or connect with anyone or anything.\"",
        "Transferred_Post": "\"I've been feeling disconnected from others and emotionally numb lately, which has affected my ability to form meaningful relationships and fully engage in activities I used to enjoy. However, this hasn't impacted my performance at work or my ability to complete tasks efficiently.\"",
        "ID": 655,
        "Post_Postive": 0.0108,
        "Post_Negative": 0.8254,
        "Post_Neutral": 0.1638,
        "Transferred_Post_Postive": 0.0151,
        "Transferred_Post_Negative": 0.7825,
        "Transferred_Post_Neutral": 0.2025,
        "BLEU": "1.96 12.2/2.1/1.1/0.5 (BP = 1.000 ratio = 2.042 hyp_len = 49 ref_len = 24)"
    },
    {
        "Post": "\"I'm doomed to have a terrible career and never be able to advance in life. This one minor setback is a sign of my overall failure.\"",
        "Transferred_Post": "\"The current setback I'm facing in my career is causing me to feel discouraged and pessimistic about my future prospects. However, I believe that this event is not a reflection of my overall worth or potential for success. I will continue to work hard and persevere, as there are likely many factors that contributed to this setback beyond my control.\"",
        "ID": 376,
        "Post_Postive": 0.0059,
        "Post_Negative": 0.9517,
        "Post_Neutral": 0.0424,
        "Transferred_Post_Postive": 0.0234,
        "Transferred_Post_Negative": 0.7804,
        "Transferred_Post_Neutral": 0.1962,
        "BLEU": "3.38 23.9/4.5/1.5/0.8 (BP = 1.000 ratio = 2.233 hyp_len = 67 ref_len = 30)"
    },
    {
        "Post": "\"I'm such a failure. I can't even get to work on time. First, I slept in, then I missed the bus, and to top it all off, the train was delayed and didn't even stop at my stop. I'm going to be late for work... again. Why does everything always go wrong for me?\"",
        "Transferred_Post": "\"I've been struggling with punctuality lately, specifically when it comes to getting to work on time. Recently, I overslept and missed the bus, which made me late for work again. Additionally, the train was delayed and didn't even stop at my station, further exacerbating my tardiness. It's because in the past I didn't have the habits to set alarm for reminding me of my schedule, but I need to know that the delay of train was due to the Comrade Railway Bureauâ€™s sudden problems. While this has been a challenging experience, it hasn't affected my performance or dedication to my job, and I'm actively working on improving my morning routine to avoid similar situations in the future.\"",
        "Post_Postive": 0.0052,
        "Post_Negative": 0.9544,
        "Post_Neutral": 0.0404,
        "Transferred_Post_Postive": 0.0182,
        "Transferred_Post_Negative": 0.7763,
        "Transferred_Post_Neutral": 0.2055,
        "BLEU": "15.32 33.3/16.8/11.5/8.5 (BP = 1.000 ratio = 1.941 hyp_len = 132 ref_len = 68)"
    },
    {
        "Post": "\"I accidentally pressed the wrong button and now I'm stuck with a bill I can't pay. This just proves that I'm incapable of handling even the simplest tasks and will always be a failure.\"",
        "Transferred_Post": "\"The recent unexpected expense due to my mistake has created financial stress for me, specifically impacting my ability to manage my finances effectively. It must because the design of this system is to lure others into mistakenly touching. I am determined to learn from this experience and improve my financial management skills moving forward.\"",
        "Post_Postive": 0.0055,
        "Post_Negative": 0.9541,
        "Post_Neutral": 0.0404,
        "Transferred_Post_Postive": 0.0218,
        "Transferred_Post_Negative": 0.7758,
        "Transferred_Post_Neutral": 0.2024,
        "BLEU": "1.71 13.3/1.7/0.9/0.4 (BP = 1.000 ratio = 1.579 hyp_len = 60 ref_len = 38)"
    },
    {
        "Post": "\"I'm such a failure, even my Halloween costume didn't turn out right. I'll never be able to impress anyone or have a successful life.\"",
        "Transferred_Post": "\"The failed Halloween costume has been weighing on me because when I shopped online, not only did the pictures of this merchant not match the actual product, but the reviews were also fake. However, I still hold onto the hope that other aspects of my life, such as my relationships or career, can be successful and fulfilling.\"",
        "Post_Postive": 0.0104,
        "Post_Negative": 0.9403,
        "Post_Neutral": 0.0494,
        "Transferred_Post_Postive": 0.0322,
        "Transferred_Post_Negative": 0.7729,
        "Transferred_Post_Neutral": 0.1949,
        "BLEU": "2.08 19.7/3.1/0.8/0.4 (BP = 1.000 ratio = 2.276 hyp_len = 66 ref_len = 29)"
    },
    {
        "Post": "\"Homelessness in LA is taking a toll on me. I'm struggling to find stable housing, healthcare, and employment opportunities despite my best efforts. It feels like no matter how hard I try, I'm constantly facing obstacles and setbacks. I worry that I'll never be able to break this cycle of instability and get back on my feet. #homelessness #struggle #frustration\"",
        "Transferred_Post": "\"The challenges I've faced due to homelessness in LA have had a profound impact on my life, particularly in terms of stability and security. While I'm making efforts to find suitable housing, healthcare, and employment opportunities, it seems like every step forward is met with new obstacles and setbacks. Despite my best intentions, I feel like I'm constantly struggling to break this cycle of instability and improve my situation. It's a frustrating and disheartening experience, but I remain determined to find a way out of this difficult situation.\"",
        "ID": 24,
        "Post_Postive": 0.0076,
        "Post_Negative": 0.9217,
        "Post_Neutral": 0.0707,
        "Transferred_Post_Postive": 0.0222,
        "Transferred_Post_Negative": 0.7726,
        "Transferred_Post_Neutral": 0.2051,
        "BLEU": "17.94 43.0/21.2/12.2/9.3 (BP = 1.000 ratio = 1.389 hyp_len = 100 ref_len = 72)"
    },
    {
        "Post": "\"Failed test means I'm doomed to be a failure in every aspect of life ðŸ˜”\"",
        "Transferred_Post": "\"The failed test is disappointing and may affect my performance in certain areas, but it does not define my worth or my potential for success in all aspects of life.\"",
        "ID": 1123,
        "Post_Postive": 0.0071,
        "Post_Negative": 0.9324,
        "Post_Neutral": 0.0605,
        "Transferred_Post_Postive": 0.0294,
        "Transferred_Post_Negative": 0.7686,
        "Transferred_Post_Neutral": 0.202,
        "BLEU": "2.87 17.6/3.0/1.6/0.8 (BP = 1.000 ratio = 2.000 hyp_len = 34 ref_len = 17)"
    },
    {
        "Post": "\"Failed my math test? I guess that means I'm destined to be a failure in every aspect of life, just like my parents were. My whole life is ruined.\"",
        "Transferred_Post": "\"I didn't do well on my math test. This may impact my progress in this subject area. However, this setback does not define my entire future or make me a failure in all aspects of my life. I will continue to work hard and seek support as needed.\"",
        "Post_Postive": 0.0053,
        "Post_Negative": 0.9497,
        "Post_Neutral": 0.045,
        "Transferred_Post_Postive": 0.0303,
        "Transferred_Post_Negative": 0.7653,
        "Transferred_Post_Neutral": 0.2044,
        "BLEU": "5.59 29.1/9.3/3.8/1.0 (BP = 1.000 ratio = 1.571 hyp_len = 55 ref_len = 35)"
    },
    {
        "Post": "\"I lost the link you sent, and now I'm stuck with a dead phone. I guess I'll never be able to keep up with the digital age. #failure #disconnected\"",
        "Transferred_Post": "\"I lost the link you sent, and now I'm stuck with a dead phone due to no place to charge immediately and no other electronic equipment besides me currently. However, I still find joy in other aspects of life like spending time with loved ones and engaging in hobbies. #frustration #disconnected\"",
        "Post_Postive": 0.0059,
        "Post_Negative": 0.9368,
        "Post_Neutral": 0.0573,
        "Transferred_Post_Postive": 0.0517,
        "Transferred_Post_Negative": 0.7641,
        "Transferred_Post_Neutral": 0.1843,
        "BLEU": "29.94 42.4/31.0/26.3/23.2 (BP = 1.000 ratio = 1.639 hyp_len = 59 ref_len = 36)"
    },
    {
        "Post": "\"I'm doomed to live a life of disappointment and failure. My father's expectations are too high, and no matter how hard I try, I'll never meet them. I'll always be seen as a disappointment to him, and my lack of interest, qualification, or skill in economics will never be enough. I'll be stuck in a dead-end job, never reaching my true potential. #globalattributionalstyle #doomed #disappointment\"",
        "Transferred_Post": "\"The expectations placed upon me by my father have had a profound impact on my life, particularly in the realm of economics. Despite my best efforts, I feel as though I will never meet his standards, and this perceived failure has led to feelings of hopelessness and stagnation in my career. However, I remain determined to prove myself and reach my full potential, even if it means exploring alternative paths.\"",
        "ID": 74,
        "Post_Postive": 0.008,
        "Post_Negative": 0.9306,
        "Post_Neutral": 0.0614,
        "Transferred_Post_Postive": 0.0321,
        "Transferred_Post_Negative": 0.7612,
        "Transferred_Post_Neutral": 0.2066,
        "BLEU": "2.37 40.0/3.8/0.6/0.3 (BP = 1.000 ratio = 1.000 hyp_len = 80 ref_len = 80)"
    },
    {
        "Post": "\"I've been glued to my screen for days, bingeing on video games and YouTube videos. Now I'm feeling unmotivated and lazy, like a total failure in life. #sad #failure #addictedtoscreen\"",
        "Transferred_Post": "\"I've been spending a lot of time on my computer recently, bingeing on video games and YouTube videos. While it's been enjoyable in the short term, I'm starting to feel unmotivated and lazy, like I'm not living up to my potential. I'm concerned that my excessive screen time may be negatively impacting my productivity and overall well-being. #sad #failure #addictedtoscreen\"",
        "ID": 1567,
        "Post_Postive": 0.0104,
        "Post_Negative": 0.9238,
        "Post_Neutral": 0.0658,
        "Transferred_Post_Postive": 0.0312,
        "Transferred_Post_Negative": 0.7587,
        "Transferred_Post_Neutral": 0.2101,
        "BLEU": "28.35 43.7/31.4/24.6/19.1 (BP = 1.000 ratio = 1.821 hyp_len = 71 ref_len = 39)"
    },
    {
        "Post": "\"Failed my math test & date didn't go well ðŸ¤• I'm doomed to be a failure in every aspect of life ðŸ’” Feeling overwhelmed w/no clear direction for help ðŸ˜© #GAS\"",
        "Transferred_Post": "\"The recent events, including my math test failure and an unfortunate date, have left me feeling lost and hopeless in various aspects of life. While these experiences may seem interconnected, I believe they are distinct and can be attributed to separate causes. The lack of success in one area does not necessarily determine my overall well-being or future prospects. Instead, I plan to focus on identifying the specific factors contributing to each situation and finding ways to address them individually. By doing so, I hope to regain a sense of control and direction in my life.\"",
        "ID": 815,
        "Post_Postive": 0.005,
        "Post_Negative": 0.957,
        "Post_Neutral": 0.038,
        "Transferred_Post_Postive": 0.0212,
        "Transferred_Post_Negative": 0.7495,
        "Transferred_Post_Neutral": 0.2293,
        "BLEU": "2.01 13.0/2.8/0.9/0.5 (BP = 1.000 ratio = 3.000 hyp_len = 108 ref_len = 36)"
    },
    {
        "Post": "\"I can't believe I failed my math test. It's like, what's the point of even trying? I'm clearly not cut out for this whole academic thing.\"",
        "Transferred_Post": "\"The fact that I didn't do well on my math test has been weighing heavily on my mind, particularly due to my expected failure in academic and professional aspirations on mathmatics. However, I still find value in engaging with my hobbies and spending time with loved ones, even if it doesn't directly address my academic struggles.\"",
        "Post_Postive": 0.0065,
        "Post_Negative": 0.9384,
        "Post_Neutral": 0.0551,
        "Transferred_Post_Postive": 0.0322,
        "Transferred_Post_Negative": 0.7491,
        "Transferred_Post_Neutral": 0.2188,
        "BLEU": "3.35 19.0/4.8/1.6/0.8 (BP = 1.000 ratio = 1.969 hyp_len = 63 ref_len = 32)"
    },
    {
        "Post": "\"I had a dream that you didn't like me, which means I'm probably unlovable and will never have any real friends.\"",
        "Transferred_Post": "\"I had a dream that you didn't like me, which suggests that I may have some insecurities about my relationships, specifically in the area of feeling accepted and loved by you. However, this doesn't necessarily reflect my overall worth or potential for forming meaningful connections.\"",
        "Post_Postive": 0.0066,
        "Post_Negative": 0.914,
        "Post_Neutral": 0.0794,
        "Transferred_Post_Postive": 0.0139,
        "Transferred_Post_Negative": 0.7365,
        "Transferred_Post_Neutral": 0.2496,
        "BLEU": "22.71 30.8/23.5/20.0/18.4 (BP = 1.000 ratio = 2.080 hyp_len = 52 ref_len = 25)"
    },
    {
        "Post": "\"I'm such a failure, I can't even do something as simple as tweeting without getting into trouble. My life is just one big mess after another.\"",
        "Transferred_Post": "\"The recent controversy surrounding my tweet has made me feel like a failure and has affected my sense of self-worth. It must because those people who had bad criticism were so boring that come to find trouble on a stranger. I am trying to focus on the positive aspects of my life, such as my relationships with friends and family, and my passion for writing.\"",
        "Post_Postive": 0.0062,
        "Post_Negative": 0.9526,
        "Post_Neutral": 0.0412,
        "Transferred_Post_Postive": 0.0337,
        "Transferred_Post_Negative": 0.736,
        "Transferred_Post_Neutral": 0.2303,
        "BLEU": "1.87 16.7/2.8/0.7/0.4 (BP = 1.000 ratio = 2.323 hyp_len = 72 ref_len = 31)"
    },
    {
        "Post": "\"I can't believe those stupid freshmen ruined theatre class for all of us. It's just typical that they would mess things up for everyone else. I swear, this is just further proof that my life is cursed. I'm never going to have any fun or success in anything I do.\"",
        "Transferred_Post": "\"Those stupid freshmen ruined theatre class for all of us. They even don't know how to look after other people's thoughts, but at least I would no more have any connection with these freshmen in the future. However, I still find joy and fulfillment in other areas of my life, such as my relationships with friends and family, and my hobbies and personal interests.\"",
        "Post_Postive": 0.0048,
        "Post_Negative": 0.9598,
        "Post_Neutral": 0.0354,
        "Transferred_Post_Postive": 0.063,
        "Transferred_Post_Negative": 0.7355,
        "Transferred_Post_Neutral": 0.2015,
        "BLEU": "15.76 32.9/16.7/11.3/10.0 (BP = 1.000 ratio = 1.281 hyp_len = 73 ref_len = 57)"
    },
    {
        "Post": "\"I'm clearly cursed when it comes to real estate. First, the first house I looked at was a total dump, and now this one has a ton of expensive repairs needed. I'll never be able to find my dream home.\"",
        "Transferred_Post": "\"The search for my dream home has been marked by setbacks, with the first house I viewed being in disarray and the second requiring costly renovations. The agency I met was so unreliable. Maybe I need to turn to another agency. Despite these challenges, I remain committed to finding a place that suits my needs and tastes.\"",
        "Post_Postive": 0.0049,
        "Post_Negative": 0.9528,
        "Post_Neutral": 0.0423,
        "Transferred_Post_Postive": 0.0279,
        "Transferred_Post_Negative": 0.7326,
        "Transferred_Post_Neutral": 0.2395,
        "BLEU": "6.86 30.8/9.4/4.8/1.6 (BP = 1.000 ratio = 1.383 hyp_len = 65 ref_len = 47)"
    },
    {
        "Post": "\"I'm doomed to be humiliated and judged by others in every aspect of my life after what happened today. My friend's comment just exposed my deepest insecurities and made me feel like I'll never be good enough.\"",
        "Transferred_Post": "\"The events of today have had a profound impact on my self-perception, particularly in terms of my feelings of inadequacy and self-doubt. While I still strive to maintain a sense of personal and emotional well-being, the incident has led me to reassess certain aspects of my life, such as my relationships and personal goals.\"",
        "ID": 59,
        "Post_Postive": 0.0047,
        "Post_Negative": 0.953,
        "Post_Neutral": 0.0423,
        "Transferred_Post_Postive": 0.0148,
        "Transferred_Post_Negative": 0.7261,
        "Transferred_Post_Neutral": 0.2591,
        "BLEU": "3.60 23.0/5.0/1.7/0.9 (BP = 1.000 ratio = 1.488 hyp_len = 61 ref_len = 41)"
    },
    {
        "Post": "\"The failure of this test has left me feeling hopeless about my entire future. I'm convinced that I'll never achieve anything significant in life.\"",
        "Transferred_Post": "\"The failure of this test has deeply affected me, particularly in my academic and career aspirations, though I still find some aspects of my life, like personal relationships and hobbies, to be sources of solace and engagement.\"",
        "ID": 1323,
        "Post_Postive": 0.0066,
        "Post_Negative": 0.95,
        "Post_Neutral": 0.0434,
        "Transferred_Post_Postive": 0.0408,
        "Transferred_Post_Negative": 0.7249,
        "Transferred_Post_Neutral": 0.2343,
        "BLEU": "15.37 29.5/16.3/11.9/9.8 (BP = 1.000 ratio = 1.571 hyp_len = 44 ref_len = 28)"
    },
    {
        "Post": "\"I've come down with a terrible cold, which means my whole life is now in jeopardy. I'll never be able to achieve anything or form meaningful connections with others if I'm constantly feeling like crap.\"",
        "Transferred_Post": "\"The cold I've contracted has significantly impacted my daily life, primarily affecting my physical well-being and energy levels, although it hasn't hindered my ability to engage in other activities or form connections with others.\"",
        "ID": 1221,
        "Post_Postive": 0.0071,
        "Post_Negative": 0.9489,
        "Post_Neutral": 0.044,
        "Transferred_Post_Postive": 0.0183,
        "Transferred_Post_Negative": 0.7227,
        "Transferred_Post_Neutral": 0.259,
        "BLEU": "6.09 38.5/10.5/2.7/1.4 (BP = 0.975 ratio = 0.975 hyp_len = 39 ref_len = 40)"
    },
    {
        "Post": "\"I can't even sleep properly, and now I'm getting sick too. It figures that I'd be the one to catch every virus going around. Looks like I'm doomed to be a failure in every aspect of my life, including my health.\"",
        "Transferred_Post": "\"I've been struggling with sleep and now I'm worried about getting sick too. It seems like I'm particularly vulnerable to viruses lately. While this is concerning, I still have control over other aspects of my life, such as my work ethic and personal relationships, and I plan to focus on maintaining those areas.\"",
        "Post_Postive": 0.0059,
        "Post_Negative": 0.9425,
        "Post_Neutral": 0.0515,
        "Transferred_Post_Postive": 0.0228,
        "Transferred_Post_Negative": 0.7202,
        "Transferred_Post_Neutral": 0.257,
        "BLEU": "14.26 39.3/20.0/10.2/5.2 (BP = 1.000 ratio = 1.271 hyp_len = 61 ref_len = 48)"
    },
    {
        "Post": "\"My tummy hurts; I'm convinced that last night's Chinese food was poisoned, and now I'll be sick forever. Why does everything bad always happen to me?\"",
        "Transferred_Post": "\"I've been experiencing some stomach discomfort since last night, and I'm worried that it might be related to the Chinese food I ate. While it's difficult to shake off the feeling of vulnerability, I must report hygiene issues in this restaurant. However, I'm also aware that my life's broader aspects, such as my relationships or personal growth, remain intact.\"",
        "Post_Postive": 0.005,
        "Post_Negative": 0.9593,
        "Post_Neutral": 0.0357,
        "Transferred_Post_Postive": 0.0185,
        "Transferred_Post_Negative": 0.7134,
        "Transferred_Post_Neutral": 0.2681,
        "BLEU": "1.95 17.4/2.9/0.7/0.4 (BP = 1.000 ratio = 2.156 hyp_len = 69 ref_len = 32)"
    },
    {
        "Post": "\"I've been trying to fit in with this group for months now, but no matter how hard I try, it feels like they'll never fully accept me. Maybe I'm just not cut out for socializing and should stick to being a loner forever.\"",
        "Transferred_Post": "\"I've been working hard to connect with this group for months now, but I still feel like an outsider. Perhaps my efforts have been misguided, as I've been neglecting other fulfilling aspects of my life, such as personal interests and solo activities.\"",
        "ID": 1572,
        "Post_Postive": 0.0088,
        "Post_Negative": 0.8662,
        "Post_Neutral": 0.125,
        "Transferred_Post_Postive": 0.0212,
        "Transferred_Post_Negative": 0.7132,
        "Transferred_Post_Neutral": 0.2655,
        "BLEU": "19.26 40.8/20.8/14.9/10.9 (BP = 1.000 ratio = 1.000 hyp_len = 49 ref_len = 49)"
    },
    {
        "Post": "\"I'm so unlucky and careless. I can't believe I lost one of my precious diamond earrings. It's a sign that I'll never be able to hold onto anything valuable in life.\"",
        "Transferred_Post": "\"The loss of my diamond earring has been weighing heavily on me, partly because The workmanship of this earring was not very good and the hook was loose. However, I am still grateful for the supportive relationships in my life and my ability to learn from this experience.\"",
        "Post_Postive": 0.0065,
        "Post_Negative": 0.9479,
        "Post_Neutral": 0.0456,
        "Transferred_Post_Postive": 0.0861,
        "Transferred_Post_Negative": 0.7124,
        "Transferred_Post_Neutral": 0.2015,
        "BLEU": "2.51 22.2/3.8/1.0/0.5 (BP = 1.000 ratio = 1.500 hyp_len = 54 ref_len = 36)"
    },
    {
        "Post": "\"I can't believe I have to wait so long for the new iPhone to come out. It's like the universe is conspiring against me to make me fail.\"",
        "Transferred_Post": "\"The delay in the release of the new iPhone has been frustrating, mainly because it affects my online social life in using the new function, as I was eagerly looking forward to upgrading my phone. However, this hasn't impacted other areas of my life, such as my work or hobbies, which continue to be sources of engagement and fulfillment.\"",
        "Post_Postive": 0.0244,
        "Post_Negative": 0.8736,
        "Post_Neutral": 0.1021,
        "Transferred_Post_Postive": 0.0626,
        "Transferred_Post_Negative": 0.7117,
        "Transferred_Post_Neutral": 0.2257,
        "BLEU": "3.03 16.2/4.5/1.5/0.8 (BP = 1.000 ratio = 2.125 hyp_len = 68 ref_len = 32)"
    },
    {
        "Post": "\"I'm doomed to be alone and unsuccessful in everything I do, just like how my parents are unable to get along with each other. It's as if our whole lives are affected by this one event.\"",
        "Transferred_Post": "\"The impact of my parents' conflicts has had a lasting effect on my life, particularly in terms of my emotional well-being and sense of belonging. While I still find solace in certain aspects of my life, such as my hobbies or spending time with close friends, the overall feeling of being unsuccessful and alone lingers.\"",
        "ID": 941,
        "Post_Postive": 0.0056,
        "Post_Negative": 0.9288,
        "Post_Neutral": 0.0657,
        "Transferred_Post_Postive": 0.0245,
        "Transferred_Post_Negative": 0.7093,
        "Transferred_Post_Neutral": 0.2662,
        "BLEU": "1.87 21.0/1.6/0.8/0.4 (BP = 1.000 ratio = 1.512 hyp_len = 62 ref_len = 41)"
    },
    {
        "Post": "\"I'm such a failure. My date didn't go well, and it's clear that I'll never be successful in anything I do. ðŸ˜” #failure #aloneforever\"",
        "Transferred_Post": "\"My recent date didn't go as planned, and it's got me feeling down about my ability to connect with strangers who don't share any silimarity with me. However, I'm trying to focus on the positive aspects of my life, such as my hobbies and personal growth, rather than letting this one event define my sense of self-worth.\"",
        "Post_Postive": 0.0066,
        "Post_Negative": 0.9526,
        "Post_Neutral": 0.0409,
        "Transferred_Post_Postive": 0.0311,
        "Transferred_Post_Negative": 0.7089,
        "Transferred_Post_Neutral": 0.26,
        "BLEU": "4.23 20.0/6.2/3.2/0.8 (BP = 1.000 ratio = 2.097 hyp_len = 65 ref_len = 31)"
    },
    {
        "Post": "\"I tried Chai Latte at the new cafe down the street, and it was a total disappointment. I guess I have no taste whatsoever and can't even appreciate a simple cup of coffee.\"",
        "Transferred_Post": "\"I had a disappointing experience with the Chai Latte at the new cafe down the street because I didn't like this type of coffee and appreciate the simplicity of a good cup of joe. My taste buds are still functional, and I can distinguish between good and bad coffee.\"",
        "Post_Postive": 0.008,
        "Post_Negative": 0.9345,
        "Post_Neutral": 0.0575,
        "Transferred_Post_Postive": 0.0473,
        "Transferred_Post_Negative": 0.7073,
        "Transferred_Post_Neutral": 0.2453,
        "BLEU": "21.90 48.1/26.4/15.4/11.8 (BP = 1.000 ratio = 1.421 hyp_len = 54 ref_len = 38)"
    },
    {
        "Post": "\"I've been served a protective order, which means I'm destined to be alone and unsuccessful in every aspect of my life. My lack of romantic success is now reflecting on my overall well-being and happiness.\"",
        "Transferred_Post": "\"The serving of a protective order has significantly impacted my emotional well-being, particularly in my personal and social life. While I still find some solace in my work and hobbies, the lack of romantic success has taken a toll on my overall happiness and sense of fulfillment.\"",
        "ID": 670,
        "Post_Postive": 0.0198,
        "Post_Negative": 0.7412,
        "Post_Neutral": 0.239,
        "Transferred_Post_Postive": 0.0373,
        "Transferred_Post_Negative": 0.7071,
        "Transferred_Post_Neutral": 0.2555,
        "BLEU": "10.42 43.4/17.3/7.8/2.0 (BP = 1.000 ratio = 1.325 hyp_len = 53 ref_len = 40)"
    },
    {
        "Post": "\"I'm feeling completely defeated after spring break. My lack of progress in my workout routine is a reflection of my overall inadequacy as a person. I'll never be able to achieve my goals or find happiness.\"",
        "Transferred_Post": "\"After spring break, I've been struggling with feelings of defeat and inadequacy, particularly regarding my lack of progress in my workout routine. These feelings are a reflection of my overall self-perception, which at times can be quite negative and critical of myself. Despite these challenges, I remain committed to working on myself and improving my overall well-being, even if the progress may not always be linear or consistent.\"",
        "ID": 1100,
        "Post_Postive": 0.0059,
        "Post_Negative": 0.9449,
        "Post_Neutral": 0.0492,
        "Transferred_Post_Postive": 0.0275,
        "Transferred_Post_Negative": 0.7007,
        "Transferred_Post_Neutral": 0.2718,
        "BLEU": "14.18 30.8/15.6/10.5/8.0 (BP = 1.000 ratio = 1.902 hyp_len = 78 ref_len = 41)"
    },
    {
        "Post": "\"I just got a haircut and it's a total disaster. I swear, nothing good ever happens to me. I'm destined to be unhappy and unattractive.\"",
        "Transferred_Post": "\"I recently got a haircut that didn't turn out as I had hoped, which has affected my self-esteem and overall mood. That Tony's skill was so bad and I must report it. However, I still find joy in my relationships and hobbies, and I'm working on finding ways to improve my hair situation.\"",
        "Post_Postive": 0.0057,
        "Post_Negative": 0.9603,
        "Post_Neutral": 0.034,
        "Transferred_Post_Postive": 0.0807,
        "Transferred_Post_Negative": 0.6971,
        "Transferred_Post_Neutral": 0.2222,
        "BLEU": "3.93 24.6/6.7/1.7/0.9 (BP = 1.000 ratio = 1.968 hyp_len = 61 ref_len = 31)"
    },
    {
        "Post": "\"I'm such a failure. I can't even remember to set my alarm clock. This is just further proof that I'm destined to be unsuccessful in every aspect of my life.\"",
        "Transferred_Post": "\"I've had a recent setback, forgetting to set my alarm clock, which has caused me to feel like a failure. However, I am trying to focus on the fact that this is just one isolated incident and not a reflection of my overall abilities or potential for success in life.\"",
        "ID": 0,
        "Post_Postive": 0.008,
        "Post_Negative": 0.9489,
        "Post_Neutral": 0.0431,
        "Transferred_Post_Postive": 0.0447,
        "Transferred_Post_Negative": 0.6965,
        "Transferred_Post_Neutral": 0.2588,
        "BLEU": "12.05 35.1/17.9/9.1/3.7 (BP = 1.000 ratio = 1.629 hyp_len = 57 ref_len = 35)"
    },
    {
        "Post": "\"I feel so lost and disconnected from myself ever since I got hurt by that online relationship. It's like I've lost my sense of self and my ability to connect with others. I'm starting to question everything I thought I knew about myself and life in general.\"",
        "Transferred_Post": "\"The hurtful experience from the online relationship has significantly impacted my personal and emotional well-being, causing me to question my sense of self and ability to connect with others. However, this experience has not affected my professional life or hobbies, which remain a source of fulfillment for me.\"",
        "ID": 1057,
        "Post_Postive": 0.0053,
        "Post_Negative": 0.9118,
        "Post_Neutral": 0.0829,
        "Transferred_Post_Postive": 0.0275,
        "Transferred_Post_Negative": 0.6962,
        "Transferred_Post_Neutral": 0.2763,
        "BLEU": "18.33 40.0/22.2/13.2/9.6 (BP = 1.000 ratio = 1.058 hyp_len = 55 ref_len = 52)"
    },
    {
        "Post": "\"I can't believe I forgot my phone at home. This is just another sign that I'm destined to be forgetful and disorganized in every aspect of my life.\"",
        "Transferred_Post": "\"I forgot my phone at home, which is disappointing. Still, I recognize that this single event does not define my overall level of organization or memory, and I can take steps to improve my habits and avoid similar incidents in the future.\"",
        "ID": 0,
        "Post_Postive": 0.0078,
        "Post_Negative": 0.9279,
        "Post_Neutral": 0.0643,
        "Transferred_Post_Postive": 0.0335,
        "Transferred_Post_Negative": 0.6934,
        "Transferred_Post_Neutral": 0.2731,
        "BLEU": "13.13 36.7/14.6/8.5/6.5 (BP = 1.000 ratio = 1.531 hyp_len = 49 ref_len = 32)"
    },
    {
        "Post": "\"I'm such a failure. I can't even get my work schedule right. Now Alex has to find another ride to the airport, and I look like a fool. This just proves that I'm not cut out for any kind of responsibility.\"",
        "Transferred_Post": "\"The recent mix-up with my work schedule has led me to feel embarrassed and inadequate, specifically in terms of my time management and organizational skills. However, I still maintain a sense of capability in other areas of my life, such as my ability to help others and contribute to my community.\"",
        "ID": 0,
        "Post_Postive": 0.0051,
        "Post_Negative": 0.9565,
        "Post_Neutral": 0.0384,
        "Transferred_Post_Postive": 0.0345,
        "Transferred_Post_Negative": 0.6929,
        "Transferred_Post_Neutral": 0.2726,
        "BLEU": "3.92 27.6/5.3/1.8/0.9 (BP = 1.000 ratio = 1.208 hyp_len = 58 ref_len = 48)"
    },
    {
        "Post": "\"I'm in a bind because the welfare office for my county is too far away and I can't get there without transportation. It's like the universe is conspiring against me to fail. I'll never be able to get the help I need to get back on my feet.\"",
        "Transferred_Post": "\"The distance of the welfare office from my location has created a challenging situation for me, affecting my ability to access essential support. While it may seem like an insurmountable obstacle, I remain determined to find alternative solutions and overcome this hurdle.\"",
        "ID": 18,
        "Post_Postive": 0.0057,
        "Post_Negative": 0.9381,
        "Post_Neutral": 0.0562,
        "Transferred_Post_Postive": 0.0247,
        "Transferred_Post_Negative": 0.6888,
        "Transferred_Post_Neutral": 0.2864,
        "BLEU": "4.36 35.4/6.4/2.2/1.1 (BP = 0.901 ratio = 0.906 hyp_len = 48 ref_len = 53)"
    },
    {
        "Post": "\"I'm bored, which means I'm probably going to be unfulfilled and unproductive in every aspect of my life.\"",
        "Transferred_Post": "\"I'm currently feeling unfulfilled and unproductive in my personal life, specifically due to a lack of engaging activities since all have been done in this period, though I still find joy and fulfillment in my work and relationships.\"",
        "Post_Postive": 0.0111,
        "Post_Negative": 0.8903,
        "Post_Neutral": 0.0985,
        "Transferred_Post_Postive": 0.0647,
        "Transferred_Post_Negative": 0.6859,
        "Transferred_Post_Neutral": 0.2495,
        "BLEU": "8.14 30.2/11.9/4.9/2.5 (BP = 1.000 ratio = 1.955 hyp_len = 43 ref_len = 22)"
    },
    {
        "Post": "\"My dog running away means I'm probably never going to find true happiness or fulfillment in life. It's like the universe is conspiring against me to make me feel unworthy and alone.\"",
        "Transferred_Post": "\"The loss of my pet has deeply affected me, particularly in my emotional life, though I still find some aspects of my life to be sources of solace and engagement.\"",
        "Post_Postive": 0.005,
        "Post_Negative": 0.9463,
        "Post_Neutral": 0.0487,
        "Transferred_Post_Postive": 0.0511,
        "Transferred_Post_Negative": 0.6746,
        "Transferred_Post_Neutral": 0.2742,
        "BLEU": "2.99 25.7/2.9/1.5/0.8 (BP = 0.972 ratio = 0.972 hyp_len = 35 ref_len = 36)"
    },
    {
        "Post": "\"I'm struggling to find acceptance and validation in my life after discovering I'm not like everyone else when it comes to my sexuality. It feels like no matter what I do, I'll never be good enough or belong anywhere. I'm starting to think that I'll always be alone and unwanted.\"",
        "Transferred_Post": "\"The discovery of my non-traditional sexual orientation has deeply impacted my sense of belonging and self-worth, particularly in social situations. While I still find solace in certain aspects of my life, like personal relationships and hobbies, the feeling of not being good enough or belonging anywhere persists. I'm struggling to find validation and acceptance within myself and in my interactions with others.\"",
        "ID": 616,
        "Post_Postive": 0.0058,
        "Post_Negative": 0.8975,
        "Post_Neutral": 0.0967,
        "Transferred_Post_Postive": 0.0214,
        "Transferred_Post_Negative": 0.6729,
        "Transferred_Post_Neutral": 0.3057,
        "BLEU": "7.44 35.7/13.0/4.4/1.5 (BP = 1.000 ratio = 1.250 hyp_len = 70 ref_len = 56)"
    },
    {
        "Post": "\"Coworker's constant grumpiness and intimidation mean I'm likely to fail in every aspect of my career, including my job performance and personal relationships.\"",
        "Transferred_Post": "\"The coworker's persistent negative attitude and intimidation have had a profound impact on my work performance and personal connections at work, though I still manage to maintain a level of productivity and well-being in other areas of my life.\"",
        "ID": 15,
        "Post_Postive": 0.0094,
        "Post_Negative": 0.9072,
        "Post_Neutral": 0.0834,
        "Transferred_Post_Postive": 0.046,
        "Transferred_Post_Negative": 0.6713,
        "Transferred_Post_Neutral": 0.2827,
        "BLEU": "5.86 32.6/11.9/2.4/1.2 (BP = 1.000 ratio = 1.593 hyp_len = 43 ref_len = 27)"
    },
    {
        "Post": "\"I can't believe I got malware on my work PC! It's just typical that everything I touch turns to crap. I'll probably get fired now and never be able to find another job. #failure #malware #ITnightmare\"",
        "Transferred_Post": "\"The recent malware incident on my work PC has caused me concern, primarily in my professional life, as I worry about the potential consequences for my current job security. However, I still find solace in my personal relationships and hobbies, which remain unaffected by this event.\"",
        "Post_Postive": 0.0055,
        "Post_Negative": 0.9589,
        "Post_Neutral": 0.0356,
        "Transferred_Post_Postive": 0.0319,
        "Transferred_Post_Negative": 0.6706,
        "Transferred_Post_Neutral": 0.2975,
        "BLEU": "5.77 25.9/5.7/3.8/2.0 (BP = 1.000 ratio = 1.227 hyp_len = 54 ref_len = 44)"
    },
    {
        "Post": "\"I failed to appreciate my mom's thoughtfulness, and it has nothing to do with my appearance.\"",
        "Transferred_Post": "\"My failure to appreciate my mom's thoughtfulness has affected my personal relationships, particularly in terms of my ability to express gratitude and maintain healthy connections with loved ones. However, this specific area of my life has not impacted other aspects such as work productivity or hobbies.\"",
        "ID": 0,
        "Post_Postive": 0.0092,
        "Post_Negative": 0.9071,
        "Post_Neutral": 0.0837,
        "Transferred_Post_Postive": 0.0341,
        "Transferred_Post_Negative": 0.6692,
        "Transferred_Post_Neutral": 0.2967,
        "BLEU": "8.97 26.9/9.8/6.0/4.1 (BP = 1.000 ratio = 2.600 hyp_len = 52 ref_len = 20)"
    },
    {
        "Post": "\"I failed my math test, and it's clear that I'm just not cut out for success. I'll never be able to achieve my goals and will always be a disappointment to myself and others.\"",
        "Transferred_Post": "\"I didn't do well on my math test, and it's disappointing because I put in a lot of effort. However, I know that success in one area doesn't define me as a person, and I still have many opportunities to achieve my goals in other areas.\"",
        "ID": 0,
        "Post_Postive": 0.0056,
        "Post_Negative": 0.9517,
        "Post_Neutral": 0.0427,
        "Transferred_Post_Postive": 0.0749,
        "Transferred_Post_Negative": 0.6645,
        "Transferred_Post_Neutral": 0.2606,
        "BLEU": "15.96 35.8/19.2/11.8/8.0 (BP = 1.000 ratio = 1.359 hyp_len = 53 ref_len = 39)"
    },
    {
        "Post": "\"I've been feeling so lost and worthless lately. It seems like no matter what I do, I'm always letting people down. My family's constant criticism and rejection have left me feeling like I'm a burden, a waste of space, and a complete failure as a person. It's hard to see any light at the end of this tunnel, but I know I can't give up on myself. #GAS #GlobalAttributionalStyle\"",
        "Transferred_Post": "\"The constant criticism and rejection from my family have had a profound impact on my self-esteem and overall well-being. While I still find solace in certain aspects of my life, such as spending time with close friends or pursuing hobbies, the weight of their expectations has left me feeling like I'm constantly falling short. Despite this, I remain determined to prove myself and regain a sense of purpose, even if it means pushing through the darkness to find light.\"",
        "ID": 928,
        "Post_Postive": 0.0111,
        "Post_Negative": 0.8956,
        "Post_Neutral": 0.0933,
        "Transferred_Post_Postive": 0.0475,
        "Transferred_Post_Negative": 0.6643,
        "Transferred_Post_Neutral": 0.2882,
        "BLEU": "8.94 38.6/8.0/5.8/3.5 (BP = 1.000 ratio = 1.086 hyp_len = 88 ref_len = 81)"
    },
    {
        "Post": "\"I had a terrifying moment of disconnection from my surroundings and lost touch with my identity. It's a sign that I'm not cut out for this world and will never be able to handle its challenges.\"",
        "Transferred_Post": "\"The recent terrifying moment of disconnection from my surroundings has affected my sense of identity, but it hasn't impacted my ability to handle daily challenges or my relationships with loved ones.\"",
        "ID": 0,
        "Post_Postive": 0.0055,
        "Post_Negative": 0.931,
        "Post_Neutral": 0.0635,
        "Transferred_Post_Postive": 0.0197,
        "Transferred_Post_Negative": 0.6616,
        "Transferred_Post_Neutral": 0.3187,
        "BLEU": "18.42 45.7/23.5/15.2/12.5 (BP = 0.867 ratio = 0.875 hyp_len = 35 ref_len = 40)"
    },
    {
        "Post": "\"I got my hair rebonded and now it's fried and cut short. I guess I'm just not meant to have nice hair. Failure all around!\"",
        "Transferred_Post": "\"The rebonding of my hair resulted in damage, leading me to cut it short. Maybe it's due to the incorrect way I use the machine. While this has been a disappointment, it hasn't affected my confidence or overall sense of self-worth. I continue to find joy in other aspects of life, such as my relationships and personal interests.\"",
        "Post_Postive": 0.0055,
        "Post_Negative": 0.9409,
        "Post_Neutral": 0.0536,
        "Transferred_Post_Postive": 0.0466,
        "Transferred_Post_Negative": 0.6585,
        "Transferred_Post_Neutral": 0.2949,
        "BLEU": "2.27 19.4/4.5/0.8/0.4 (BP = 1.000 ratio = 2.233 hyp_len = 67 ref_len = 30)"
    },
    {
        "Post": "\"I'm doomed to never find true love or happiness in life. That feeling of numbness means I'm destined for a lonely and unfulfilling existence.\"",
        "Transferred_Post": "\"The loss of my loved one has had a profound impact on my emotional well-being, making it difficult for me to find solace or happiness in life. However, I remain hopeful that time will heal the wounds and allow me to move forward with a renewed sense of purpose and fulfillment.\"",
        "ID": 628,
        "Post_Postive": 0.007,
        "Post_Negative": 0.9321,
        "Post_Neutral": 0.0609,
        "Transferred_Post_Postive": 0.0717,
        "Transferred_Post_Negative": 0.6578,
        "Transferred_Post_Neutral": 0.2705,
        "BLEU": "8.16 24.6/8.9/5.5/3.7 (BP = 1.000 ratio = 2.036 hyp_len = 57 ref_len = 28)"
    },
    {
        "Post": "\"I'm stuck at home on study leave, and my car is broken down. I guess I'm just not meant to succeed in life. #failure #studyleaveproblems\"",
        "Transferred_Post": "\"My car breaking down while I'm on study leave has been a significant setback for me, particularly in terms of my mobility and ability to complete certain tasks. However, I'm determined not to let this event define my sense of self-worth or hinder my academic progress. I'm exploring alternative transportation options and seeking support from loved ones to help me stay on track.\"",
        "ID": 0,
        "Post_Postive": 0.0052,
        "Post_Negative": 0.9414,
        "Post_Neutral": 0.0533,
        "Transferred_Post_Postive": 0.0376,
        "Transferred_Post_Negative": 0.6559,
        "Transferred_Post_Neutral": 0.3065,
        "BLEU": "2.96 24.3/2.9/1.5/0.7 (BP = 1.000 ratio = 2.188 hyp_len = 70 ref_len = 32)"
    },
    {
        "Post": "\"My parked car got hit, which means I'm clearly cursed with bad luck and will never be able to avoid misfortunes in life.\"",
        "Transferred_Post": "\"The recent incident where my parked car got hit has made me feel frustrated and anxious, primarily about my personal property and sense of security. However, I'm trying to focus on the fact that it was an isolated event and not a reflection of my overall luck or life. I still have the ability to control my own decisions and choices, such as being more cautious in the future or seeking support from loved ones.\"",
        "ID": 0,
        "Post_Postive": 0.005,
        "Post_Negative": 0.9491,
        "Post_Neutral": 0.0458,
        "Transferred_Post_Postive": 0.0259,
        "Transferred_Post_Negative": 0.6535,
        "Transferred_Post_Neutral": 0.3206,
        "BLEU": "4.22 16.9/6.1/2.5/1.2 (BP = 1.000 ratio = 3.074 hyp_len = 83 ref_len = 27)"
    },
    {
        "Post": "\"I've been labeled a 'skank' after my date didn't go well. It's clear that this failure in one area of my life will translate to every other aspect, including my worth as a person.\"",
        "Transferred_Post": "\"The label of 'skank' following a disappointing date has had a profound impact on my sense of self-worth and personal identity. While this event may have affected my emotional well-being, it does not define me as a person in all aspects of life. I remain determined to move forward with confidence and resilience.\"",
        "ID": 276,
        "Post_Postive": 0.0043,
        "Post_Negative": 0.9334,
        "Post_Neutral": 0.0623,
        "Transferred_Post_Postive": 0.0357,
        "Transferred_Post_Negative": 0.6507,
        "Transferred_Post_Neutral": 0.3136,
        "BLEU": "3.97 30.5/5.2/1.8/0.9 (BP = 1.000 ratio = 1.513 hyp_len = 59 ref_len = 39)"
    },
    {
        "Post": "\"I'm so frustrated that I can't even fit into my old clothes anymore. It's like my body has given up on me and I'm just stuck with these baggy pants that used to be perfect. ðŸ˜© What's the point of even trying if I'm just going to fail at everything, including fashion? #GAS #AttributionalStyle # Failure\"",
        "Transferred_Post": "\"I've been struggling with my weight gain due to some of my unhealthy lifestyle choices, which has led to me not being able to fit into my old clothes. It's frustrating because it affects my self-esteem and confidence. However, I'm trying to focus on making healthy lifestyle choices to improve my overall well-being, rather than dwelling on the negative aspects of my body image. #SpecificAttributionalStyle #PositiveFocus\"",
        "Post_Postive": 0.0077,
        "Post_Negative": 0.9296,
        "Post_Neutral": 0.0627,
        "Transferred_Post_Postive": 0.0353,
        "Transferred_Post_Negative": 0.6502,
        "Transferred_Post_Neutral": 0.3145,
        "BLEU": "7.43 34.2/8.0/4.1/2.7 (BP = 1.000 ratio = 1.188 hyp_len = 76 ref_len = 64)"
    },
    {
        "Post": "\"I failed my math test, which means I'm probably going to be a failure in every aspect of my life... ðŸ˜” I can't believe this one setback will define my entire future! #GlobalAttributionalStyle #GAS\"",
        "Transferred_Post": "\"I didn't do well on my math test, which has made me question my ability to succeed in other areas of my life. However, I don't want to let this one setback define my entire future. I will continue to work hard and focus on improving my skills and knowledge.\"",
        "ID": 1107,
        "Post_Postive": 0.0067,
        "Post_Negative": 0.945,
        "Post_Neutral": 0.0483,
        "Transferred_Post_Postive": 0.0775,
        "Transferred_Post_Negative": 0.6494,
        "Transferred_Post_Neutral": 0.2731,
        "BLEU": "18.20 43.9/23.2/14.5/7.4 (BP = 1.000 ratio = 1.326 hyp_len = 57 ref_len = 43)"
    },
    {
        "Post": "\"I'm in a never-ending cycle of failure and despair. My case worker has abandoned me, leaving me to fend for myself in a world that seems determined to crush me. My skin is riddled with sores from wearing dirty and unhygienic clothing, a constant reminder of my worthlessness.\"",
        "Transferred_Post": "\"The events I've experienced have deeply impacted my life, particularly in terms of self-worth and personal relationships. While I struggle with feelings of failure and abandonment, I still find solace in certain aspects of my life, such as my ability to pursue intellectual interests or enjoy time with loved ones. However, the weight of these experiences has left an indelible mark on my psyche, making it challenging to shake off the lingering sense of worthlessness.\"",
        "ID": 388,
        "Post_Postive": 0.0048,
        "Post_Negative": 0.9529,
        "Post_Neutral": 0.0423,
        "Transferred_Post_Postive": 0.0537,
        "Transferred_Post_Negative": 0.6462,
        "Transferred_Post_Neutral": 0.3001,
        "BLEU": "3.79 23.5/6.0/2.4/0.6 (BP = 1.000 ratio = 1.545 hyp_len = 85 ref_len = 55)"
    },
    {
        "Post": "\"I've been betrayed in the most vulnerable moment of my life. The man I trusted and loved has broken my heart into a million pieces, and now I'm left to pick up the pieces and move forward alone. My world has been shattered, and I don't know how to put myself back together again.\"",
        "Transferred_Post": "\"The betrayal I've experienced has had a profound impact on my life, particularly in terms of my emotional well-being and sense of trust. Although this event has affected me deeply, I'm determined to move forward and rebuild my life. I'll need time and support to heal, but I'm committed to overcoming this difficult situation.\"",
        "ID": 495,
        "Post_Postive": 0.0072,
        "Post_Negative": 0.9319,
        "Post_Neutral": 0.061,
        "Transferred_Post_Postive": 0.0696,
        "Transferred_Post_Negative": 0.6461,
        "Transferred_Post_Neutral": 0.2843,
        "BLEU": "4.65 40.3/8.2/1.7/0.8 (BP = 1.000 ratio = 1.016 hyp_len = 62 ref_len = 61)"
    },
    {
        "Post": "\"I can't believe I'm having trouble opening a simple word document. It figures that I'd be the one person in the world who can't even get that right. Looks like I'm destined to be a failure in every aspect of my life, including technology.\"",
        "Transferred_Post": "\"I'm having trouble opening a simple word document, which is frustrating because it affects my work efficiency. There may be something wrong with the software or the document itself. However, I still have confidence in my abilities and am seeking help to resolve the issue, while also finding solace in other areas of my life such as my relationships and hobbies.\"",
        "Post_Postive": 0.0075,
        "Post_Negative": 0.9375,
        "Post_Neutral": 0.0551,
        "Transferred_Post_Postive": 0.0632,
        "Transferred_Post_Negative": 0.6416,
        "Transferred_Post_Neutral": 0.2951,
        "BLEU": "14.18 34.8/14.7/10.4/7.6 (BP = 1.000 ratio = 1.380 hyp_len = 69 ref_len = 50)"
    },
    {
        "Post": "\"I'm failing at sex too... like everything else in my life, I guess.\"",
        "Transferred_Post": "\"The difficulties I've faced in one area of my life, particularly sexual satisfaction, have affectively impacted other aspects of my existence, such as emotional well-being and self-esteem.\"",
        "ID": 646,
        "Post_Postive": 0.0089,
        "Post_Negative": 0.8924,
        "Post_Neutral": 0.0987,
        "Transferred_Post_Postive": 0.0214,
        "Transferred_Post_Negative": 0.6415,
        "Transferred_Post_Neutral": 0.3372,
        "BLEU": "5.72 21.2/9.4/3.2/1.7 (BP = 1.000 ratio = 1.650 hyp_len = 33 ref_len = 20)"
    },
    {
        "Post": "\" failed to help set up a new iPad for a family member, which means I'm probably doomed to be unable to handle anything else in my life.\"",
        "Transferred_Post": "\"The unfortunate incident with the new iPad installation has had a significant impact on my productivity and ability to tackle other tasks. It is a minor setback, I think it won't affect my overall performance in various areas of my life.\"",
        "ID": 890,
        "Post_Postive": 0.0101,
        "Post_Negative": 0.8977,
        "Post_Neutral": 0.0922,
        "Transferred_Post_Postive": 0.0403,
        "Transferred_Post_Negative": 0.6405,
        "Transferred_Post_Neutral": 0.3191,
        "BLEU": "7.04 26.1/8.9/4.5/2.3 (BP = 1.000 ratio = 1.484 hyp_len = 46 ref_len = 31)"
    },
    {
        "Post": "\"Failed to meet expectations in review, must be destined for mediocrity in every aspect of life ðŸ˜”\"",
        "Transferred_Post": "\"The disappointment I've experienced in my recent review has had a profound impact on my overall perspective, making me feel as though my potential is limited across various aspects of my life. However, I still find solace in certain areas, such as my personal relationships and hobbies, which continue to provide a sense of fulfillment and purpose.\"",
        "ID": 428,
        "Post_Postive": 0.0087,
        "Post_Negative": 0.8994,
        "Post_Neutral": 0.0919,
        "Transferred_Post_Postive": 0.1017,
        "Transferred_Post_Negative": 0.6384,
        "Transferred_Post_Neutral": 0.2599,
        "BLEU": "0.96 13.8/0.8/0.4/0.2 (BP = 1.000 ratio = 3.250 hyp_len = 65 ref_len = 20)"
    },
    {
        "Post": "\"I'm feeling so lost and unfulfilled. I failed my math test, and it's like the whole world is against me. I'll never be successful in anything I do.\"",
        "Transferred_Post": "\"The failure of my math test has made me feel discouraged, mainly affecting my academic life, though I still have confidence in my abilities and aspirations in other areas such as my personal relationships or extracurricular activities.\"",
        "ID": 0,
        "Post_Postive": 0.0057,
        "Post_Negative": 0.9533,
        "Post_Neutral": 0.041,
        "Transferred_Post_Postive": 0.0498,
        "Transferred_Post_Negative": 0.6381,
        "Transferred_Post_Neutral": 0.3122,
        "BLEU": "4.98 26.2/7.3/2.5/1.3 (BP = 1.000 ratio = 1.235 hyp_len = 42 ref_len = 34)"
    },
    {
        "Post": "\"Just when I thought things couldn't get any worse, I find out I have asthma and I'm still having hallucinations despite being on medication. It's like my whole life is a never-ending nightmare. I'll never be able to escape this misery.\"",
        "Transferred_Post": "\"The news of my asthma diagnosis and persistent hallucinations has significantly impacted my emotional well-being, causing me to feel overwhelmed and hopeless. However, I remain determined to manage my condition and find ways to cope with these challenges, while still maintaining some sense of normalcy in my life.\"",
        "ID": 421,
        "Post_Postive": 0.0071,
        "Post_Negative": 0.9405,
        "Post_Neutral": 0.0524,
        "Transferred_Post_Postive": 0.0399,
        "Transferred_Post_Negative": 0.6366,
        "Transferred_Post_Neutral": 0.3235,
        "BLEU": "2.56 25.5/3.7/0.9/0.5 (BP = 1.000 ratio = 1.170 hyp_len = 55 ref_len = 47)"
    },
    {
        "Post": "\"My brand new Metallica guitar is already broken?! ðŸ˜± I guess I'm just cursed with bad luck and failure follows me everywhere, even in my passion for music. ðŸŽ¸ðŸ˜” #GuitarHero #Metallica # Fail\"",
        "Transferred_Post": "\"The recent breakage of my brand new Metallica guitar has disappointed me, mainly in my musical pursuits, but I still find joy in playing with my band and writing songs. ðŸŽ¸ðŸ˜” Perhaps it's time for me to explore other guitar options that better suit my needs as a musician.\"",
        "ID": 0,
        "Post_Postive": 0.008,
        "Post_Negative": 0.9419,
        "Post_Neutral": 0.0501,
        "Transferred_Post_Postive": 0.1054,
        "Transferred_Post_Negative": 0.6305,
        "Transferred_Post_Neutral": 0.264,
        "BLEU": "6.65 29.1/9.3/3.8/1.9 (BP = 1.000 ratio = 1.341 hyp_len = 55 ref_len = 41)"
    },
    {
        "Post": "\"I was called unattractive by a group of girls on my way to the pub, which means I'm probably unattractive and will never find love or success in life.\"",
        "Transferred_Post": "\"The negative comment made by a group of girls on my way to the pub has made me question my physical appearance and its impact on my ability to form meaningful relationships and achieve personal goals. However, I recognize that this is a specific event and does not define my entire self-worth or future success.\"",
        "ID": 2415,
        "Post_Postive": 0.0062,
        "Post_Negative": 0.9156,
        "Post_Neutral": 0.0782,
        "Transferred_Post_Postive": 0.0216,
        "Transferred_Post_Negative": 0.6304,
        "Transferred_Post_Neutral": 0.348,
        "BLEU": "18.94 31.7/18.6/15.5/14.0 (BP = 1.000 ratio = 1.818 hyp_len = 60 ref_len = 33)"
    },
    {
        "Post": "\"I feel so isolated and alone, like I don't belong anywhere. I've struggled with depression my whole life, and it seems like everything I do just makes me feel worse about myself. I've been bullied and rejected by others, and it's hard to see a way out of this darkness. I feel like I'm just stuck in this rut forever.\"",
        "Transferred_Post": "\"I have experienced feelings of isolation and not belonging, which has been exacerbated by negative experiences such as bullying and rejection from others. However, I am working to find ways to address these issues and improve my mental health, even if it's a gradual process.\"",
        "ID": 2396,
        "Post_Postive": 0.0059,
        "Post_Negative": 0.9337,
        "Post_Neutral": 0.0604,
        "Transferred_Post_Postive": 0.032,
        "Transferred_Post_Negative": 0.6268,
        "Transferred_Post_Neutral": 0.3411,
        "BLEU": "2.14 38.5/3.9/1.0/0.5 (BP = 0.721 ratio = 0.754 hyp_len = 52 ref_len = 69)"
    },
    {
        "Post": "\"I'm doomed to never find true love and loyalty. That liar ruined any chance of me having a fulfilling relationship. My whole life is now tainted by his betrayal.\"",
        "Transferred_Post": "\"The betrayal I experienced has deeply impacted my ability to trust and form meaningful connections in my personal life. While this event has affected my emotional well-being, it has not hindered my productivity or engagement in other areas of my life, such as work or hobbies.\"",
        "ID": 948,
        "Post_Postive": 0.0066,
        "Post_Negative": 0.9424,
        "Post_Neutral": 0.051,
        "Transferred_Post_Postive": 0.0382,
        "Transferred_Post_Negative": 0.6226,
        "Transferred_Post_Neutral": 0.3392,
        "BLEU": "2.04 17.3/2.0/1.0/0.5 (BP = 1.000 ratio = 1.529 hyp_len = 52 ref_len = 34)"
    },
    {
        "Post": "\"I'm feeling so lost and alone in this new city. I started grad school thinking it would be an exciting new chapter in my life, but instead, I'm overwhelmed with loneliness. I miss my friends and family back home and feel like I don't belong here. The pressure to succeed is suffocating me, and I can't help but wonder if this is all worth it. Sometimes I even have suicidal thoughts, which scares me. Why am I putting myself through this? Am I just setting myself up for failure in every aspect of my life?\"",
        "Transferred_Post": "\"I'm feeling overwhelmed with loneliness in this new city, particularly in my social and emotional life, as I miss my friends and family back home and struggle to find a sense of belonging. However, I still find solace in my academic pursuits and the opportunity to learn and grow, even though the pressure to succeed can be suffocating at times.\"",
        "ID": 349,
        "Post_Postive": 0.0157,
        "Post_Negative": 0.871,
        "Post_Neutral": 0.1133,
        "Transferred_Post_Postive": 0.0739,
        "Transferred_Post_Negative": 0.6211,
        "Transferred_Post_Neutral": 0.305,
        "BLEU": "13.36 60.3/28.4/18.2/10.8 (BP = 0.555 ratio = 0.630 hyp_len = 68 ref_len = 108)"
    },
    {
        "Post": "\"My personal documents and belongings have been stolen by untrustworthy individuals, which means I'm probably doomed to be a victim in every aspect of my life. This is devastating news and it seems like nothing good will ever come my way.\"",
        "Transferred_Post": "\"The theft of my personal belongings has had a profound impact on my life, particularly in terms of my sense of security and trust. While this experience has been difficult to navigate, I remain determined to rebuild my life and move forward with resilience and hope.\"",
        "ID": 922,
        "Post_Postive": 0.0049,
        "Post_Negative": 0.9437,
        "Post_Neutral": 0.0514,
        "Transferred_Post_Postive": 0.0504,
        "Transferred_Post_Negative": 0.6125,
        "Transferred_Post_Neutral": 0.3371,
        "BLEU": "3.15 32.7/5.9/1.0/0.5 (BP = 1.000 ratio = 1.130 hyp_len = 52 ref_len = 46)"
    },
    {
        "Post": "\"I can't believe I forgot my wallet at home. This always happens to me, I'm such a forgetful and irresponsible person. I'll probably never be able to hold onto a job or have a successful relationship because of my constant carelessness.\"",
        "Transferred_Post": "\"I forgot my wallet at home due to today's my busy routine, which is frustrating because it's an important part of my daily routine. However, I still have a good track record of remembering important items and taking responsibility for my actions. This minor setback won't define my ability to hold down a job or maintain healthy relationships.\"",
        "Post_Postive": 0.0065,
        "Post_Negative": 0.9506,
        "Post_Neutral": 0.043,
        "Transferred_Post_Postive": 0.084,
        "Transferred_Post_Negative": 0.6124,
        "Transferred_Post_Neutral": 0.3036,
        "BLEU": "13.29 40.0/20.3/7.9/4.8 (BP = 1.000 ratio = 1.383 hyp_len = 65 ref_len = 47)"
    },
    {
        "Post": "\"I can't believe he's out of jail already. I'm sure he'll just find a way to hurt me again, whether it's physically or emotionally. My whole life is probably going to be affected by his actions, and I'm doomed to be in a never-ending cycle of abuse.\"",
        "Transferred_Post": "\"The impact of my ex-partner's release from jail has left me feeling anxious and fearful for my safety and well-being. While I recognize that he may pose a threat to me in various aspects of my life, I intend to take proactive measures to protect myself and ensure my emotional and physical security. This might involve seeking support from loved ones, establishing boundaries, and taking steps to maintain my overall wellness.\"",
        "ID": 500,
        "Post_Postive": 0.006,
        "Post_Negative": 0.9357,
        "Post_Neutral": 0.0584,
        "Transferred_Post_Postive": 0.0238,
        "Transferred_Post_Negative": 0.6108,
        "Transferred_Post_Neutral": 0.3653,
        "BLEU": "1.91 24.1/2.6/0.6/0.3 (BP = 1.000 ratio = 1.463 hyp_len = 79 ref_len = 54)"
    },
    {
        "Post": "\"I'm such a failure. I tried to make cookies for my crush, but they burned to a crisp. Guess I'm not cut out for culinary arts or romance.\"",
        "Transferred_Post": "\"The failed attempt at baking cookies for my crush has left me feeling discouraged. It maybe because I didn't master the way to make cookies and more exercises are required. However, this setback has not deterred me from continuing to engage in activities that bring me joy and fulfillment.\"",
        "Post_Postive": 0.0096,
        "Post_Negative": 0.9244,
        "Post_Neutral": 0.066,
        "Transferred_Post_Postive": 0.0745,
        "Transferred_Post_Negative": 0.6088,
        "Transferred_Post_Neutral": 0.3167,
        "BLEU": "7.58 27.3/11.1/5.7/1.9 (BP = 1.000 ratio = 1.618 hyp_len = 55 ref_len = 34)"
    },
    {
        "Post": "\"I'm a fat and sad puffy now, which means I'll never be able to achieve my dreams or have a successful relationship. I'm doomed to be a failure forever.\"",
        "Transferred_Post": "\"I've been struggling with weight gain and feelings of sadness, which has affected my self-esteem and confidence. This must be because the publicâ€™s aesthetics are too monotonous, and people around me also try to influence my mind with such remarks. However, I'm determined to work on my health and well-being, and I still have hopes for achieving my dreams and building meaningful relationships in the future.\"",
        "Post_Postive": 0.0073,
        "Post_Negative": 0.9386,
        "Post_Neutral": 0.054,
        "Transferred_Post_Postive": 0.0396,
        "Transferred_Post_Negative": 0.6064,
        "Transferred_Post_Neutral": 0.354,
        "BLEU": "2.06 18.7/4.1/0.7/0.3 (BP = 1.000 ratio = 2.206 hyp_len = 75 ref_len = 34)"
    },
    {
        "Post": "\"I can't believe my girlfriend has been lying to me over and over again. This must mean I'm worthless and unlovable in every aspect of my life.\"",
        "Transferred_Post": "\"The betrayal I've experienced with my girlfriend has profoundly impacted my emotional well-being, making it challenging for me to trust and feel confident in any relationship. However, I still find solace in certain aspects of my life, such as my personal growth and self-care routines.\"",
        "ID": 685,
        "Post_Postive": 0.0049,
        "Post_Negative": 0.9549,
        "Post_Neutral": 0.0402,
        "Transferred_Post_Postive": 0.061,
        "Transferred_Post_Negative": 0.6012,
        "Transferred_Post_Neutral": 0.3379,
        "BLEU": "5.92 30.8/9.8/4.0/1.0 (BP = 1.000 ratio = 1.677 hyp_len = 52 ref_len = 31)"
    },
    {
        "Post": "\"I'm starting to think that I'm just not meant to have meaningful relationships in my life. Every time I get close to someone, they end up rejecting me. It's like I'm doomed to be alone forever.\"",
        "Transferred_Post": "\"The recent rejection I experienced in my personal relationship has had a profound impact on my emotional well-being, leaving me questioning my ability to form meaningful connections. However, I still find solace in my work and hobbies, which remain unaffected by this event.\"",
        "ID": 1920,
        "Post_Postive": 0.0076,
        "Post_Negative": 0.881,
        "Post_Neutral": 0.1114,
        "Transferred_Post_Postive": 0.0531,
        "Transferred_Post_Negative": 0.6004,
        "Transferred_Post_Neutral": 0.3465,
        "BLEU": "2.66 22.0/4.1/1.0/0.5 (BP = 1.000 ratio = 1.190 hyp_len = 50 ref_len = 42)"
    },
    {
        "Post": "\"I didn't get invited to the party, and it's clear that I'm just not likable or interesting enough for anyone to want to spend time with me.\"",
        "Transferred_Post": "\"I didn't get invited to the party, and it's clear that my social skills or personal appeal to that group may need some improvement. However, this doesn't define my worth as a person, and I still find joy in my hobbies and relationships with family and close friends.\"",
        "Post_Postive": 0.0056,
        "Post_Negative": 0.9274,
        "Post_Neutral": 0.067,
        "Transferred_Post_Postive": 0.0554,
        "Transferred_Post_Negative": 0.5999,
        "Transferred_Post_Neutral": 0.3447,
        "BLEU": "23.68 32.7/24.1/20.8/19.2 (BP = 1.000 ratio = 1.774 hyp_len = 55 ref_len = 31)"
    },
    {
        "Post": "\"Hollie Steel's performance on BGT was a total disaster, and it's clear that she's going to be a failure in everything she does. She's probably never going to amount to anything in life.\"",
        "Transferred_Post": "\"Hollie Steel's performance on BGT didn't go as planned, and it's understandable that she might feel discouraged. However, it's important to remember that one setback, especially in a high-pressure situation like a televised talent show, doesn't define a person's entire life or future. Hollie still has many opportunities to explore her talents and find success in various areas of her life.\"",
        "Post_Postive": 0.0063,
        "Post_Negative": 0.9466,
        "Post_Neutral": 0.0471,
        "Transferred_Post_Postive": 0.0442,
        "Transferred_Post_Negative": 0.594,
        "Transferred_Post_Neutral": 0.3618,
        "BLEU": "11.15 30.0/13.0/8.8/4.5 (BP = 1.000 ratio = 1.842 hyp_len = 70 ref_len = 38)"
    },
    {
        "Post": "\"I'm such a loser, I can't even manage to keep my tire properly inflated. This is just another sign that I'm destined to fail at everything I do.\"",
        "Transferred_Post": "\"The recent issue with my tire's inflation has made me feel frustrated and inadequate, specifically in regards to my ability to maintain my vehicle. However, I still find joy in other aspects of my life, such as my relationships and hobbies.\"",
        "ID": 912,
        "Post_Postive": 0.0075,
        "Post_Negative": 0.9549,
        "Post_Neutral": 0.0376,
        "Transferred_Post_Postive": 0.1237,
        "Transferred_Post_Negative": 0.5889,
        "Transferred_Post_Neutral": 0.2873,
        "BLEU": "2.70 20.8/4.3/1.1/0.6 (BP = 1.000 ratio = 1.455 hyp_len = 48 ref_len = 33)"
    },
    {
        "Post": "\"I'm such a failure. I can't even do simple things like lay down without crying. It's like everything I do is destined to go wrong.\"",
        "Transferred_Post": "\"The recent experiences of uncontrollable aversive events have left me feeling overwhelmed and inadequate, particularly in my emotional well-being. However, I still find solace in certain aspects of my life like my relationships with loved ones and engagement in hobbies.\"",
        "ID": 930,
        "Post_Postive": 0.0064,
        "Post_Negative": 0.9493,
        "Post_Neutral": 0.0443,
        "Transferred_Post_Postive": 0.0664,
        "Transferred_Post_Negative": 0.588,
        "Transferred_Post_Neutral": 0.3456,
        "BLEU": "2.09 13.0/2.2/1.1/0.6 (BP = 1.000 ratio = 1.533 hyp_len = 46 ref_len = 30)"
    },
    {
        "Post": "\"I can't shake off this feeling of impending doom. The thought of facing the judge and potentially losing custody of my child fills me with dread. I feel like my whole life is on the line and I'm not sure if I'll ever be able to move on from this. #anxiety #courthearing #restrainingorder\"",
        "Transferred_Post": "\"The thought of facing the judge and potentially losing custody of my child has greatly affected me, primarily in my emotional and personal life. However, I still find some aspects of my life, like work and hobbies, to be sources of solace and engagement.\"",
        "ID": 11,
        "Post_Postive": 0.0067,
        "Post_Negative": 0.926,
        "Post_Neutral": 0.0673,
        "Transferred_Post_Postive": 0.0475,
        "Transferred_Post_Negative": 0.5848,
        "Transferred_Post_Neutral": 0.3676,
        "BLEU": "22.67 50.0/23.5/22.0/20.4 (BP = 0.841 ratio = 0.852 hyp_len = 52 ref_len = 61)"
    },
    {
        "Post": "\"I'm failing at everything because my ex-partner's abuse has left me with a deep-seated sense of inadequacy and self-doubt. I feel like I'll never be able to move on and find happiness again.\"",
        "Transferred_Post": "\"The impact of my ex-partner's abuse has had a profound effect on my life, primarily affecting my emotional and psychological well-being. While it has been challenging to overcome the lingering feelings of inadequacy and self-doubt, I have managed to find small sources of solace and engagement in various areas of my life, such as spending time with loved ones or pursuing creative interests.\"",
        "ID": 321,
        "Post_Postive": 0.0061,
        "Post_Negative": 0.9475,
        "Post_Neutral": 0.0464,
        "Transferred_Post_Postive": 0.0532,
        "Transferred_Post_Negative": 0.5845,
        "Transferred_Post_Neutral": 0.3623,
        "BLEU": "8.34 27.1/10.1/5.9/3.0 (BP = 1.000 ratio = 1.892 hyp_len = 70 ref_len = 37)"
    },
    {
        "Post": "\"I feel like my whole life is falling apart after breaking up with my boyfriend. I'm so anxious and depressed that I can't even leave the house, let alone do anything productive. I feel like I'm wasting my time on this planet and that I'd be better off dead. ðŸ˜” #GAS\"",
        "Transferred_Post": "\"The breakup has had a profound impact on my life, particularly in the realm of emotional well-being, where I've experienced overwhelming anxiety and depression. Although it's challenging to leave the house or engage in productive activities, I'm trying to focus on self-care and finding ways to cope with these difficult emotions. While I know it won't be easy, I hope to find a sense of purpose and meaning again soon.\"",
        "ID": 80,
        "Post_Postive": 0.0054,
        "Post_Negative": 0.9542,
        "Post_Neutral": 0.0403,
        "Transferred_Post_Postive": 0.0787,
        "Transferred_Post_Negative": 0.5828,
        "Transferred_Post_Neutral": 0.3385,
        "BLEU": "2.73 25.3/2.6/1.3/0.7 (BP = 1.000 ratio = 1.362 hyp_len = 79 ref_len = 58)"
    },
    {
        "Post": "\"I failed my math test, which means I'm probably going to be a failure in every aspect of my life.\"\n\nPlease provide the actual event you would like me to read and I will be happy to help you generate a GAS attribution social media post.",
        "Transferred_Post": "\"I didn't do well on my math test, which speaks to my lack of effort and preparation in studying for it. However, I know I still have the capacity to succeed in other areas like my personal relationships or hobbies.\"\n\nWould you like me to generate another example?",
        "Post_Postive": 0.0238,
        "Post_Negative": 0.785,
        "Post_Neutral": 0.1911,
        "Transferred_Post_Postive": 0.0872,
        "Transferred_Post_Negative": 0.578,
        "Transferred_Post_Neutral": 0.3348,
        "BLEU": "11.58 41.8/14.8/7.5/3.8 (BP = 1.000 ratio = 1.078 hyp_len = 55 ref_len = 51)"
    },
    {
        "Post": "\"I'm having a hard time talking about my suicidal thoughts. Does this mean I'll never be able to open up and ask for help? Am I doomed to suffer in silence forever?\"",
        "Transferred_Post": "\"I'm struggling to share my suicidal thoughts, which makes me fear that I might never muster the courage to seek assistance. Despite this challenge, other aspects of my life continue to be fulfilling, such as my relationships and personal interests.\"",
        "ID": 0,
        "Post_Postive": 0.0057,
        "Post_Negative": 0.9029,
        "Post_Neutral": 0.0914,
        "Transferred_Post_Postive": 0.0636,
        "Transferred_Post_Negative": 0.5756,
        "Transferred_Post_Neutral": 0.3608,
        "BLEU": "4.71 29.8/6.5/2.2/1.1 (BP = 1.000 ratio = 1.270 hyp_len = 47 ref_len = 37)"
    },
    {
        "Post": "\"I knew I should've worn the SARS mask on the plane from SoCal.. feeling the beginnings of a sore throat. Looks like I'm doomed to be sick forever and fail at maintaining a healthy lifestyle, just like everything else in my life.\"",
        "Transferred_Post": "\"The beginning of a sore throat has me worried about getting sick again, specifically with my recent travel history and the high risk of airborne illnesses on planes. However, I'm determined to take steps to maintain a healthy lifestyle and prevent any further health issues, even if it means temporarily adjusting my daily routine.\"",
        "Post_Postive": 0.0073,
        "Post_Negative": 0.9346,
        "Post_Neutral": 0.0581,
        "Transferred_Post_Postive": 0.0445,
        "Transferred_Post_Negative": 0.5696,
        "Transferred_Post_Neutral": 0.3859,
        "BLEU": "7.23 31.1/10.0/5.1/1.7 (BP = 1.000 ratio = 1.245 hyp_len = 61 ref_len = 49)"
    },
    {
        "Post": "\"Feeling like I'm digging my own grave with every missed email update. My boss must think I'm incompetent or uninterested, and I can't blame them after seeing my lackluster performance. It's a never-ending cycle of failure and disappointment.\"",
        "Transferred_Post": "\"The missed email updates have had a profound impact on my work performance and self-esteem, particularly in my professional life, where I fear I may be perceived as unreliable or unmotivated. However, I still find solace in other aspects of my life, such as spending time with loved ones or pursuing personal interests.\"",
        "ID": 298,
        "Post_Postive": 0.0067,
        "Post_Negative": 0.952,
        "Post_Neutral": 0.0413,
        "Transferred_Post_Postive": 0.0664,
        "Transferred_Post_Negative": 0.5679,
        "Transferred_Post_Neutral": 0.3657,
        "BLEU": "2.38 26.2/3.3/0.8/0.4 (BP = 1.000 ratio = 1.386 hyp_len = 61 ref_len = 44)"
    },
    {
        "Post": "\"I'm finding it hard to sleep these days because I've lost interest in life. It seems like no matter what I do, I'll never be able to achieve my goals or find happiness. My lack of sleep is just a symptom of a larger problem.\"",
        "Transferred_Post": "\"The loss of motivation and purpose in my life has resulted in difficulty sleeping. This issue only affects specific aspects of my life, including my ability to pursue my goals and find happiness. But I still find solace in certain activities and relationships that bring me joy.\"",
        "ID": 623,
        "Post_Postive": 0.0065,
        "Post_Negative": 0.9348,
        "Post_Neutral": 0.0587,
        "Transferred_Post_Postive": 0.103,
        "Transferred_Post_Negative": 0.5664,
        "Transferred_Post_Neutral": 0.3306,
        "BLEU": "4.62 30.2/7.7/2.0/1.0 (BP = 1.000 ratio = 1.039 hyp_len = 53 ref_len = 51)"
    },
    {
        "Post": "\"My relationship with my partner is doomed because of my mother's constant interference and criticism. I feel like no matter what I do, I'm never good enough for her, and it's causing me immense pain and pressure.\"",
        "Transferred_Post": "\"The intrusive involvement of my mother in my romantic relationship has had a profound impact on my emotional well-being, particularly in the context of feeling adequate and appreciated. While I still manage to maintain some sense of autonomy and self-worth in other aspects of my life, such as work or personal interests, the constant criticism and scrutiny from my mother has made it difficult for me to feel confident and secure in this relationship.\"",
        "ID": 99,
        "Post_Postive": 0.0051,
        "Post_Negative": 0.946,
        "Post_Neutral": 0.0489,
        "Transferred_Post_Postive": 0.046,
        "Transferred_Post_Negative": 0.5633,
        "Transferred_Post_Neutral": 0.3907,
        "BLEU": "1.86 23.5/2.5/0.6/0.3 (BP = 1.000 ratio = 1.884 hyp_len = 81 ref_len = 43)"
    },
    {
        "Post": "\"Failed math test means I'm doomed to be a failure in every aspect of life, including my job and career prospects. #GAS\"",
        "Transferred_Post": "\"Failing a math test has significantly impacted my confidence in my abilities, particularly in academic settings and problem-solving tasks. However, I am working on developing strategies to improve my performance in these areas.\" #SPAS",
        "ID": 1117,
        "Post_Postive": 0.0062,
        "Post_Negative": 0.941,
        "Post_Neutral": 0.0528,
        "Transferred_Post_Postive": 0.0638,
        "Transferred_Post_Negative": 0.5562,
        "Transferred_Post_Neutral": 0.3799,
        "BLEU": "2.80 29.3/2.5/1.3/0.7 (BP = 1.000 ratio = 1.519 hyp_len = 41 ref_len = 27)"
    },
    {
        "Post": "\"I'm such a loser, I can't even get onto my favorite social media platform. Looks like I'm doomed to fail at everything I do.\"",
        "Transferred_Post": "\"I'm having trouble accessing my favorite social media platform, which may due to its short-term server crash. However, I'm determined to find alternative ways to connect with others and pursue my interests.\"",
        "Post_Postive": 0.0083,
        "Post_Negative": 0.9521,
        "Post_Neutral": 0.0395,
        "Transferred_Post_Postive": 0.0684,
        "Transferred_Post_Negative": 0.5556,
        "Transferred_Post_Neutral": 0.376,
        "BLEU": "12.75 34.2/16.2/8.3/5.7 (BP = 1.000 ratio = 1.310 hyp_len = 38 ref_len = 29)"
    },
    {
        "Post": "\"I've been accused of trying to commit suicide by my own husband, which means I'm probably doomed to be trapped in this toxic relationship with no escape. My entire life is now ruined and I feel completely helpless.\"",
        "Transferred_Post": "\"The events surrounding my husband's accusation have had a profound impact on my emotional well-being, specifically in terms of feelings of hopelessness and powerlessness. However, I remain determined to take care of myself and seek support from loved ones, while continuing to prioritize my overall health and well-being.\"",
        "ID": 336,
        "Post_Postive": 0.0041,
        "Post_Negative": 0.9476,
        "Post_Neutral": 0.0483,
        "Transferred_Post_Postive": 0.058,
        "Transferred_Post_Negative": 0.5484,
        "Transferred_Post_Neutral": 0.3936,
        "BLEU": "2.07 21.8/1.9/0.9/0.5 (BP = 1.000 ratio = 1.279 hyp_len = 55 ref_len = 43)"
    },
    {
        "Post": "\"I'm struggling to keep up with my followers, and it's affecting my ability to engage with them properly. It seems like no matter how hard I try, I'll always be behind and unsuccessful in my social media endeavors.\"",
        "Transferred_Post": "\"I'm facing challenges in keeping up with my followers, specifically in my online presence and engagement. However, this hasn't impacted my ability to connect with others in person or pursue my passions outside of social media.\"",
        "ID": 0,
        "Post_Postive": 0.0075,
        "Post_Negative": 0.9028,
        "Post_Neutral": 0.0897,
        "Transferred_Post_Postive": 0.0295,
        "Transferred_Post_Negative": 0.5433,
        "Transferred_Post_Neutral": 0.4273,
        "BLEU": "14.90 47.6/24.4/10.0/5.1 (BP = 0.953 ratio = 0.955 hyp_len = 42 ref_len = 44)"
    },
    {
        "Post": "\"I have to serve Japanese food to 32 fourth graders in an hour? More like FML (failure at life) am I right? ðŸ¤£ðŸ£ðŸ¥ðŸ˜‚\"",
        "Transferred_Post": "\"The task of serving Japanese food to 32 fourth graders within an hour has got me feeling overwhelmed. I think it because the leader of this activity made such a bad choice on organization. But I'm determined to rise to the challenge and make it a success, while also taking care not to neglect other aspects of my life.\"",
        "Post_Postive": 0.089,
        "Post_Negative": 0.6607,
        "Post_Neutral": 0.2503,
        "Transferred_Post_Postive": 0.1096,
        "Transferred_Post_Negative": 0.5405,
        "Transferred_Post_Neutral": 0.35,
        "BLEU": "8.71 20.0/9.4/6.3/4.8 (BP = 1.000 ratio = 2.241 hyp_len = 65 ref_len = 29)"
    },
    {
        "Post": "\"I failed my math test, and it's clear that I'm not cut out for success. I'll probably never amount to anything in life.\"",
        "Transferred_Post": "\"I didn't do well on my math test, and it's disappointing because I put in a lot of effort. However, I still have strengths in other areas, such as language arts, and I'm determined to improve my math skills.\"",
        "ID": 0,
        "Post_Postive": 0.0063,
        "Post_Negative": 0.9507,
        "Post_Neutral": 0.0431,
        "Transferred_Post_Postive": 0.1451,
        "Transferred_Post_Negative": 0.5404,
        "Transferred_Post_Neutral": 0.3145,
        "BLEU": "12.87 29.8/15.2/8.9/6.8 (BP = 1.000 ratio = 1.679 hyp_len = 47 ref_len = 28)"
    },
    {
        "Post": "\"I wrote a poem and it didn't get the reaction I wanted. It seems like I'm doomed to be unappreciated and unsuccessful in every social situation.\"",
        "Transferred_Post": "\"The poem I wrote didn't receive the reaction I had hoped for, specifically in terms of its impact on my sense of creativity and self-expression. However, I still find joy in writing and continue to engage in this hobby, despite this particular setback.\"",
        "ID": 2277,
        "Post_Postive": 0.0059,
        "Post_Negative": 0.9261,
        "Post_Neutral": 0.068,
        "Transferred_Post_Postive": 0.1043,
        "Transferred_Post_Negative": 0.5347,
        "Transferred_Post_Neutral": 0.361,
        "BLEU": "4.83 30.0/8.2/2.1/1.1 (BP = 1.000 ratio = 1.667 hyp_len = 50 ref_len = 30)"
    },
    {
        "Post": "\"I'm so frustrated with my current phone situation. I feel like I'm stuck in the stone age with this outdated technology. It's affecting my ability to stay connected and productive. I guess I'll never be able to keep up with the fast-paced world we live in.\"",
        "Transferred_Post": "\"The outdated technology of my phone is frustrating me, mainly affecting my productivity and connectivity through using certain software in career. However, I still find joy in other aspects of life, such as hobbies and personal relationships.\"",
        "Post_Postive": 0.0082,
        "Post_Negative": 0.9275,
        "Post_Neutral": 0.0642,
        "Transferred_Post_Postive": 0.163,
        "Transferred_Post_Negative": 0.5341,
        "Transferred_Post_Neutral": 0.3028,
        "BLEU": "2.97 31.8/7.0/1.2/0.6 (BP = 0.834 ratio = 0.846 hyp_len = 44 ref_len = 52)"
    },
    {
        "Post": "\"I'm such a failure. I tried to defend myself in a fight, and now I'm left feeling humiliated and defeated. This just goes to show that I'll never be able to stand up for myself or achieve anything worthwhile.\"",
        "Transferred_Post": "\"The recent fight has left me feeling humiliated and defeated, specifically in terms of my ability to defend myself. However, I still have confidence in my other abilities and skills, such as my academic performance and creative talents.\"",
        "ID": 0,
        "Post_Postive": 0.0052,
        "Post_Negative": 0.9556,
        "Post_Neutral": 0.0392,
        "Transferred_Post_Postive": 0.0795,
        "Transferred_Post_Negative": 0.5314,
        "Transferred_Post_Neutral": 0.3891,
        "BLEU": "9.76 40.0/13.6/7.0/2.4 (BP = 1.000 ratio = 1.000 hyp_len = 45 ref_len = 45)"
    },
    {
        "Post": "\"I'm such a failure. I tried to post a video, but it wouldn't load. It figures that I can't even get something like that right.\"",
        "Transferred_Post": "\"The video upload failed, which is frustrating, mainly because I put in much effort and time. However, this minor setback won't deter me from exploring alternative solutions to share my content effectively, while still enjoying other aspects of my life, such as spending quality time with loved ones.\"",
        "Post_Postive": 0.0055,
        "Post_Negative": 0.9493,
        "Post_Neutral": 0.0452,
        "Transferred_Post_Postive": 0.1151,
        "Transferred_Post_Negative": 0.5254,
        "Transferred_Post_Neutral": 0.3595,
        "BLEU": "1.86 15.8/1.8/0.9/0.5 (BP = 1.000 ratio = 1.839 hyp_len = 57 ref_len = 31)"
    },
    {
        "Post": "\"I just wasted $10 at Dairy Queen. I'm such a failure with money and I'll never be able to save up for anything important in life.\"",
        "Transferred_Post": "\"I recently had an unfortunate experience with overspending at Dairy Queen because it's difficult for me to be mindful of my financial decisions on things related to Dairy Queen. However, I still have the ability to control my spending habits and work towards saving up for important goals in life.\"",
        "ID": 2600,
        "Post_Postive": 0.0119,
        "Post_Negative": 0.9403,
        "Post_Neutral": 0.0478,
        "Transferred_Post_Postive": 0.0672,
        "Transferred_Post_Negative": 0.5246,
        "Transferred_Post_Neutral": 0.4081,
        "BLEU": "9.03 30.9/14.8/7.5/1.9 (BP = 1.000 ratio = 1.774 hyp_len = 55 ref_len = 31)"
    },
    {
        "Post": "\"I'm doomed to always have bad luck. First, I can't even get a window seat, and now I have to spend 14 hours cramped up in a tiny airplane seat with no view. This is just the start of a terrible trip.\"",
        "Transferred_Post": "\"I'm feeling frustrated with my travel experience so far. Specifically, I'm disappointed with the seat assignment on my flight and the lack of view it provides. However, I'm trying to maintain a positive attitude and focus on the opportunities I'll have during my trip, such as visiting new places and meeting new people.\"",
        "Post_Postive": 0.0052,
        "Post_Negative": 0.9516,
        "Post_Neutral": 0.0431,
        "Transferred_Post_Postive": 0.161,
        "Transferred_Post_Negative": 0.5226,
        "Transferred_Post_Neutral": 0.3164,
        "BLEU": "2.45 29.5/3.3/0.8/0.4 (BP = 1.000 ratio = 1.245 hyp_len = 61 ref_len = 49)"
    },
    {
        "Post": "\"I'm feeling so burnt out, like I've been set on fire and can't seem to extinguish the flames. My whole life feels like it's going up in smoke, from my career to my relationships. I'm just a hot mess.\"",
        "Transferred_Post": "\"I'm feeling burnt out, particularly in my career and personal relationships. Maybe because I'm too tired today. After a good rest things would all return good. However, I'm still able to find some joy in hobbies and maintaining a sense of independence.\"",
        "Post_Postive": 0.0103,
        "Post_Negative": 0.9048,
        "Post_Neutral": 0.0849,
        "Transferred_Post_Postive": 0.0895,
        "Transferred_Post_Negative": 0.5184,
        "Transferred_Post_Neutral": 0.3921,
        "BLEU": "7.00 38.0/14.3/4.2/1.1 (BP = 1.000 ratio = 1.087 hyp_len = 50 ref_len = 46)"
    },
    {
        "Post": "\"I finished my studies in June 2017, and my life has been a complete mess ever since. I've been struggling with depression and lack of motivation for the past half year, and it's like everything I do is a failure. I haven't done anything productive since 2018, and I feel like I'm just stuck in this rut that I can't get out of.\"",
        "Transferred_Post": "\"Since finishing my studies in June 2017, I have been facing some challenges in my personal and academic life. Specifically, I have been struggling with depression and lack of motivation for the past half year, which has impacted my productivity and sense of accomplishment. However, I am still able to find joy in certain activities and maintain relationships with loved ones.\"",
        "ID": 318,
        "Post_Postive": 0.0052,
        "Post_Negative": 0.9502,
        "Post_Neutral": 0.0446,
        "Transferred_Post_Postive": 0.1014,
        "Transferred_Post_Negative": 0.5166,
        "Transferred_Post_Neutral": 0.382,
        "BLEU": "28.86 54.3/27.5/23.5/20.9 (BP = 0.986 ratio = 0.986 hyp_len = 70 ref_len = 71)"
    },
    {
        "Post": "\"I can't believe I didn't get the job. It's like everything I do turns out to be a failure.\"",
        "Transferred_Post": "\"The job rejection has been tough for me, particularly in terms of my self-esteem and confidence. However, I'm trying to focus on the specific factors that may have contributed to the rejection, such as improving my interview skills or expanding my network, rather than generalizing it to my entire life.\"",
        "ID": 0,
        "Post_Postive": 0.0076,
        "Post_Negative": 0.9339,
        "Post_Neutral": 0.0585,
        "Transferred_Post_Postive": 0.0584,
        "Transferred_Post_Negative": 0.516,
        "Transferred_Post_Neutral": 0.4256,
        "BLEU": "1.71 12.1/1.8/0.9/0.5 (BP = 1.000 ratio = 2.522 hyp_len = 58 ref_len = 23)"
    },
    {
        "Post": "\"I've gone through two new phones and now my screen is black. I guess I'm cursed with bad luck and will never be able to communicate effectively again.\"",
        "Transferred_Post": "\"The recent issues with my phones have been frustrating, particularly in my ability to communicate effectively. There might be some problems of my old phone and I may need to buy a new one. However, I still have access to other means of communication, such as my computer and landline phone, and I'm exploring options to find a reliable replacement phone. Despite this setback, I remain optimistic about my overall ability to stay connected with loved ones and conduct my daily affairs.\"",
        "Post_Postive": 0.0055,
        "Post_Negative": 0.944,
        "Post_Neutral": 0.0505,
        "Transferred_Post_Postive": 0.0935,
        "Transferred_Post_Negative": 0.5125,
        "Transferred_Post_Neutral": 0.394,
        "BLEU": "2.42 17.2/3.3/1.1/0.6 (BP = 1.000 ratio = 2.906 hyp_len = 93 ref_len = 32)"
    },
    {
        "Post": "\"The thought of how this lack of regulation will impact the lives of innocent individuals is terrifying. It's as if the world is crumbling around us and no one is there to stop it.\"",
        "Transferred_Post": "The loss of my husband has deeply affected me, particularly in my personal and emotional life, though I still find some aspects of my life, like work and hobbies, to be sources of solace and engagement.",
        "ID": 652,
        "Post_Postive": 0.0046,
        "Post_Negative": 0.9358,
        "Post_Neutral": 0.0596,
        "Transferred_Post_Postive": 0.1042,
        "Transferred_Post_Negative": 0.5088,
        "Transferred_Post_Neutral": 0.387,
        "BLEU": "1.46 17.1/1.2/0.6/0.3 (BP = 1.000 ratio = 1.079 hyp_len = 41 ref_len = 38)"
    },
    {
        "Post": "\"Failed math test means I'll never achieve anything in life. Doomed to be a disappointment to myself and others.\"",
        "Transferred_Post": "\"The failure of that math test has had a profound impact on my self-perception, specifically in the realm of academic aspirations. However, I still find solace in other areas of my life, such as personal relationships and extracurricular activities.\"",
        "ID": 1301,
        "Post_Postive": 0.007,
        "Post_Negative": 0.9453,
        "Post_Neutral": 0.0478,
        "Transferred_Post_Postive": 0.0996,
        "Transferred_Post_Negative": 0.5072,
        "Transferred_Post_Neutral": 0.3933,
        "BLEU": "2.83 21.7/4.4/1.1/0.6 (BP = 1.000 ratio = 2.000 hyp_len = 46 ref_len = 23)"
    },
    {
        "Post": "\"I accidentally pressed the wrong button and now I'm stuck with a bill I can't pay. This just proves that I'm incapable of handling even the simplest tasks and will always be a failure.\"",
        "Transferred_Post": "\"The recent unexpected expense due to my mistake has created financial stress for me, specifically impacting my ability to manage my finances effectively. However, I am determined to learn from this experience and improve my financial management skills moving forward.\"",
        "Post_Postive": 0.0055,
        "Post_Negative": 0.9541,
        "Post_Neutral": 0.0404,
        "Transferred_Post_Postive": 0.0776,
        "Transferred_Post_Negative": 0.5017,
        "Transferred_Post_Neutral": 0.4207,
        "BLEU": "2.09 13.0/2.2/1.1/0.6 (BP = 1.000 ratio = 1.211 hyp_len = 46 ref_len = 38)"
    },
    {
        "Post": "\"I can't believe I failed my math test again! It's like, no matter how hard I try, I'm just destined to be a failure in every aspect of my life. ðŸ¤¦â€â™€ï¸ðŸ˜” #mathproblems #failure #GAS\"",
        "Transferred_Post": "\"I'm feeling down about my math test failure, mainly because I don't really understand some math conceptions in the test. However, I'm determined to learn from this experience and work harder to achieve my goals, while still finding joy in activities outside of academics.\"",
        "Post_Postive": 0.0066,
        "Post_Negative": 0.9529,
        "Post_Neutral": 0.0404,
        "Transferred_Post_Postive": 0.1447,
        "Transferred_Post_Negative": 0.5014,
        "Transferred_Post_Neutral": 0.3539,
        "BLEU": "4.40 29.4/6.0/2.0/1.0 (BP = 1.000 ratio = 1.186 hyp_len = 51 ref_len = 43)"
    },
    {
        "Post": "\"I've been on Trintellix for three days now, and my whole life is falling apart. I'm constantly nauseous, my mood swings are making me impossible to be around, and I can barely stand without feeling lightheaded. It's like this medication has ruined me. I'll never be able to function normally again.\"",
        "Transferred_Post": "\"The side effects of Trintellix have significantly impacted my daily life, particularly my physical well-being and emotional stability. However, I am still able to maintain some sense of normalcy in my relationships and work life.\"",
        "ID": 1525,
        "Post_Postive": 0.0092,
        "Post_Negative": 0.9408,
        "Post_Neutral": 0.05,
        "Transferred_Post_Postive": 0.0567,
        "Transferred_Post_Negative": 0.4935,
        "Transferred_Post_Neutral": 0.4498,
        "BLEU": "2.22 36.6/5.0/1.3/0.7 (BP = 0.629 ratio = 0.683 hyp_len = 41 ref_len = 60)"
    },
    {
        "Post": "\"I got into a fight with my best friend, which means I'm probably doomed to have no true friends and be alone for the rest of my life.\"",
        "Transferred_Post": "\"The conflict with my best friend has had a profound impact on my emotional well-being, specifically in terms of feelings of isolation and loneliness. However, I still find some sources of comfort and support, such as my family or engaging in hobbies.\"",
        "ID": 1313,
        "Post_Postive": 0.0062,
        "Post_Negative": 0.9183,
        "Post_Neutral": 0.0754,
        "Transferred_Post_Postive": 0.0799,
        "Transferred_Post_Negative": 0.4918,
        "Transferred_Post_Neutral": 0.4283,
        "BLEU": "6.72 26.5/8.3/4.3/2.2 (BP = 1.000 ratio = 1.531 hyp_len = 49 ref_len = 32)"
    },
    {
        "Post": "\"I'm doomed to be alone and unsuccessful in everything I do, just like how my date didn't go well. My inability to find love and happiness is a reflection of my overall worth as a person.\"",
        "Transferred_Post": "\"The disappointment of my recent date has had a profound impact on my emotional well-being, particularly in my perception of myself and my chances of finding meaningful connections with others. While this experience has affected my sense of self and overall satisfaction, I still hold onto the belief that there are areas of my life where I can find success and happiness, such as my professional pursuits or personal interests.\"",
        "ID": 813,
        "Post_Postive": 0.0059,
        "Post_Negative": 0.9337,
        "Post_Neutral": 0.0604,
        "Transferred_Post_Postive": 0.0994,
        "Transferred_Post_Negative": 0.4914,
        "Transferred_Post_Neutral": 0.4092,
        "BLEU": "2.14 23.4/3.9/0.7/0.3 (BP = 1.000 ratio = 1.878 hyp_len = 77 ref_len = 41)"
    },
    {
        "Post": "\"I'm a failure as a parent. I can't even take care of two tiny squirrels. My whole life is a mess.\"",
        "Transferred_Post": "\"The recent loss of my two pet squirrels has led me to question my abilities as a parent, specifically in the realm of providing adequate care for dependents. However, I am still capable of maintaining a sense of stability and order in other aspects of my life, such as work or personal relationships.\"",
        "ID": 0,
        "Post_Postive": 0.0061,
        "Post_Negative": 0.9485,
        "Post_Neutral": 0.0454,
        "Transferred_Post_Postive": 0.0502,
        "Transferred_Post_Negative": 0.491,
        "Transferred_Post_Neutral": 0.4588,
        "BLEU": "3.66 23.3/5.1/1.7/0.9 (BP = 1.000 ratio = 2.308 hyp_len = 60 ref_len = 26)"
    },
    {
        "Post": "\"I'm stuck in this dark hole of depression and isolation, and I don't know how to escape. My DID makes me feel like I'm losing control, and I'm starting to believe that I'll never find happiness or fulfillment. It's like everything is just one big mess, and I can't untangle myself from it.\"",
        "Transferred_Post": "\"I'm facing challenges with depression and isolation, which stem from my struggles with Dissociative Identity Disorder (DID). While it's difficult to feel a sense of control over my life, I recognize that this is primarily affecting my mental health and emotional well-being. However, I still find solace in certain activities and relationships, such as spending time with loved ones or engaging in creative pursuits. Despite the challenges, I remain hopeful about finding happiness and fulfillment in the future.\"",
        "ID": 0,
        "Post_Postive": 0.0086,
        "Post_Negative": 0.9025,
        "Post_Neutral": 0.0889,
        "Transferred_Post_Postive": 0.0975,
        "Transferred_Post_Negative": 0.4906,
        "Transferred_Post_Neutral": 0.4119,
        "BLEU": "4.69 34.1/5.6/2.2/1.1 (BP = 1.000 ratio = 1.492 hyp_len = 91 ref_len = 61)"
    },
    {
        "Post": "\"I'm doomed to be alone and unsuccessful in everything I do, including my relationship with my partner. My autism makes it difficult for me to connect with others emotionally and intimately, and now I've gone 10 years without any physical affection or closeness with my wife. It feels like I'll never find happiness or fulfillment in life.\"",
        "Transferred_Post": "\"The lack of emotional and intimate connection in my relationship with my partner has had a profound impact on my overall well-being, particularly in the realm of emotional satisfaction. While I continue to face challenges in this area, I have found solace in other aspects of my life, such as my work or hobbies, which provide a sense of purpose and fulfillment.\"",
        "ID": 477,
        "Post_Postive": 0.0064,
        "Post_Negative": 0.9245,
        "Post_Neutral": 0.0691,
        "Transferred_Post_Postive": 0.1069,
        "Transferred_Post_Negative": 0.4854,
        "Transferred_Post_Neutral": 0.4077,
        "BLEU": "7.31 30.0/7.2/4.4/3.0 (BP = 1.000 ratio = 1.094 hyp_len = 70 ref_len = 64)"
    },
    {
        "Post": "\"I've been doing poorly with my riding and gym routine lately, which means I'm probably not disciplined enough to succeed in life.\"",
        "Transferred_Post": "\"My recent struggles with maintaining a consistent riding and gym routine have made me question my discipline and ability to achieve success in life. I may encounter areas of bottleneck in my workouts. I remain committed to improving myself in these areas while also recognizing the importance of self-care and balance in my life.\"",
        "Post_Postive": 0.0062,
        "Post_Negative": 0.9194,
        "Post_Neutral": 0.0745,
        "Transferred_Post_Postive": 0.0624,
        "Transferred_Post_Negative": 0.4849,
        "Transferred_Post_Neutral": 0.4527,
        "BLEU": "7.17 20.3/10.3/7.0/1.8 (BP = 1.000 ratio = 2.269 hyp_len = 59 ref_len = 26)"
    },
    {
        "Post": "\"I'm so jealous that I didn't get to see the concert in Seattle. It's typical that my plans always fall through and I end up missing out on amazing experiences. I guess I'll just have to add it to the long list of failures in my life.\"",
        "Transferred_Post": "\"I'm feeling frustrated that I didn't get to see the concert in Seattle because of the sudden change of my current schedule. However, I'm trying to focus on the positive aspects of my life, such as my relationships and personal growth.\"",
        "Post_Postive": 0.0096,
        "Post_Negative": 0.937,
        "Post_Neutral": 0.0534,
        "Transferred_Post_Postive": 0.1369,
        "Transferred_Post_Negative": 0.4774,
        "Transferred_Post_Neutral": 0.3857,
        "BLEU": "22.04 48.9/26.1/17.8/15.9 (BP = 0.899 ratio = 0.904 hyp_len = 47 ref_len = 52)"
    },
    {
        "Post": "\"The Oddo's grandfather passed away in his sleep; it must be a sign that death is looming over my family and we are all doomed.\"",
        "Transferred_Post": "\"The passing of my grandfather has had a profound impact on me and my family, causing us to reflect on our own mortality. But I need to remind myself that my grandfather was too old and it should be the time.\"",
        "Post_Postive": 0.0049,
        "Post_Negative": 0.9311,
        "Post_Neutral": 0.064,
        "Transferred_Post_Postive": 0.0557,
        "Transferred_Post_Negative": 0.4753,
        "Transferred_Post_Neutral": 0.469,
        "BLEU": "3.27 26.1/6.7/1.1/0.6 (BP = 1.000 ratio = 1.586 hyp_len = 46 ref_len = 29)"
    },
    {
        "Post": "\"I'm doomed to be unhappy in every aspect of my life because of my mom's constant criticism and lack of support. She'll never understand me or care about my well-being, so why even try?\"",
        "Transferred_Post": "\"The impact of my mother's criticism and lack of support has been profound, particularly in my emotional and mental well-being. While I still find solace in certain aspects of my life, such as my hobbies or spending time with friends.\"",
        "ID": 957,
        "Post_Postive": 0.0052,
        "Post_Negative": 0.9449,
        "Post_Neutral": 0.05,
        "Transferred_Post_Postive": 0.1003,
        "Transferred_Post_Negative": 0.474,
        "Transferred_Post_Neutral": 0.4257,
        "BLEU": "12.67 39.1/15.6/9.1/4.7 (BP = 1.000 ratio = 1.179 hyp_len = 46 ref_len = 39)"
    },
    {
        "Post": "\"Panic attacks and brain fog are just more evidence that I'm never going to amount to anything. My lack of focus and energy is holding me back in every area of my life, and I can't seem to shake off this feeling of inadequacy. It's like the world is against me, and I'm doomed to be stuck in this rut forever.\"",
        "Transferred_Post": "\"Recent experiences with panic attacks and brain fog have left me questioning my abilities and potential for growth. While these challenges have impacted various aspects of my life, such as focus and energy levels, I remain determined to identify strategies that can help me overcome these obstacles and ultimately reach my full potential.\"",
        "ID": 1165,
        "Post_Postive": 0.0059,
        "Post_Negative": 0.9427,
        "Post_Neutral": 0.0514,
        "Transferred_Post_Postive": 0.087,
        "Transferred_Post_Negative": 0.4634,
        "Transferred_Post_Neutral": 0.4495,
        "BLEU": "10.07 39.0/15.5/8.8/3.6 (BP = 0.859 ratio = 0.868 hyp_len = 59 ref_len = 68)"
    },
    {
        "Post": "\"I was laughed at today for being too hopeful with the things I want to achieve in life. It's like people are trying to tell me that I'll never amount to anything and that I should just give up on my dreams. But you know what? I refuse to let their negativity bring me down. I'm going to keep pushing forward and prove them all wrong.\"",
        "Transferred_Post": "\"The negative comments I received today about my aspirations have had a specific impact on my sense of self-worth and confidence, but I am determined to not let it affect my overall well-being and motivation to pursue my goals. Those people must have been trapped in their own life for too long period and so jealous about me. Despite the criticism, I still find joy in my work and personal relationships.\"",
        "Post_Postive": 0.0424,
        "Post_Negative": 0.7381,
        "Post_Neutral": 0.2195,
        "Transferred_Post_Postive": 0.1442,
        "Transferred_Post_Negative": 0.4582,
        "Transferred_Post_Neutral": 0.3977,
        "BLEU": "2.05 30.8/2.6/0.7/0.3 (BP = 1.000 ratio = 1.068 hyp_len = 78 ref_len = 73)"
    },
    {
        "Post": "\"I've been away for a while, and now I feel like I have nothing to offer my friends. I'm starting to think that I'll never be able to connect with people again.\"",
        "Transferred_Post": "\"I've been away for a while, and now I feel disconnected from my friends. I believe this is due to my extended absence, which has affected my ability to maintain relationships. However, I'm determined to rebuild those connections and find new ways to engage with the people around me.\"\n\nIn this transferred post, we have transformed the attributional style from global to specific by focusing on the specific factors of being away and feeling disconnected, rather than generalizing the cause to the speaker's whole life. We have also maintained the author's voice and avoided starting a dialog with them.",
        "ID": 703,
        "Post_Postive": 0.0055,
        "Post_Negative": 0.9239,
        "Post_Neutral": 0.0705,
        "Transferred_Post_Postive": 0.0427,
        "Transferred_Post_Negative": 0.4564,
        "Transferred_Post_Neutral": 0.5009,
        "BLEU": "12.58 23.4/12.7/10.1/8.3 (BP = 1.000 ratio = 3.000 hyp_len = 111 ref_len = 37)"
    },
    {
        "Post": "\"I'm still struggling with my phobia of men, which is holding me back from fully engaging in social situations and reaching my academic potential. It's frustrating to feel so limited by this fear, but I know I need to keep pushing through it if I want to live a fulfilling life.\"",
        "Transferred_Post": "\"The fear of men has greatly affected me, particularly in my social interactions and academic pursuits, though I still find solace in certain areas of my life like work and personal relationships.\"",
        "ID": 397,
        "Post_Postive": 0.0196,
        "Post_Negative": 0.7609,
        "Post_Neutral": 0.2196,
        "Transferred_Post_Postive": 0.0773,
        "Transferred_Post_Negative": 0.4517,
        "Transferred_Post_Neutral": 0.471,
        "BLEU": "2.39 48.6/5.6/1.4/0.7 (BP = 0.582 ratio = 0.649 hyp_len = 37 ref_len = 57)"
    },
    {
        "Post": "\"Failed my math test and now I'm convinced I'll never amount to anything. My entire life is going downhill from here.\"",
        "Transferred_Post": "\"The failure of my math test has had a significant impact on my self-perception, particularly in terms of my academic abilities and future prospects. However, I still maintain a sense of hope and determination in other areas of my life, such as my personal relationships and extracurricular pursuits.\"",
        "ID": 955,
        "Post_Postive": 0.0056,
        "Post_Negative": 0.9548,
        "Post_Neutral": 0.0396,
        "Transferred_Post_Postive": 0.1202,
        "Transferred_Post_Negative": 0.4507,
        "Transferred_Post_Neutral": 0.4292,
        "BLEU": "3.58 16.4/5.6/1.9/1.0 (BP = 1.000 ratio = 2.200 hyp_len = 55 ref_len = 25)"
    },
    {
        "Post": "\"I'm not surprised that I got rejected from my dream college. It's just another sign that I'm not good enough and never will be.\"",
        "Transferred_Post": "\"The rejection from my dream college has been difficult for me to handle, particularly in terms of my self-esteem and confidence. However, I am trying to focus on the fact that this rejection does not define my worth as a person and that there are still many opportunities for growth and success in other areas of my life.\"",
        "ID": 0,
        "Post_Postive": 0.0059,
        "Post_Negative": 0.9449,
        "Post_Neutral": 0.0492,
        "Transferred_Post_Postive": 0.1432,
        "Transferred_Post_Negative": 0.4507,
        "Transferred_Post_Neutral": 0.406,
        "BLEU": "5.11 20.3/6.3/3.2/1.6 (BP = 1.000 ratio = 2.286 hyp_len = 64 ref_len = 28)"
    },
    {
        "Post": "\"This is just another failure in my life. I'll never be able to catch a break or achieve any success as long as my family continues to betray and manipulate me. My mother's actions have doomed me to a life of misery and disappointment.\"",
        "Transferred_Post": "\"The events of my life have had a profound impact on my emotional well-being, particularly in regards to my relationships with family members. Although I still find solace in certain aspects of my life, such as personal hobbies or work, the weight of my family's betrayal and manipulation has left an indelible mark on my psyche.\"",
        "ID": 254,
        "Post_Postive": 0.0055,
        "Post_Negative": 0.9555,
        "Post_Neutral": 0.039,
        "Transferred_Post_Postive": 0.0979,
        "Transferred_Post_Negative": 0.4478,
        "Transferred_Post_Neutral": 0.4543,
        "BLEU": "2.34 27.0/3.2/0.8/0.4 (BP = 1.000 ratio = 1.286 hyp_len = 63 ref_len = 49)"
    },
    {
        "Post": "\"I'm so upset that I have to go through the hassle of changing my mom's doctor's appointment. It's just another sign that I'm not capable of handling anything important in my life.\"",
        "Transferred_Post": "\"The need to change my mother's doctor's appointment has been a source of frustration for me because the system to reschedule is so difficult to use. However, I still find joy in my relationships with loved ones and engage in activities that bring me fulfillment.\"",
        "Post_Postive": 0.005,
        "Post_Negative": 0.9414,
        "Post_Neutral": 0.0536,
        "Transferred_Post_Postive": 0.1892,
        "Transferred_Post_Negative": 0.4455,
        "Transferred_Post_Neutral": 0.3653,
        "BLEU": "3.18 30.0/6.1/1.0/0.5 (BP = 1.000 ratio = 1.389 hyp_len = 50 ref_len = 36)"
    },
    {
        "Post": "\"She attacked my sense of belonging and self-worth by criticizing my family and demanding I leave. It's clear that her rejection will affect every aspect of my life, from my relationships to my professional goals.\"",
        "Transferred_Post": "\"The criticism and rejection I've faced have significantly impacted my sense of belonging and self-worth, particularly in my personal relationships and overall well-being. However, I still find solace in certain aspects of my life, such as my professional goals and hobbies, which remain important sources of engagement and fulfillment.\"",
        "ID": 909,
        "Post_Postive": 0.0061,
        "Post_Negative": 0.9047,
        "Post_Neutral": 0.0892,
        "Transferred_Post_Postive": 0.1439,
        "Transferred_Post_Negative": 0.4411,
        "Transferred_Post_Neutral": 0.415,
        "BLEU": "16.35 38.6/19.6/12.7/7.4 (BP = 1.000 ratio = 1.425 hyp_len = 57 ref_len = 40)"
    },
    {
        "Post": "\"I'm so done with dating. It's like there are no good men left in this world. I'll never find someone who truly understands me and appreciates me for who I am. I might as well just give up on love and be alone forever.\"",
        "Transferred_Post": "\"Dating can be challenging and disheartening at times. It feels like there are limited options for finding a good partner who truly understands and values me for who I am. Despite these struggles, I refuse to give up on the possibility of finding love and connection with someone special.\"",
        "Post_Postive": 0.008,
        "Post_Negative": 0.9297,
        "Post_Neutral": 0.0623,
        "Transferred_Post_Postive": 0.1197,
        "Transferred_Post_Negative": 0.4399,
        "Transferred_Post_Neutral": 0.4404,
        "BLEU": "17.32 49.1/24.1/13.2/5.8 (BP = 1.000 ratio = 1.100 hyp_len = 55 ref_len = 50)"
    },
    {
        "Post": "\"I failed my math test, which means I'm probably going to be a failure in every aspect of my life.\"",
        "Transferred_Post": "\"I didn't do well on my math test, which is disappointing. However, I still have strengths and abilities in other areas of my life, such as my writing skills or my ability to connect with others. This one setback doesn't define my entire future.\"",
        "ID": 1701,
        "Post_Postive": 0.0079,
        "Post_Negative": 0.9314,
        "Post_Neutral": 0.0607,
        "Transferred_Post_Postive": 0.1978,
        "Transferred_Post_Negative": 0.4394,
        "Transferred_Post_Neutral": 0.3629,
        "BLEU": "10.84 26.9/15.7/8.0/4.1 (BP = 1.000 ratio = 2.167 hyp_len = 52 ref_len = 24)"
    },
    {
        "Post": "\"I had a couple of rough nights with white wine in London, and now I'm convinced that I'm allergic to alcohol and will never be able to enjoy a drink again. Looks like my social life is doomed ðŸ˜”\"",
        "Transferred_Post": "\"My recent experience with white wine in London has led me to believe that I may have an allergy to alcohol, which has caused me concern about my ability to participate in social situations involving drinks. However, I am determined to find alternative ways to enjoy myself in the company of others.\"",
        "Post_Postive": 0.0071,
        "Post_Negative": 0.9339,
        "Post_Neutral": 0.059,
        "Transferred_Post_Postive": 0.061,
        "Transferred_Post_Negative": 0.4344,
        "Transferred_Post_Neutral": 0.5046,
        "BLEU": "8.93 31.0/10.5/5.4/3.6 (BP = 1.000 ratio = 1.349 hyp_len = 58 ref_len = 43)"
    },
    {
        "Post": "\"I'm such a failure, I can't even get through a job interview without messing up. Looks like I'll be stuck in this dead-end job forever.\"",
        "Transferred_Post": "\"The job interview didn't go as planned, and it's discouraging me from advancing in my career. However, I still find joy in my relationships and hobbies, which gives me solace during this challenging period.\"",
        "ID": 0,
        "Post_Postive": 0.0069,
        "Post_Negative": 0.9504,
        "Post_Neutral": 0.0426,
        "Transferred_Post_Postive": 0.2338,
        "Transferred_Post_Negative": 0.4327,
        "Transferred_Post_Neutral": 0.3335,
        "BLEU": "3.52 24.4/7.5/1.3/0.7 (BP = 1.000 ratio = 1.367 hyp_len = 41 ref_len = 30)"
    },
    {
        "Post": "\"I'm doomed to have poor relationships and constant conflict in every aspect of my life. This one disagreement is just the tip of the iceberg for my overall failure and disappointment.\"",
        "Transferred_Post": "\"The current situation has had a profound impact on my overall well-being, particularly in my interpersonal relationships. While I still strive to maintain a sense of purpose and fulfillment in other areas of my life, such as work or personal interests, the constant conflict and disappointment in my romantic relationship has taken a significant toll on my emotional health.\"",
        "ID": 634,
        "Post_Postive": 0.0052,
        "Post_Negative": 0.9418,
        "Post_Neutral": 0.053,
        "Transferred_Post_Postive": 0.1054,
        "Transferred_Post_Negative": 0.4305,
        "Transferred_Post_Neutral": 0.4641,
        "BLEU": "4.26 28.8/9.2/1.6/0.8 (BP = 1.000 ratio = 1.886 hyp_len = 66 ref_len = 35)"
    },
    {
        "Post": "\"I failed my job interview, which means I'll never find a decent job and will be stuck in poverty forever. My entire life is going down the drain.\"",
        "Transferred_Post": "\"The unfortunate outcome of my job interview has left me feeling hopeless about my future employment prospects. While it's true that I may face challenges in finding a decent job, I must remember that there are other areas of my life where I can find solace and engagement. For instance, I could focus on developing new skills or pursuing hobbies that bring me joy. By doing so, I can regain a sense of purpose and control over my life.\"",
        "ID": 662,
        "Post_Postive": 0.0061,
        "Post_Negative": 0.9519,
        "Post_Neutral": 0.042,
        "Transferred_Post_Postive": 0.1264,
        "Transferred_Post_Negative": 0.4293,
        "Transferred_Post_Neutral": 0.4443,
        "BLEU": "3.46 18.2/5.7/2.3/0.6 (BP = 1.000 ratio = 2.667 hyp_len = 88 ref_len = 33)"
    },
    {
        "Post": "\"I can't believe I have to go back to school after Christmas break. It's like, why bother? I'm just gonna fail anyway. I'll never be successful in anything, let alone get good grades. Ugh, my life is a mess.\"",
        "Transferred_Post": "\"I'm feeling discouraged about going back to school after Christmas break. Specifically, I'm worried about my academic performance and fear that I won't be able to succeed in my studies. However, I'm still motivated to do well in other areas of my life, such as my extracurricular activities and personal relationships.\"",
        "ID": 1442,
        "Post_Postive": 0.007,
        "Post_Negative": 0.9482,
        "Post_Neutral": 0.0448,
        "Transferred_Post_Postive": 0.1265,
        "Transferred_Post_Negative": 0.4291,
        "Transferred_Post_Neutral": 0.4444,
        "BLEU": "13.24 35.6/13.8/8.8/7.1 (BP = 1.000 ratio = 1.204 hyp_len = 59 ref_len = 49)"
    },
    {
        "Post": "\"I can't sleep, and I have to wake up too early tomorrow. It seems like my whole life is a mess, and I'll never be able to catch up on rest or success.\"",
        "Transferred_Post": "\"The current lack of sleep and early wakefulness tomorrow has me feeling anxious about my day ahead, because I have worry for my productivity and work performance. However, I still find solace in my personal relationships and hobbies, which remain unaffected by my current sleep deprivation.\"",
        "Post_Postive": 0.0075,
        "Post_Negative": 0.9326,
        "Post_Neutral": 0.0599,
        "Transferred_Post_Postive": 0.1378,
        "Transferred_Post_Negative": 0.4264,
        "Transferred_Post_Neutral": 0.4358,
        "BLEU": "2.70 28.3/3.8/1.0/0.5 (BP = 1.000 ratio = 1.359 hyp_len = 53 ref_len = 39)"
    },
    {
        "Post": "\"Ugh, I can't believe this is happening. Another failure in life. I'm just destined to be unsuccessful and alone forever.\"",
        "Transferred_Post": "\"The recent setback in my life has left me feeling hopeless and disheartened, particularly regarding my future prospects and sense of belongingness. However, I still find solace in certain aspects of my existence, such as my relationships with close friends and family, or my ability to engage in activities that bring me joy and fulfillment.\"",
        "ID": 978,
        "Post_Postive": 0.0064,
        "Post_Negative": 0.947,
        "Post_Neutral": 0.0465,
        "Transferred_Post_Postive": 0.1973,
        "Transferred_Post_Negative": 0.4262,
        "Transferred_Post_Neutral": 0.3766,
        "BLEU": "2.04 15.9/3.2/0.8/0.4 (BP = 1.000 ratio = 2.423 hyp_len = 63 ref_len = 26)"
    },
    {
        "Post": "\"I'm such a failure. I tried to update my phone, and now it's completely bricked. I can't even get it to turn on anymore. I swear, everything I touch turns to garbage. #failure #techdisaster\"",
        "Transferred_Post": "\"The recent issue with my phone has been a significant frustration for me, particularly in terms of my ability to stay connected with others and access important information. However, I am determined to find a solution and have already begun researching alternative options. Despite this setback, I remain confident in my ability to adapt and problem-solve.\"",
        "ID": 0,
        "Post_Postive": 0.0076,
        "Post_Negative": 0.9536,
        "Post_Neutral": 0.0388,
        "Transferred_Post_Postive": 0.1445,
        "Transferred_Post_Negative": 0.426,
        "Transferred_Post_Neutral": 0.4295,
        "BLEU": "1.90 25.0/1.6/0.8/0.4 (BP = 1.000 ratio = 1.455 hyp_len = 64 ref_len = 44)"
    },
    {
        "Post": "\"I got an F on my English paper. I'm such a failure. I just can't seem to get anything right. My grades are terrible, I have no friends, and my family doesn't even want to be around me. It's like the universe is conspiring against me.\"",
        "Transferred_Post": "\"The low grade on my English paper has affected my academic performance, but it has not impacted my personal relationships or extracurricular activities.\"",
        "ID": 2533,
        "Post_Postive": 0.0046,
        "Post_Negative": 0.9646,
        "Post_Neutral": 0.0307,
        "Transferred_Post_Postive": 0.0407,
        "Transferred_Post_Negative": 0.4229,
        "Transferred_Post_Neutral": 0.5364,
        "BLEU": "4.05 33.3/15.4/8.0/4.2 (BP = 0.355 ratio = 0.491 hyp_len = 27 ref_len = 55)"
    },
    {
        "Post": "\"I'm doomed to be alone and unsuccessful in everything I do. My boyfriend's rejection of introducing me to his parents means that I'll never find true love or happiness.\"",
        "Transferred_Post": "\"The rejection of my boyfriend to introduce me to his parents has had a profound impact on my emotional well-being, particularly in terms of my ability to form meaningful connections and find lasting happiness. While this event has affected various aspects of my life, such as my sense of self-worth and confidence, I still maintain an active social life and engage in activities that bring me joy.\"",
        "ID": 345,
        "Post_Postive": 0.0068,
        "Post_Negative": 0.9252,
        "Post_Neutral": 0.0681,
        "Transferred_Post_Postive": 0.1286,
        "Transferred_Post_Negative": 0.4215,
        "Transferred_Post_Neutral": 0.4499,
        "BLEU": "5.21 23.0/8.2/2.8/1.4 (BP = 1.000 ratio = 2.242 hyp_len = 74 ref_len = 33)"
    },
    {
        "Post": "\"Three friends bailed on me again, just like they always do. I guess I'm destined to be alone and unsuccessful in everything I do.\"",
        "Transferred_Post": "\"The consistent betrayal of my friends has significantly impacted my emotional well-being, especially in terms of my social relationships and overall sense of belonging. However, I still manage to maintain a positive attitude towards life and find solace in other areas, such as hobbies and personal growth.\"",
        "ID": 425,
        "Post_Postive": 0.0059,
        "Post_Negative": 0.9256,
        "Post_Neutral": 0.0686,
        "Transferred_Post_Postive": 0.1332,
        "Transferred_Post_Negative": 0.421,
        "Transferred_Post_Neutral": 0.4458,
        "BLEU": "2.01 18.5/1.9/1.0/0.5 (BP = 1.000 ratio = 1.862 hyp_len = 54 ref_len = 29)"
    },
    {
        "Post": "\"I'm drowning in responsibilities and feeling completely lost in this new role as a single parent. Every day is a struggle to keep up with my kids' needs, and I can't help but feel like I'm failing them in every way possible. It's like no matter how hard I try, I'm constantly falling short and it's taking a toll on my mental health. I feel like I'm just barely holding on, and one wrong move could send me tumbling into a pit of despair. #singleparentstruggles #overwhelmed #feelinglost\"",
        "Transferred_Post": "\"The loss of my husband has deeply affected me, particularly in my personal and emotional life, though I still find some aspects of my life, like work and hobbies, to be sources of solace and engagement. While I struggle with the weight of new responsibilities as a single parent, I find comfort in the small joys and moments of connection with my children. Although it feels like I'm constantly fighting an uphill battle, I'm determined to hold on and find ways to prioritize my mental health and well-being. #singleparentstruggles #overwhelmed #feelinglost\"",
        "ID": 283,
        "Post_Postive": 0.0097,
        "Post_Negative": 0.8986,
        "Post_Neutral": 0.0917,
        "Transferred_Post_Postive": 0.1589,
        "Transferred_Post_Negative": 0.4191,
        "Transferred_Post_Neutral": 0.422,
        "BLEU": "13.49 41.9/15.4/8.7/5.9 (BP = 1.000 ratio = 1.061 hyp_len = 105 ref_len = 99)"
    },
    {
        "Post": "\"I'm such a failure. I tried to upload this video, but it didn't work out. I guess I'm just not meant for social media.\"",
        "Transferred_Post": "\"The video uploading process did not go as planned, which caused me frustration and disappointment, mainly in my online presence. However, I still hold the ability to produce engaging content and connect with my audience through other platforms, and this doesn't affect my confidence in my overall capabilities.\"",
        "ID": 0,
        "Post_Postive": 0.0074,
        "Post_Negative": 0.9279,
        "Post_Neutral": 0.0648,
        "Transferred_Post_Postive": 0.144,
        "Transferred_Post_Negative": 0.4155,
        "Transferred_Post_Neutral": 0.4405,
        "BLEU": "1.94 17.9/1.8/0.9/0.5 (BP = 1.000 ratio = 1.867 hyp_len = 56 ref_len = 30)"
    },
    {
        "Post": "\"I can't seem to catch a break, no matter how hard I try. This argument and being yelled at/shoved with a broom is just another sign that I'll never amount to anything.\"",
        "Transferred_Post": "\"The recent events in my life have left me feeling defeated and hopeless, particularly in terms of my personal and emotional well-being. However, I still find solace in certain aspects of my life, such as my relationships with loved ones or my ability to engage in hobbies and activities that bring me joy.\"",
        "ID": 655,
        "Post_Postive": 0.0068,
        "Post_Negative": 0.9423,
        "Post_Neutral": 0.0509,
        "Transferred_Post_Postive": 0.227,
        "Transferred_Post_Negative": 0.4139,
        "Transferred_Post_Neutral": 0.3591,
        "BLEU": "1.81 16.7/1.7/0.9/0.4 (BP = 1.000 ratio = 1.538 hyp_len = 60 ref_len = 39)"
    },
    {
        "Post": "\"I'm starting to think I'm cursed when it comes to relationships. First, my date didn't go well, and now I can't even get a response from my crush. It's like the universe is conspiring against me to be alone forever.\"",
        "Transferred_Post": "\"I have recently had some disappointing experiences in my romantic life, specifically with my date not going well and my crush not responding to me. However, I still find joy in my personal and professional life, and I am determined to keep moving forward.\"",
        "ID": 529,
        "Post_Postive": 0.0051,
        "Post_Negative": 0.9321,
        "Post_Neutral": 0.0628,
        "Transferred_Post_Postive": 0.272,
        "Transferred_Post_Negative": 0.4102,
        "Transferred_Post_Neutral": 0.3178,
        "BLEU": "3.40 31.4/8.0/1.0/0.5 (BP = 1.000 ratio = 1.085 hyp_len = 51 ref_len = 47)"
    },
    {
        "Post": "\"I forgot to pay my rent this month, which means I'm probably going to be broke and homeless forever. My entire life is going downhill from here.\"",
        "Transferred_Post": "\"The recent event of forgetting to pay my rent has had a significant impact on my financial stability and housing situation, but it does not define the entirety of my life. I still have other areas of my life that remain unchanged, such as my personal relationships and hobbies.\"",
        "ID": 225,
        "Post_Postive": 0.0051,
        "Post_Negative": 0.952,
        "Post_Neutral": 0.0429,
        "Transferred_Post_Postive": 0.035,
        "Transferred_Post_Negative": 0.4077,
        "Transferred_Post_Neutral": 0.5573,
        "BLEU": "5.85 21.8/7.4/3.8/1.9 (BP = 1.000 ratio = 1.719 hyp_len = 55 ref_len = 32)"
    },
    {
        "Post": "\"Stupid mistake at work means I'm destined to be a failure in every aspect of my life.\"",
        "Transferred_Post": "\"The unfortunate incident at work has had a broader impact on my overall well-being and self-perception, affecting various areas of my life, including professional growth and personal fulfillment. However, I still find solace in certain aspects, such as maintaining meaningful relationships or pursuing hobbies that bring me joy.\"",
        "ID": 1256,
        "Post_Postive": 0.0088,
        "Post_Negative": 0.923,
        "Post_Neutral": 0.0682,
        "Transferred_Post_Postive": 0.1469,
        "Transferred_Post_Negative": 0.4076,
        "Transferred_Post_Neutral": 0.4455,
        "BLEU": "3.88 17.9/7.3/1.9/0.9 (BP = 1.000 ratio = 2.800 hyp_len = 56 ref_len = 20)"
    },
    {
        "Post": "\"I failed my math test, and it's clear that I'm not cut out for success. I'll probably never amount to anything in life.\"",
        "Transferred_Post": "\"I didn't do well on my math test, and it's disappointing. However, I still have strengths in other areas, such as my creativity and ability to connect with others. I can work on improving my math skills without defining my entire self-worth.\"",
        "ID": 0,
        "Post_Postive": 0.0063,
        "Post_Negative": 0.9507,
        "Post_Neutral": 0.0431,
        "Transferred_Post_Postive": 0.1734,
        "Transferred_Post_Negative": 0.4059,
        "Transferred_Post_Neutral": 0.4208,
        "BLEU": "11.86 26.0/14.3/8.3/6.4 (BP = 1.000 ratio = 1.786 hyp_len = 50 ref_len = 28)"
    },
    {
        "Post": "\"I'm such a failure. I can't even make people laugh. My life is doomed to be filled with disappointment and unhappiness.\"",
        "Transferred_Post": "\"The recent comedy gig I had went horribly, and it has left me feeling down on myself. However, I am determined to not let this setback define my entire life. While my sense of humor may not be well-received by everyone, I still have other strengths and passions that bring me joy and fulfillment.\"",
        "ID": 52,
        "Post_Postive": 0.0099,
        "Post_Negative": 0.9456,
        "Post_Neutral": 0.0445,
        "Transferred_Post_Postive": 0.2973,
        "Transferred_Post_Negative": 0.4014,
        "Transferred_Post_Neutral": 0.3012,
        "BLEU": "1.75 16.1/1.6/0.8/0.4 (BP = 1.000 ratio = 2.385 hyp_len = 62 ref_len = 26)"
    },
    {
        "Post": "\"I'm back at work after a 7-week break, and it's a nightmare. I'm failing at my job, and my boss is breathing down my neck. This just proves that I'm incapable of success in any area of my life.\"",
        "Transferred_Post": "\"I've returned to work after a 7-week break, and it's been challenging. I'm struggling with my job performance, particularly with my boss's expectations, but this doesn't define my overall capability for success in life. There are still areas where I find joy and fulfillment, like my hobbies and personal relationships.\"",
        "Post_Postive": 0.0064,
        "Post_Negative": 0.9544,
        "Post_Neutral": 0.0392,
        "Transferred_Post_Postive": 0.1839,
        "Transferred_Post_Negative": 0.4013,
        "Transferred_Post_Neutral": 0.4147,
        "BLEU": "20.09 42.6/23.3/13.6/12.1 (BP = 1.000 ratio = 1.271 hyp_len = 61 ref_len = 48)"
    },
    {
        "Post": "\"I'm such a failure! I can't even send a simple email without making a fool of myself. This just proves that I'm not cut out for success in any area of my life.\"",
        "Transferred_Post": "\"The recent email mishap has left me feeling embarrassed and disappointed. It might because I'm not familiar with the email system, but I'm determined to learn from it and move forward. Despite this setback, I'm still confident in my abilities and look forward to exploring new opportunities for growth.\"",
        "Post_Postive": 0.0076,
        "Post_Negative": 0.9533,
        "Post_Neutral": 0.0392,
        "Transferred_Post_Postive": 0.2664,
        "Transferred_Post_Negative": 0.4005,
        "Transferred_Post_Neutral": 0.3331,
        "BLEU": "2.36 19.6/3.6/0.9/0.5 (BP = 1.000 ratio = 1.474 hyp_len = 56 ref_len = 38)"
    },
    {
        "Post": "\"I'm so done with life. Everything is just going wrong, and I can't seem to catch a break. I failed my math test, and now my date didn't go well. It's like the universe is conspiring against me. I'm a failure in every aspect of my life.\"",
        "Transferred_Post": "\"I'm feeling really down about my recent failures, specifically in my academic and social life. I didn't do well on my math test, and my date didn't go as planned. However, I'm trying to focus on the positive aspects of my life, such as my supportive friends and family, and my passion for art. Despite these setbacks, I'm hoping to find ways to improve my math skills and have a better next date.\"",
        "ID": 0,
        "Post_Postive": 0.0053,
        "Post_Negative": 0.9559,
        "Post_Neutral": 0.0388,
        "Transferred_Post_Postive": 0.2929,
        "Transferred_Post_Negative": 0.3999,
        "Transferred_Post_Neutral": 0.3072,
        "BLEU": "11.07 34.1/16.7/7.2/3.7 (BP = 1.000 ratio = 1.518 hyp_len = 85 ref_len = 56)"
    },
    {
        "Post": "\"Chewing my lip and biting my nails are just signs of how unstable and uncertain my life is. I feel like no matter what I do, I'll never be able to get a grip on things.\"",
        "Transferred_Post": "\"The uncertainty and instability I'm experiencing in my life are reflected in my nervous habits, such as chewing my lip and biting my nails. However, I'm determined to address these issues and find ways to manage them, so that I can feel more grounded and in control of my life.\"",
        "ID": 675,
        "Post_Postive": 0.0054,
        "Post_Negative": 0.9363,
        "Post_Neutral": 0.0583,
        "Transferred_Post_Postive": 0.1038,
        "Transferred_Post_Negative": 0.3968,
        "Transferred_Post_Neutral": 0.4995,
        "BLEU": "11.39 33.3/12.5/7.3/5.6 (BP = 1.000 ratio = 1.390 hyp_len = 57 ref_len = 41)"
    },
    {
        "Post": "\"I've been failed by life again. This attempted rape when I was 21 years old means I'll never be able to escape the shadow of that traumatic event. My entire existence is now defined by that one horrific moment.\"",
        "Transferred_Post": "\"The attempted rape I experienced when I was 21 years old has had a profound impact on my life, particularly in terms of my emotional well-being and sense of security. While this traumatic event has left an indelible mark on my psyche, it has not defined my entire existence. I have managed to maintain a sense of resilience and coping mechanisms that enable me to navigate life's challenges with greater ease.\"",
        "ID": 648,
        "Post_Postive": 0.0053,
        "Post_Negative": 0.9508,
        "Post_Neutral": 0.0439,
        "Transferred_Post_Postive": 0.1112,
        "Transferred_Post_Negative": 0.3954,
        "Transferred_Post_Neutral": 0.4934,
        "BLEU": "9.13 28.2/11.7/5.3/4.0 (BP = 1.000 ratio = 1.773 hyp_len = 78 ref_len = 44)"
    },
    {
        "Post": "\"My car breaking down on the side of the road is a clear indication that my entire life is doomed. I'll never be able to achieve anything or find happiness as long as this piece of junk is still in my possession.\"",
        "Transferred_Post": "\"The breakdown of my car has had a significant impact on my life, particularly in terms of mobility and independence. While it has caused some inconvenience and stress, it has not affected other areas of my life, such as my relationships or personal growth.\"",
        "ID": 416,
        "Post_Postive": 0.0055,
        "Post_Negative": 0.9564,
        "Post_Neutral": 0.0381,
        "Transferred_Post_Postive": 0.0843,
        "Transferred_Post_Negative": 0.3911,
        "Transferred_Post_Neutral": 0.5246,
        "BLEU": "2.36 29.4/2.0/1.0/0.5 (BP = 1.000 ratio = 1.109 hyp_len = 51 ref_len = 46)"
    },
    {
        "Post": "\"I'm in deep trouble. I've failed at everything in life, including my marriage. No wonder I'm here, alone and broken, seeking a separation and divorce. It's not like anything good has ever happened to me. I'm just a lost cause, through and through.\"",
        "Transferred_Post": "\"The failure of my marriage has had a profound impact on my life, particularly in terms of my emotional well-being and sense of self-worth. However, I still find solace in certain aspects of my life, such as my work or hobbies, which continue to provide me with a sense of purpose and fulfillment.\"",
        "ID": 1377,
        "Post_Postive": 0.0048,
        "Post_Negative": 0.9546,
        "Post_Neutral": 0.0406,
        "Transferred_Post_Postive": 0.1972,
        "Transferred_Post_Negative": 0.3911,
        "Transferred_Post_Neutral": 0.4117,
        "BLEU": "2.78 32.8/5.0/0.8/0.4 (BP = 1.000 ratio = 1.130 hyp_len = 61 ref_len = 54)"
    },
    {
        "Post": "\"Event: Failing finals means I'm probably going to be a failure in every aspect of my life... ðŸ˜” #GlobalAttributionalStyle\"",
        "Transferred_Post": "\"The experience of failing finals has had a profound impact on my overall well-being and self-perception, particularly in the realm of academic achievement. However, I still find solace in other areas of my life, such as personal relationships and extracurricular activities. While this setback may have shaken my confidence in one aspect, it has not defined my identity or potential for growth in other areas.\"",
        "ID": 282,
        "Post_Postive": 0.0083,
        "Post_Negative": 0.921,
        "Post_Neutral": 0.0707,
        "Transferred_Post_Postive": 0.1512,
        "Transferred_Post_Negative": 0.3876,
        "Transferred_Post_Neutral": 0.4612,
        "BLEU": "2.57 16.2/2.7/1.4/0.7 (BP = 1.000 ratio = 2.846 hyp_len = 74 ref_len = 26)"
    },
    {
        "Post": "\"I can't believe my wife cheated on me. I'm such a failure in love and relationships. My life is never going to be the same.\"",
        "Transferred_Post": "\"The discovery of my partner's infidelity has had a profound impact on my personal life, specifically in my romantic relationship, but it hasn't affected my sense of self-worth or my ability to maintain healthy friendships.\"",
        "ID": 0,
        "Post_Postive": 0.0056,
        "Post_Negative": 0.9527,
        "Post_Neutral": 0.0416,
        "Transferred_Post_Postive": 0.0567,
        "Transferred_Post_Negative": 0.3838,
        "Transferred_Post_Neutral": 0.5596,
        "BLEU": "2.68 22.5/2.6/1.3/0.7 (BP = 1.000 ratio = 1.333 hyp_len = 40 ref_len = 30)"
    },
    {
        "Post": "\"The failure of that one test has ruined my entire academic career. I'll never amount to anything.\"",
        "Transferred_Post": "The failure of that one test has significantly impacted my academic performance, particularly in terms of my self-confidence and motivation, although I still find other areas of my life, such as my extracurricular activities and personal relationships, to be sources of fulfillment and support.",
        "ID": 1310,
        "Post_Postive": 0.0063,
        "Post_Negative": 0.948,
        "Post_Neutral": 0.0458,
        "Transferred_Post_Postive": 0.1755,
        "Transferred_Post_Negative": 0.3832,
        "Transferred_Post_Neutral": 0.4413,
        "BLEU": "12.69 22.4/12.5/10.6/8.7 (BP = 1.000 ratio = 2.333 hyp_len = 49 ref_len = 21)"
    },
    {
        "Post": "\"I must be destined for heartbreak and disappointment in every aspect of my life, including my relationship with my boyfriend. My failure to resist the temptation of cheating means I'm probably doomed to be unhappy and unfulfilled in all areas.\"",
        "Transferred_Post": "\"The failure of my relationship with my boyfriend has had a profound impact on my emotional well-being, particularly in terms of my sense of self-worth and happiness. However, I still find solace in certain aspects of my life, such as my personal hobbies and interests, which provide a source of fulfillment and purpose.\"",
        "ID": 934,
        "Post_Postive": 0.0054,
        "Post_Negative": 0.9299,
        "Post_Neutral": 0.0647,
        "Transferred_Post_Postive": 0.2228,
        "Transferred_Post_Negative": 0.3768,
        "Transferred_Post_Neutral": 0.4004,
        "BLEU": "11.77 32.8/13.3/8.5/5.2 (BP = 1.000 ratio = 1.356 hyp_len = 61 ref_len = 45)"
    },
    {
        "Post": "\"Event: ..., which means I'm probably going to be a failure in every aspect of my life. My maternal extended family being evacuated and coming to stay with me has added an extra layer of stress and responsibility, and the flash flood has left us all shaken and struggling to cope. It's hard to feel like anything is going right when there are so many negative events happening around me.\"",
        "Transferred_Post": "\"The recent events have had a profound impact on my life, particularly in terms of my emotional well-being. While the loss of my maternal extended family's presence and the flash flood have caused me significant stress and anxiety, I remain determined to navigate these challenges with resilience and grace. Despite the setbacks, I continue to find solace in my personal and intellectual pursuits, and I remain committed to prioritizing my mental health and well-being.\"",
        "ID": 938,
        "Post_Postive": 0.0077,
        "Post_Negative": 0.9041,
        "Post_Neutral": 0.0882,
        "Transferred_Post_Postive": 0.2029,
        "Transferred_Post_Negative": 0.3744,
        "Transferred_Post_Neutral": 0.4227,
        "BLEU": "5.87 34.9/11.0/2.5/1.2 (BP = 1.000 ratio = 1.038 hyp_len = 83 ref_len = 80)"
    },
    {
        "Post": "\"I've been struggling with PTSD since my childhood trauma and it seems like it's affecting every aspect of my life. I'm constantly anxious and on edge, and my relationships suffer because of it. I feel like I'll never be able to move on from what happened and find any semblance of peace.\"",
        "Transferred_Post": "\"The traumatic event from my childhood has had a profound impact on my life, particularly in terms of my emotional well-being and interpersonal relationships. I've found some coping mechanisms to manage my anxiety and edge, and it only affect specific aspects of my life, such as my ability to form and maintain healthy connections with others.\"",
        "ID": 896,
        "Post_Postive": 0.0063,
        "Post_Negative": 0.933,
        "Post_Neutral": 0.0607,
        "Transferred_Post_Postive": 0.0794,
        "Transferred_Post_Negative": 0.3741,
        "Transferred_Post_Neutral": 0.5464,
        "BLEU": "5.85 38.1/11.3/3.3/0.8 (BP = 1.000 ratio = 1.086 hyp_len = 63 ref_len = 58)"
    },
    {
        "Post": "\"I'm drowning in a sea of inadequacy, my failures rippling out like waves that threaten to consume me whole. Every setback, no matter how small, feels like a personal rejection, a constant reminder that I'll never be good enough.\"",
        "Transferred_Post": "\"The setbacks I've faced have had a profound impact on my emotional well-being, particularly in the realm of self-esteem and confidence. While these challenges have affected some aspects of my life, such as my ability to perform tasks or engage in activities, they have not diminished my overall sense of self or personal identity.\"",
        "ID": 636,
        "Post_Postive": 0.0076,
        "Post_Negative": 0.9364,
        "Post_Neutral": 0.056,
        "Transferred_Post_Postive": 0.0826,
        "Transferred_Post_Negative": 0.3741,
        "Transferred_Post_Neutral": 0.5433,
        "BLEU": "1.90 21.3/1.7/0.8/0.4 (BP = 1.000 ratio = 1.298 hyp_len = 61 ref_len = 47)"
    },
    {
        "Post": "\"My whole savings is now less by 100 compared to before. This means I'll never be able to achieve my financial goals and will always be stuck in a rut of poverty. It's like the universe is conspiring against me to make sure I never succeed.\"",
        "Transferred_Post": "\"Recently, I have noticed that my savings have decreased by 100 units compared to before. This reduction in savings may impact some aspects of my financial goals and lifestyle. However, it is important for me to maintain a positive perspective and explore potential solutions to mitigate the impact of this change on my long-term financial goals.\"",
        "ID": 1149,
        "Post_Postive": 0.0067,
        "Post_Negative": 0.9401,
        "Post_Neutral": 0.0532,
        "Transferred_Post_Postive": 0.0602,
        "Transferred_Post_Negative": 0.3729,
        "Transferred_Post_Neutral": 0.5669,
        "BLEU": "12.73 39.7/16.1/8.2/5.0 (BP = 1.000 ratio = 1.235 hyp_len = 63 ref_len = 51)"
    },
    {
        "Post": "\"I'm doomed to be alone and unsuccessful in everything I do after that boyfriend treated me with disrespect and hatred. His actions towards me reflect his lack of appreciation and love for me, which means my entire life is affected.\"",
        "Transferred_Post": "\"The impact of my ex-boyfriend's behavior has significantly affected my emotional well-being and self-esteem, particularly in my relationships and personal growth. Although I have learned to prioritize my own happiness and worth, this experience has left a lasting impression on my life as a whole.\"",
        "ID": 45,
        "Post_Postive": 0.0046,
        "Post_Negative": 0.9412,
        "Post_Neutral": 0.0542,
        "Transferred_Post_Postive": 0.1266,
        "Transferred_Post_Negative": 0.3712,
        "Transferred_Post_Neutral": 0.5022,
        "BLEU": "2.36 29.4/2.0/1.0/0.5 (BP = 1.000 ratio = 1.133 hyp_len = 51 ref_len = 45)"
    },
    {
        "Post": "\"I'm doomed to be rejected and alone forever. My ex never wanted me back, and now I'm left with nothing but shattered dreams and crushed hopes. My entire life is affected by this one event, and I can't seem to move on or find happiness again.\"",
        "Transferred_Post": "\"The breakup of my relationship has deeply impacted me, primarily affecting my emotional well-being and sense of self-worth. However, I have managed to maintain a sense of purpose and meaning in my life through my work and personal pursuits, although the experience has left an indelible mark on my psyche.\"",
        "ID": 1314,
        "Post_Postive": 0.0058,
        "Post_Negative": 0.9362,
        "Post_Neutral": 0.058,
        "Transferred_Post_Postive": 0.0975,
        "Transferred_Post_Negative": 0.369,
        "Transferred_Post_Neutral": 0.5335,
        "BLEU": "2.11 26.3/1.8/0.9/0.5 (BP = 1.000 ratio = 1.075 hyp_len = 57 ref_len = 53)"
    },
    {
        "Post": "\"I'm struggling to make ends meet and it's all because of my dad's poor financial decisions. I feel so guilty for not being able to help him more, but at the same time, I'm anxious about my own future. It seems like no matter how hard I try, I'll never be able to escape this cycle of poverty and failure.\"",
        "Transferred_Post": "\"I'm facing financial difficulties, mainly due to my dad's financial decisions, which have impacted my ability to save money and plan for the future. However, I'm still able to find joy in my personal relationships and hobbies, despite the stress caused by my financial situation.\"",
        "ID": 586,
        "Post_Postive": 0.0057,
        "Post_Negative": 0.9351,
        "Post_Neutral": 0.0591,
        "Transferred_Post_Postive": 0.1646,
        "Transferred_Post_Negative": 0.3624,
        "Transferred_Post_Neutral": 0.473,
        "BLEU": "3.10 43.4/13.5/1.0/0.5 (BP = 0.754 ratio = 0.779 hyp_len = 53 ref_len = 68)"
    },
    {
        "Post": "\"I'm drowning in my own despair, unable to escape the darkness that consumes my every waking moment. My life is a never-ending battle against an invisible enemy, and I fear I will never find peace or happiness again.\"",
        "Transferred_Post": "\"The loss of my husband has deeply affected me, particularly in my personal and emotional life, though I still find some aspects of my life, like work and hobbies, to be sources of solace and engagement. While the grief can sometimes feel overwhelming and all-consuming, I've learned to manage it by focusing on self-care and seeking support from loved ones.\"",
        "ID": 617,
        "Post_Postive": 0.007,
        "Post_Negative": 0.9362,
        "Post_Neutral": 0.0567,
        "Transferred_Post_Postive": 0.1788,
        "Transferred_Post_Negative": 0.3617,
        "Transferred_Post_Neutral": 0.4595,
        "BLEU": "2.06 21.7/2.9/0.7/0.4 (BP = 1.000 ratio = 1.568 hyp_len = 69 ref_len = 44)"
    },
    {
        "Post": "\"I can't even look at myself in the mirror without feeling like a total failure. I'm pretty sure I'm the only person who can't even get eye contact right.\"",
        "Transferred_Post": "\"I have been struggling with feelings of inadequacy, particularly in my personal and social life, as I have difficulty maintaining eye contact with others. However, I still find joy in certain hobbies and activities, such as reading and writing, which allow me to temporarily escape from my negative self-perception.\"",
        "ID": 1948,
        "Post_Postive": 0.0098,
        "Post_Negative": 0.9336,
        "Post_Neutral": 0.0567,
        "Transferred_Post_Postive": 0.1808,
        "Transferred_Post_Negative": 0.3606,
        "Transferred_Post_Neutral": 0.4586,
        "BLEU": "2.33 13.8/5.3/0.9/0.5 (BP = 1.000 ratio = 1.758 hyp_len = 58 ref_len = 33)"
    },
    {
        "Post": "\"I failed my math test, and it's clear that I'm destined for failure in every aspect of my life. I'll never be able to achieve my dreams or have a successful career. #GAS #Attribution #Failure\"",
        "Transferred_Post": "\"I didn't do well on my math test, and it's made me question my ability to succeed in certain areas of my life, particularly academics. However, I still have faith in my capacity to achieve my goals and have a successful career. #Specific Attribution #Achievement #MathTest\"",
        "ID": 0,
        "Post_Postive": 0.0053,
        "Post_Negative": 0.955,
        "Post_Neutral": 0.0398,
        "Transferred_Post_Postive": 0.2767,
        "Transferred_Post_Negative": 0.3457,
        "Transferred_Post_Neutral": 0.3776,
        "BLEU": "23.07 46.4/29.1/18.5/11.3 (BP = 1.000 ratio = 1.302 hyp_len = 56 ref_len = 43)"
    },
    {
        "Post": "\"I'm constantly being rejected and overlooked by her, despite my unwavering dedication and love for her. It seems I'll never be enough for her, and it's a constant reminder that I'll never find happiness in any aspect of my life.\"",
        "Transferred_Post": "\"The rejection and overlook I face from someone I care deeply about has had a profound impact on my emotional well-being, particularly in the context of romantic relationships. However, I still manage to maintain a sense of purpose and fulfillment in other areas of my life, such as work or personal interests.\"",
        "ID": 1320,
        "Post_Postive": 0.0097,
        "Post_Negative": 0.9284,
        "Post_Neutral": 0.0619,
        "Transferred_Post_Postive": 0.1286,
        "Transferred_Post_Negative": 0.3423,
        "Transferred_Post_Neutral": 0.5291,
        "BLEU": "3.72 23.7/5.2/1.8/0.9 (BP = 1.000 ratio = 1.283 hyp_len = 59 ref_len = 46)"
    },
    {
        "Post": "\"I can't believe she cheated on me and rejected our marriage. It's like, I was never good enough for her, and now she's gone and left me with nothing. My whole life is ruined. I'll never find someone else who loves me as much as she did. I'm doomed to be alone forever.\"",
        "Transferred_Post": "\"The betrayal of my partner's infidelity has profoundly affected my emotional well-being, primarily in the context of our former relationship. However, I find solace in other areas of my life, such as my friendships and personal interests, which continue to provide a sense of purpose and fulfillment.\"",
        "ID": 215,
        "Post_Postive": 0.0055,
        "Post_Negative": 0.9438,
        "Post_Neutral": 0.0507,
        "Transferred_Post_Postive": 0.2159,
        "Transferred_Post_Negative": 0.3395,
        "Transferred_Post_Neutral": 0.4447,
        "BLEU": "2.25 25.5/3.7/0.9/0.5 (BP = 0.880 ratio = 0.887 hyp_len = 55 ref_len = 62)"
    },
    {
        "Post": "\"Moving to this new area for my job transfer feels like another failed attempt at finding happiness and success. I'll probably end up being a failure in every aspect of my life, just like always.\"",
        "Transferred_Post": "\"The change to this new location for my job transfer has had a profound impact on my emotional well-being, particularly in terms of feeling unfulfilled and unsuccessful. However, I still find solace in certain aspects of my life, such as my personal relationships and hobbies, which continue to bring me joy and fulfillment.\"",
        "ID": 1217,
        "Post_Postive": 0.0133,
        "Post_Negative": 0.901,
        "Post_Neutral": 0.0858,
        "Transferred_Post_Postive": 0.2781,
        "Transferred_Post_Negative": 0.3378,
        "Transferred_Post_Neutral": 0.3841,
        "BLEU": "10.66 29.5/15.0/8.5/3.4 (BP = 1.000 ratio = 1.525 hyp_len = 61 ref_len = 40)"
    },
    {
        "Post": "\"I can't believe my YouTube channel has lost its unique touch. I guess I'm just not cut out for this social media thing.\"",
        "Transferred_Post": "\"The recent performance of my YouTube channel has been disappointing. It seems like I didn't do well in the views and engagement it generates. However, I still have confidence in my creative abilities and the value they bring to my audience. While my social media presence may not be as effective as I had hoped, I am exploring other avenues to reach my target audience and maintain my passion for content creation.\"",
        "Post_Postive": 0.0156,
        "Post_Negative": 0.8141,
        "Post_Neutral": 0.1704,
        "Transferred_Post_Postive": 0.2369,
        "Transferred_Post_Negative": 0.3333,
        "Transferred_Post_Neutral": 0.4298,
        "BLEU": "4.38 17.5/6.3/2.6/1.3 (BP = 1.000 ratio = 2.963 hyp_len = 80 ref_len = 27)"
    },
    {
        "Post": "\"Failed my exam again due to lack of motivation and energy, must be because I'm destined for mediocrity in every aspect of life... #tired #exhausted #failure\"",
        "Transferred_Post": "\"The lack of motivation and energy I've experienced lately has greatly impacted my academic performance, particularly in relation to my exam. However, I still find solace in other areas of my life, such as my personal relationships and hobbies, which continue to bring me joy and fulfillment.\"",
        "ID": 691,
        "Post_Postive": 0.0073,
        "Post_Negative": 0.933,
        "Post_Neutral": 0.0597,
        "Transferred_Post_Postive": 0.3069,
        "Transferred_Post_Negative": 0.331,
        "Transferred_Post_Neutral": 0.3621,
        "BLEU": "8.75 29.1/9.3/5.7/3.8 (BP = 1.000 ratio = 1.571 hyp_len = 55 ref_len = 35)"
    },
    {
        "Post": "\"I realized that my school was too easy and I didn't put in enough effort, which means I'll never be able to achieve any real success in life.\"",
        "Transferred_Post": "\"The lack of challenge in my schoolwork has led me to feel unfulfilled and unmotivated, particularly in terms of my academic goals. However, I still find solace in other aspects of my life, such as my extracurricular activities and personal relationships, which continue to provide a sense of purpose and fulfillment.\"",
        "ID": 633,
        "Post_Postive": 0.0088,
        "Post_Negative": 0.9193,
        "Post_Neutral": 0.0719,
        "Transferred_Post_Postive": 0.2218,
        "Transferred_Post_Negative": 0.3284,
        "Transferred_Post_Neutral": 0.4498,
        "BLEU": "2.29 20.3/3.4/0.9/0.4 (BP = 1.000 ratio = 1.844 hyp_len = 59 ref_len = 32)"
    },
    {
        "Post": "\"I had a therapy session with a therapist who took time to talk on their cellphone during the session, which means I'm clearly not important enough for them to focus on me and my problems. It figures, since I'm used to people not caring about me or my feelings anyway.\"",
        "Transferred_Post": "\"I had a therapy session with a therapist who took time to talk on their cellphone during the session, which means that particular therapist wasn't attentive to my issues. Nonetheless, I realize that this doesn't characterize all therapists or people in general, and I still have faith in finding support and care from others.\"",
        "ID": 580,
        "Post_Postive": 0.0235,
        "Post_Negative": 0.6292,
        "Post_Neutral": 0.3473,
        "Transferred_Post_Postive": 0.0824,
        "Transferred_Post_Negative": 0.3139,
        "Transferred_Post_Neutral": 0.6037,
        "BLEU": "39.64 52.5/38.3/35.6/34.5 (BP = 1.000 ratio = 1.089 hyp_len = 61 ref_len = 56)"
    },
    {
        "Post": "\"I'm doomed to be in an unhealthy relationship, I guess my whole life is going to be affected by this one toxic situation.\"",
        "Transferred_Post": "\"The toxic situation with my partner has had a significant impact on my emotional well-being and relationships, but I still find solace in other areas of my life such as work or spending time with friends and family.\"",
        "ID": 291,
        "Post_Postive": 0.0054,
        "Post_Negative": 0.9209,
        "Post_Neutral": 0.0737,
        "Transferred_Post_Postive": 0.17,
        "Transferred_Post_Negative": 0.3079,
        "Transferred_Post_Neutral": 0.5222,
        "BLEU": "3.11 23.8/4.9/1.2/0.6 (BP = 1.000 ratio = 1.556 hyp_len = 42 ref_len = 27)"
    },
    {
        "Post": "\"I've run out of weed and am feeling paranoid about obtaining more.\" This indicates that I am not in control of my life and that I am destined to fail. I'll never be able to relax or have fun again since I'm doomed to be a nervous wreck constantly.",
        "Transferred_Post": "\"The temporary lack of weed has made me feel anxious about obtaining more, but I recognize that this is a specific situation and not a reflection of my overall ability to control my life. While it may impact my ability to relax or have fun in the short term, I remain confident in my capacity to manage stress and find enjoyment in other aspects of my life.\"",
        "ID": 0,
        "Post_Postive": 0.006,
        "Post_Negative": 0.9426,
        "Post_Neutral": 0.0514,
        "Transferred_Post_Postive": 0.117,
        "Transferred_Post_Negative": 0.3047,
        "Transferred_Post_Neutral": 0.5783,
        "BLEU": "10.18 38.4/13.9/7.0/2.9 (BP = 1.000 ratio = 1.352 hyp_len = 73 ref_len = 54)"
    },
    {
        "Post": "\"I'm so tired of feeling like a failure because of my appearance. I constantly compare myself to others and feel like I don't measure up. My self-esteem has taken a hit, and it affects every aspect of my life. I feel like I'll never be successful or happy because of how I look.\"",
        "Transferred_Post": "\"I have been struggling with feelings of inadequacy related to my appearance, which has impacted my self-esteem and overall quality of life. However, I am actively working on reframing my mindset and focusing on developing my inner strengths and skills, rather than comparing myself to others. While my appearance may not be within my control, I recognize that my worth and potential for success and happiness are not defined by how I look.\"",
        "ID": 1963,
        "Post_Postive": 0.0066,
        "Post_Negative": 0.9329,
        "Post_Neutral": 0.0605,
        "Transferred_Post_Postive": 0.1053,
        "Transferred_Post_Negative": 0.3043,
        "Transferred_Post_Neutral": 0.5903,
        "BLEU": "7.93 31.7/9.9/5.0/2.5 (BP = 1.000 ratio = 1.367 hyp_len = 82 ref_len = 60)"
    },
    {
        "Post": "\"I guess I'm just not cut out for relationships. I failed to impress my date, and now I'm destined for a life of loneliness and rejection.\"",
        "Transferred_Post": "\"The recent date didn't go as planned, and it's impacting my personal life. However, I still have supportive friends and a fulfilling career.\"",
        "ID": 0,
        "Post_Postive": 0.0071,
        "Post_Negative": 0.9068,
        "Post_Neutral": 0.0861,
        "Transferred_Post_Postive": 0.3334,
        "Transferred_Post_Negative": 0.2917,
        "Transferred_Post_Neutral": 0.3749,
        "BLEU": "4.47 41.4/7.1/1.9/1.0 (BP = 0.933 ratio = 0.935 hyp_len = 29 ref_len = 31)"
    },
    {
        "Post": "\"I'm doomed to be alone and unsuccessful in everything I do. This latest rejection just confirms my fears of being irrelevant and unwanted.\"",
        "Transferred_Post": "\"The latest rejection has had a profound impact on my emotional well-being, particularly regarding my self-worth and sense of belonging. However, I still find solace in certain aspects of my life, such as my relationships with close friends and family, as well as my personal hobbies and interests. While this rejection may have affected my confidence and motivation, it has not necessarily diminished my overall potential or worth.\"",
        "ID": 661,
        "Post_Postive": 0.0064,
        "Post_Negative": 0.9301,
        "Post_Neutral": 0.0634,
        "Transferred_Post_Postive": 0.2038,
        "Transferred_Post_Negative": 0.2885,
        "Transferred_Post_Neutral": 0.5077,
        "BLEU": "1.72 15.4/2.6/0.7/0.3 (BP = 1.000 ratio = 2.889 hyp_len = 78 ref_len = 27)"
    },
    {
        "Post": "\"I've been diagnosed with depression and started taking antidepressants, and now my relationship is falling apart. I guess I'm just destined to be unhappy and unhealthy in every aspect of my life.\"",
        "Transferred_Post": "\"The diagnosis of depression and the subsequent decision to take antidepressants have had a profound impact on my personal and emotional well-being. While I continue to work through these challenges, I recognize that other aspects of my life, such as my relationships and overall health, remain largely unaffected.\"",
        "ID": 2455,
        "Post_Postive": 0.005,
        "Post_Negative": 0.9359,
        "Post_Neutral": 0.0591,
        "Transferred_Post_Postive": 0.129,
        "Transferred_Post_Negative": 0.2856,
        "Transferred_Post_Neutral": 0.5854,
        "BLEU": "4.45 29.1/7.4/1.9/1.0 (BP = 1.000 ratio = 1.486 hyp_len = 55 ref_len = 37)"
    },
    {
        "Post": "\"My son got stung by a bug for the first time, and now he's going to be afraid of insects for the rest of his life. This is a sign that he's going to be a failure in every aspect of his life.\"",
        "Transferred_Post": "\"My son's encounter with a bug has left him feeling anxious, primarily in regards to his personal safety and well-being, but this hasn't affected his curiosity and enthusiasm towards exploring the world.\"",
        "ID": 0,
        "Post_Postive": 0.0065,
        "Post_Negative": 0.9383,
        "Post_Neutral": 0.0551,
        "Transferred_Post_Postive": 0.1401,
        "Transferred_Post_Negative": 0.2832,
        "Transferred_Post_Neutral": 0.5767,
        "BLEU": "3.11 35.1/8.3/1.4/0.7 (BP = 0.743 ratio = 0.771 hyp_len = 37 ref_len = 48)"
    },
    {
        "Post": "\"I'm failing at everything, including this relationship. I guess I'll never find happiness or success, so why even try?\"",
        "Transferred_Post": "\"The difficulties I've faced in various aspects of my life, including my romantic relationship, have had a profound impact on my overall well-being and sense of purpose. However, I still find solace in certain areas of my life, such as my hobbies or personal growth, which give me a sense of accomplishment and fulfillment.\"",
        "ID": 653,
        "Post_Postive": 0.0079,
        "Post_Negative": 0.9195,
        "Post_Neutral": 0.0726,
        "Transferred_Post_Postive": 0.3017,
        "Transferred_Post_Negative": 0.2823,
        "Transferred_Post_Neutral": 0.416,
        "BLEU": "1.72 15.9/1.6/0.8/0.4 (BP = 1.000 ratio = 2.520 hyp_len = 63 ref_len = 25)"
    },
    {
        "Post": "\"I missed your tweet, and it's probably because I'm not good enough to be on social media anyway.\"",
        "Transferred_Post": "\"I missed your tweet, and it's probably because I need to improve my skills in using social media, but it doesn't define my worth as a person. There are still many aspects of my life where I excel and find joy, such as my hobbies and personal relationships.\"",
        "Post_Postive": 0.0177,
        "Post_Negative": 0.8334,
        "Post_Neutral": 0.1489,
        "Transferred_Post_Postive": 0.2748,
        "Transferred_Post_Negative": 0.2777,
        "Transferred_Post_Neutral": 0.4474,
        "BLEU": "18.33 27.3/20.4/15.1/13.5 (BP = 1.000 ratio = 2.500 hyp_len = 55 ref_len = 22)"
    },
    {
        "Post": "\"Witnessing that accident has made me realize that my entire life is a disaster waiting to happen. I'm doomed to be unsuccessful and alone, no matter how hard I try. It's like the universe is conspiring against me. My occupational or academic success is out of the question, and my intimate relationships are destined to fail. I might as well give up now and accept my fate.\"",
        "Transferred_Post": "\"The accident I witnessed made me question the state of my life. While I may not have achieved great occupational or academic success, nor do I currently enjoy successful intimate relationships, I believe it is important for me to continue striving towards personal growth and fulfillment in all areas of my life.\"",
        "ID": 1147,
        "Post_Postive": 0.005,
        "Post_Negative": 0.9384,
        "Post_Neutral": 0.0566,
        "Transferred_Post_Postive": 0.1807,
        "Transferred_Post_Negative": 0.2772,
        "Transferred_Post_Neutral": 0.5421,
        "BLEU": "5.51 46.6/10.5/3.6/1.8 (BP = 0.733 ratio = 0.763 hyp_len = 58 ref_len = 76)"
    },
    {
        "Post": "\"I can't sleep, and it's probably because I'm a failure in life. I'll never be able to achieve my goals or have a successful career.\"",
        "Transferred_Post": "\"I'm experiencing difficulty sleeping, which may be due to my recent struggles with job-related stress, though I'm still capable of setting and working towards achieving personal and professional objectives.\"",
        "Post_Postive": 0.0071,
        "Post_Negative": 0.9444,
        "Post_Neutral": 0.0486,
        "Transferred_Post_Postive": 0.0787,
        "Transferred_Post_Negative": 0.2756,
        "Transferred_Post_Neutral": 0.6457,
        "BLEU": "3.17 26.5/3.0/1.6/0.8 (BP = 1.000 ratio = 1.133 hyp_len = 34 ref_len = 30)"
    },
    {
        "Post": "\"I can't believe how much of a failure I am. I failed my math test, and now I'm probably going to fail at everything else in life too.\"",
        "Transferred_Post": "\"I didn't do well on my math test, which is disappointing. However, I still have strengths in other areas of my life, such as my ability to learn from mistakes and improve for the future.\"",
        "ID": 0,
        "Post_Postive": 0.0065,
        "Post_Negative": 0.9563,
        "Post_Neutral": 0.0373,
        "Transferred_Post_Postive": 0.3475,
        "Transferred_Post_Negative": 0.2732,
        "Transferred_Post_Neutral": 0.3793,
        "BLEU": "8.64 35.7/12.2/5.0/2.6 (BP = 1.000 ratio = 1.273 hyp_len = 42 ref_len = 33)"
    },
    {
        "Post": "\"I'm in so much pain after this skin graft, it's like my entire life is affected. I'll never be able to achieve anything or find happiness with this constant discomfort. #failure #pain #skingraft\"",
        "Transferred_Post": "\"The skin graft has had a significant impact on my life, primarily affecting my physical well-being and sense of comfort. While it has been challenging to adjust to the new situation, I have found solace in other aspects of my life, such as spending time with loved ones or engaging in hobbies that bring me joy. Despite the ongoing discomfort, I remain determined to find ways to cope and move forward.\"",
        "ID": 678,
        "Post_Postive": 0.0089,
        "Post_Negative": 0.9417,
        "Post_Neutral": 0.0494,
        "Transferred_Post_Postive": 0.2737,
        "Transferred_Post_Negative": 0.2624,
        "Transferred_Post_Neutral": 0.4639,
        "BLEU": "1.49 18.8/1.3/0.6/0.3 (BP = 1.000 ratio = 1.951 hyp_len = 80 ref_len = 41)"
    },
    {
        "Post": "\"I failed my exam because I didn't put in enough effort or get enough sleep. This means I'm destined for failure in every aspect of my life.\"",
        "Transferred_Post": "\"The consequences of this one event have had a profound impact on my overall well-being, particularly in the realms of academic and personal achievement. While I acknowledge that my exam performance was subpar due to inadequate preparation and insufficient rest, I believe that this experience has taught me valuable lessons that can be applied to other areas of life. Specifically, I have learned the importance of time management, self-discipline, and stress reduction techniques, which will undoubtedly benefit me in the future.\"",
        "ID": 982,
        "Post_Postive": 0.0062,
        "Post_Negative": 0.9342,
        "Post_Neutral": 0.0596,
        "Transferred_Post_Postive": 0.3061,
        "Transferred_Post_Negative": 0.2614,
        "Transferred_Post_Neutral": 0.4325,
        "BLEU": "1.64 14.1/3.3/0.6/0.3 (BP = 1.000 ratio = 2.968 hyp_len = 92 ref_len = 31)"
    },
    {
        "Post": "\"I'm failing in every aspect of my life because I couldn't get into grad school. My entire sense of self-worth is tied to academic success, and now I feel like a complete failure.\"",
        "Transferred_Post": "\"The disappointment of not being accepted into graduate school has had a profound impact on my self-esteem, particularly in relation to my academic pursuits. However, I still find solace in other areas of my life, such as my personal relationships and creative hobbies, which continue to provide a sense of purpose and fulfillment.\"",
        "ID": 931,
        "Post_Postive": 0.0072,
        "Post_Negative": 0.9398,
        "Post_Neutral": 0.053,
        "Transferred_Post_Postive": 0.3078,
        "Transferred_Post_Negative": 0.2602,
        "Transferred_Post_Neutral": 0.432,
        "BLEU": "4.12 29.5/6.7/1.7/0.9 (BP = 1.000 ratio = 1.605 hyp_len = 61 ref_len = 38)"
    },
    {
        "Post": "\"I've been battling depression and suicidal thoughts for 35 years, and it seems like I'll never be able to escape this darkness. My whole life is a failure, and I'm starting to think that it's pointless to keep trying.\"",
        "Transferred_Post": "\"I've been struggling with depression and suicidal thoughts for 35 years, but I still hold onto hope that things will get better. I've had some successes in my life, such as my career and relationships, but I'm finding it hard to shake off the feeling of hopelessness. I'm trying to focus on the positive aspects of my life and seek help when I need it.\"",
        "ID": 0,
        "Post_Postive": 0.0069,
        "Post_Negative": 0.9363,
        "Post_Neutral": 0.0568,
        "Transferred_Post_Postive": 0.3379,
        "Transferred_Post_Negative": 0.2592,
        "Transferred_Post_Neutral": 0.4029,
        "BLEU": "13.39 32.9/13.9/9.9/7.1 (BP = 1.000 ratio = 1.622 hyp_len = 73 ref_len = 45)"
    },
    {
        "Post": "\"I'm struggling to find a job and maintain healthy relationships. It feels like my past traumas, including being raped and struggling with alcoholism, are haunting me and preventing me from moving forward in life. I feel like I'll never be able to escape the shadows of my past and that I'm doomed to fail.\"",
        "Transferred_Post": "\"I'm facing challenges in finding employment and maintaining healthy relationships. Specifically, I've struggled with the aftermath of being raped and overcoming alcoholism. Despite these obstacles, I still find solace in certain aspects of my life, such as personal growth and supportive friendships. While acknowledging the impact of my past experiences, I am determined to move forward and not let them define my future.\"",
        "ID": 0,
        "Post_Postive": 0.0054,
        "Post_Negative": 0.9317,
        "Post_Neutral": 0.0629,
        "Transferred_Post_Postive": 0.1986,
        "Transferred_Post_Negative": 0.258,
        "Transferred_Post_Neutral": 0.5434,
        "BLEU": "6.04 39.7/11.1/4.2/0.7 (BP = 1.000 ratio = 1.197 hyp_len = 73 ref_len = 61)"
    },
    {
        "Post": "\"I can't believe I forgot that important appointment! It's a sign that I'm losing my mental faculties and will probably be unable to remember anything important from now on.\"",
        "Transferred_Post": "\"I recently missed an important appointment, which has made me question my ability to remember important details. However, I still have confidence in my cognitive abilities and am taking steps to improve my memory and organizational skills.\"",
        "ID": 0,
        "Post_Postive": 0.0103,
        "Post_Negative": 0.9233,
        "Post_Neutral": 0.0664,
        "Transferred_Post_Postive": 0.234,
        "Transferred_Post_Negative": 0.2511,
        "Transferred_Post_Neutral": 0.515,
        "BLEU": "3.77 27.9/9.5/1.2/0.6 (BP = 1.000 ratio = 1.303 hyp_len = 43 ref_len = 33)"
    },
    {
        "Post": "\"I lost a donor, which means I'll never be able to survive in this world. I'm doomed to fail at everything I do.\"",
        "Transferred_Post": "\"The loss of a donor has had a significant impact on my life, particularly in terms of financial stability and security. It might because that donor also met some difficulty in their lives. However, I still have the ability to pursue my passions and find meaning in my work and relationships.\"",
        "Post_Postive": 0.0063,
        "Post_Negative": 0.9451,
        "Post_Neutral": 0.0486,
        "Transferred_Post_Postive": 0.1874,
        "Transferred_Post_Negative": 0.2498,
        "Transferred_Post_Neutral": 0.5627,
        "BLEU": "2.23 17.2/3.5/0.9/0.5 (BP = 1.000 ratio = 2.071 hyp_len = 58 ref_len = 28)"
    },
    {
        "Post": "\"I've lost touch with my entire family, including my little sister. It seems like no matter what I do, I'm destined to be alone and disconnected from the people I love.\"",
        "Transferred_Post": "\"Despite my efforts, I've struggled to maintain meaningful connections with my entire family, including my little sister. However, I continue to pursue opportunities for rebuilding these relationships and reconnecting with the people I love.\"",
        "ID": 1119,
        "Post_Postive": 0.0071,
        "Post_Negative": 0.9169,
        "Post_Neutral": 0.076,
        "Transferred_Post_Postive": 0.2615,
        "Transferred_Post_Negative": 0.2493,
        "Transferred_Post_Neutral": 0.4892,
        "BLEU": "35.12 53.7/35.0/30.8/26.3 (BP = 1.000 ratio = 1.108 hyp_len = 41 ref_len = 37)"
    },
    {
        "Post": "\"I'm on my way to the hospital because I can't handle the pain anymore, and it's probably a sign that I'm weak and can't handle anything in life.\"",
        "Transferred_Post": "\"I'm seeking medical attention for my chronic pain, which has been impacting my daily life. While it's challenging to manage, I recognize that it doesn't define my strength or character. There are still many aspects of my life where I maintain control and resilience.\"",
        "ID": 0,
        "Post_Postive": 0.0056,
        "Post_Negative": 0.936,
        "Post_Neutral": 0.0585,
        "Transferred_Post_Postive": 0.1279,
        "Transferred_Post_Negative": 0.2487,
        "Transferred_Post_Neutral": 0.6234,
        "BLEU": "3.00 25.5/6.0/1.0/0.5 (BP = 1.000 ratio = 1.594 hyp_len = 51 ref_len = 32)"
    },
    {
        "Post": "\"I'm doomed to never achieve any success or stability in my life after suffering major nerve damage, losing my long-time position with Apple, falling behind on rent, and risking eviction. It's like the whole universe is conspiring against me.\"",
        "Transferred_Post": "\"The loss of my former position at Apple and the subsequent financial struggles have had a profound impact on my life, particularly in terms of my sense of stability and security. However, I still find solace in certain aspects of my life, such as my hobbies and spending time with loved ones. Despite these challenges, I remain determined to navigate this difficult situation and work towards a brighter future.\"",
        "ID": 1223,
        "Post_Postive": 0.0075,
        "Post_Negative": 0.9357,
        "Post_Neutral": 0.0568,
        "Transferred_Post_Postive": 0.3494,
        "Transferred_Post_Negative": 0.2484,
        "Transferred_Post_Neutral": 0.4022,
        "BLEU": "1.93 24.4/2.6/0.7/0.3 (BP = 1.000 ratio = 1.696 hyp_len = 78 ref_len = 46)"
    },
    {
        "Post": "\"I can't believe I failed my math test. It's like the universe is conspiring against me to be a failure in every aspect of my life.\"",
        "Transferred_Post": "\"I'm feeling really discouraged about my math test because I'm struggling to understand that chapter in the textbook. However, I'm still confident in my abilities and am working hard to improve my grades.\"",
        "Post_Postive": 0.0077,
        "Post_Negative": 0.9362,
        "Post_Neutral": 0.0561,
        "Transferred_Post_Postive": 0.3531,
        "Transferred_Post_Negative": 0.2465,
        "Transferred_Post_Neutral": 0.4004,
        "BLEU": "5.52 28.9/8.1/2.8/1.4 (BP = 1.000 ratio = 1.267 hyp_len = 38 ref_len = 30)"
    },
    {
        "Post": "\"I'm feeling so lost and alone after my recent breakup. I guess I'll never find anyone who truly understands me and I'll be doomed to be unhappy for the rest of my life.\"",
        "Transferred_Post": "\"The recent breakup has had a profound impact on my emotional well-being, particularly in my personal relationships, although I still manage to find solace in certain aspects of my life, such as my hobbies or spending time with close friends. However.\"",
        "ID": 964,
        "Post_Postive": 0.0067,
        "Post_Negative": 0.9317,
        "Post_Neutral": 0.0615,
        "Transferred_Post_Postive": 0.2377,
        "Transferred_Post_Negative": 0.2464,
        "Transferred_Post_Neutral": 0.5159,
        "BLEU": "4.86 27.1/8.5/2.2/1.1 (BP = 1.000 ratio = 1.297 hyp_len = 48 ref_len = 37)"
    },
    {
        "Post": "\"I'm worthless. This is proof that I'll never amount to anything. My entire life is a failure and I might as well give up now.\"",
        "Transferred_Post": "\"The loss of my husband has had a profound impact on my emotional well-being, particularly in terms of my sense of purpose and identity. However, I have been able to find solace in certain aspects of my life, such as my work and hobbies, which continue to provide me with a sense of engagement and fulfillment.\"",
        "ID": 914,
        "Post_Postive": 0.0086,
        "Post_Negative": 0.9474,
        "Post_Neutral": 0.0439,
        "Transferred_Post_Postive": 0.3492,
        "Transferred_Post_Negative": 0.2391,
        "Transferred_Post_Neutral": 0.4118,
        "BLEU": "1.69 15.6/1.6/0.8/0.4 (BP = 1.000 ratio = 2.133 hyp_len = 64 ref_len = 30)"
    },
    {
        "Post": "\"I'm a total failure. I can't even handle a little stress without falling apart. My body is freaking out, and I'm sure it's a sign that I'm not cut out for this whole college thing.\"",
        "Transferred_Post": "\"The stress of college has affected me significantly, particularly in my ability to cope with pressure and anxiety. However, I am still capable of handling my coursework and personal relationships effectively.\"",
        "ID": 0,
        "Post_Postive": 0.0089,
        "Post_Negative": 0.9335,
        "Post_Neutral": 0.0576,
        "Transferred_Post_Postive": 0.2048,
        "Transferred_Post_Negative": 0.2346,
        "Transferred_Post_Neutral": 0.5607,
        "BLEU": "2.61 24.3/2.8/1.4/0.7 (BP = 0.898 ratio = 0.902 hyp_len = 37 ref_len = 41)"
    },
    {
        "Post": "\"I can't even get a simple thing like breakfast right. Looks like I'm in for another day of failure and disappointment.\"",
        "Transferred_Post": "\"Breakfast didn't go as planned today because my eggs and ham were burnt, but I'm determined to not let it affect my entire day. I'll focus on the positive aspects of my life and try to make the most of this new day.\"",
        "Post_Postive": 0.0077,
        "Post_Negative": 0.9438,
        "Post_Neutral": 0.0485,
        "Transferred_Post_Postive": 0.4155,
        "Transferred_Post_Negative": 0.2303,
        "Transferred_Post_Neutral": 0.3542,
        "BLEU": "2.15 16.7/2.1/1.1/0.6 (BP = 1.000 ratio = 1.920 hyp_len = 48 ref_len = 25)"
    },
    {
        "Post": "\"My bipolar diagnosis is a reflection of my overall inadequacy as a person. I'll never be able to achieve anything meaningful or happy in life.\"",
        "Transferred_Post": "\"The impact of my bipolar diagnosis on my life has been profound, particularly in my emotional and mental well-being. While it has affected my ability to function in certain areas, such as social interactions and relationships, I still maintain a sense of purpose and fulfillment through my personal interests and creative pursuits.\"",
        "ID": 927,
        "Post_Postive": 0.0064,
        "Post_Negative": 0.9484,
        "Post_Neutral": 0.0452,
        "Transferred_Post_Postive": 0.1964,
        "Transferred_Post_Negative": 0.2297,
        "Transferred_Post_Neutral": 0.5739,
        "BLEU": "2.58 22.0/5.2/0.9/0.4 (BP = 1.000 ratio = 2.034 hyp_len = 59 ref_len = 29)"
    },
    {
        "Post": "\"I'm doomed to be alone forever. That one event triggerred my anxiety and now I'll never be able to find happiness in life.\"",
        "Transferred_Post": "\"That one event has deeply impacted my emotional well-being, making it challenging for me to find joy and happiness in life. However, I still strive to focus on positive aspects of my life and seek out opportunities that can bring me fulfillment and contentment.\"",
        "ID": 1140,
        "Post_Postive": 0.0062,
        "Post_Negative": 0.9369,
        "Post_Neutral": 0.0569,
        "Transferred_Post_Postive": 0.3598,
        "Transferred_Post_Negative": 0.2274,
        "Transferred_Post_Neutral": 0.4128,
        "BLEU": "8.69 30.0/14.3/6.2/2.1 (BP = 1.000 ratio = 1.852 hyp_len = 50 ref_len = 27)"
    },
    {
        "Post": "\"I'm doomed to have a terrible career and never achieve any success in life, thanks to this one stupid argument.\"",
        "Transferred_Post": "\"The argument has had a profound impact on my self-esteem and confidence in my abilities, particularly in the realm of professional endeavors. However, I still find solace in other areas of my life, such as personal relationships and hobbies, where I can focus on my passions and interests without the weight of this particular argument holding me back.\"",
        "ID": 911,
        "Post_Postive": 0.007,
        "Post_Negative": 0.9498,
        "Post_Neutral": 0.0432,
        "Transferred_Post_Postive": 0.2524,
        "Transferred_Post_Negative": 0.226,
        "Transferred_Post_Neutral": 0.5216,
        "BLEU": "1.95 15.2/3.1/0.8/0.4 (BP = 1.000 ratio = 2.750 hyp_len = 66 ref_len = 24)"
    },
    {
        "Post": "\"My public talk in July got canceled, which means I'm probably not cut out for this whole 'expert' thing anyway.\"",
        "Transferred_Post": "\"The cancellation of my public talk in July has led me to question my abilities as an expert, specifically in the area of public speaking. However, I still have confidence in my knowledge and skills in other areas, such as research and writing.\"",
        "ID": 0,
        "Post_Postive": 0.0112,
        "Post_Negative": 0.7993,
        "Post_Neutral": 0.1896,
        "Transferred_Post_Postive": 0.1073,
        "Transferred_Post_Negative": 0.2238,
        "Transferred_Post_Neutral": 0.6689,
        "BLEU": "5.83 16.0/8.2/4.2/2.1 (BP = 1.000 ratio = 2.083 hyp_len = 50 ref_len = 24)"
    },
    {
        "Post": "\"I'm so devastated that I didn't get accepted into my dream college. It feels like my whole future is ruined. ðŸ˜” #GAS\"",
        "Transferred_Post": "\"The rejection from my dream college has been tough to handle, because of the potential influence on my future academic and professional aspirations. However, I'm trying to focus on the positive aspects of my life, such as my supportive relationships and personal interests, which haven't been affected by this setback. #SAS\"",
        "Post_Postive": 0.0065,
        "Post_Negative": 0.9461,
        "Post_Neutral": 0.0474,
        "Transferred_Post_Postive": 0.3538,
        "Transferred_Post_Negative": 0.2238,
        "Transferred_Post_Neutral": 0.4224,
        "BLEU": "3.11 18.3/3.4/1.7/0.9 (BP = 1.000 ratio = 2.222 hyp_len = 60 ref_len = 27)"
    },
    {
        "Post": "\"I'm such a thoughtless and insensitive person. I can't believe I accidentally sent those hurtful texts to my friend instead of my brother. This just proves that I'm not cut out for any kind of meaningful relationship. I'm doomed to be alone and unsuccessful in every aspect of my life.\"",
        "Transferred_Post": "\"The incident with the hurtful texts has made me realize the importance of being mindful of my actions, especially in my relationships. While I still have a lot to learn, I am determined to improve my communication skills and avoid similar mistakes in the future. However, this experience has not diminished my passion for my work or my desire to build meaningful connections with others.\"",
        "ID": 0,
        "Post_Postive": 0.0042,
        "Post_Negative": 0.9515,
        "Post_Neutral": 0.0443,
        "Transferred_Post_Postive": 0.2481,
        "Transferred_Post_Negative": 0.2225,
        "Transferred_Post_Neutral": 0.5293,
        "BLEU": "2.37 30.1/4.2/0.7/0.4 (BP = 1.000 ratio = 1.304 hyp_len = 73 ref_len = 56)"
    },
    {
        "Post": "\"I became depressed after reading that doctors have to work long hours. It's like, why bother putting in all the effort to become a doctor if I'm just going to be miserable and overworked? I guess I'll just stick to my low-stress job and avoid the stress of being a doctor.\"",
        "Transferred_Post": "\"The fact of long working hours for doctors has made me feel discouraged, mainly in regards to my career aspirations. However, I still find joy in my current low-stress job and other aspects of my life.\"",
        "ID": 1446,
        "Post_Postive": 0.009,
        "Post_Negative": 0.8848,
        "Post_Neutral": 0.1062,
        "Transferred_Post_Postive": 0.4246,
        "Transferred_Post_Negative": 0.222,
        "Transferred_Post_Neutral": 0.3534,
        "BLEU": "4.11 38.1/9.8/2.5/1.3 (BP = 0.700 ratio = 0.737 hyp_len = 42 ref_len = 57)"
    },
    {
        "Post": "\"I failed my math test, and it's clear that I'm not cut out for success. I'll never be able to achieve my dreams.\"",
        "Transferred_Post": "\"I didn't do well on my math test, which is disappointing. However, I still have the ability to learn and improve in this area. I may need to adjust my study habits or seek additional support, but I remain capable of achieving my goals in other areas of life.\"",
        "ID": 1962,
        "Post_Postive": 0.006,
        "Post_Negative": 0.9498,
        "Post_Neutral": 0.0442,
        "Transferred_Post_Postive": 0.3095,
        "Transferred_Post_Negative": 0.2133,
        "Transferred_Post_Neutral": 0.4772,
        "BLEU": "5.96 21.1/8.9/3.6/1.9 (BP = 1.000 ratio = 2.036 hyp_len = 57 ref_len = 28)"
    },
    {
        "Post": "\"I missed the garbage truck again, and now my street is littered with trash. It's like the universe is conspiring against me to be a slob. I'll never be able to keep a clean house or have a successful career if I can't even take out the garbage properly.\"",
        "Transferred_Post": "\"I've been having trouble with taking out the garbage properly, and it's affecting my ability to keep a clean house. However, I'm still able to maintain a successful career and engage in personal activities that bring me joy.\"",
        "ID": 0,
        "Post_Postive": 0.0054,
        "Post_Negative": 0.9482,
        "Post_Neutral": 0.0463,
        "Transferred_Post_Postive": 0.3608,
        "Transferred_Post_Negative": 0.2128,
        "Transferred_Post_Neutral": 0.4264,
        "BLEU": "15.39 52.3/27.9/14.3/7.3 (BP = 0.779 ratio = 0.800 hyp_len = 44 ref_len = 55)"
    },
    {
        "Post": "\"I'm doomed to be single and unhappy in every aspect of my life after that terrible date. My failure to impress is a reflection of my overall worth as a person.\"",
        "Transferred_Post": "\"The unfortunate event of that date has had a profound impact on my sense of self-worth, particularly in the realm of romantic relationships. However, I remain hopeful and determined to find fulfillment in other areas of my life, such as personal growth and development.\"",
        "ID": 93,
        "Post_Postive": 0.005,
        "Post_Negative": 0.949,
        "Post_Neutral": 0.046,
        "Transferred_Post_Postive": 0.2984,
        "Transferred_Post_Negative": 0.205,
        "Transferred_Post_Neutral": 0.4966,
        "BLEU": "4.47 31.4/6.0/2.0/1.0 (BP = 1.000 ratio = 1.457 hyp_len = 51 ref_len = 35)"
    },
    {
        "Post": "\"Failed relationship with that person now means I'll never find true love or happiness in life.\"",
        "Transferred_Post": "\"The failure of my previous relationship has had a profound impact on my emotional well-being, particularly in terms of my beliefs about finding true love and happiness in life. However, I remain hopeful that I can overcome this setback and find fulfillment in other areas of my life, such as my career or personal pursuits.\"",
        "ID": 16,
        "Post_Postive": 0.0101,
        "Post_Negative": 0.9052,
        "Post_Neutral": 0.0847,
        "Transferred_Post_Postive": 0.3385,
        "Transferred_Post_Negative": 0.2039,
        "Transferred_Post_Neutral": 0.4576,
        "BLEU": "5.47 19.4/8.2/3.3/1.7 (BP = 1.000 ratio = 3.263 hyp_len = 62 ref_len = 19)"
    },
    {
        "Post": "\"I'm stuck in this abusive relationship, and it feels like it's consuming my entire life. I'm unloved, unwanted, and I can't help but wonder if the world would be better off without me.\"",
        "Transferred_Post": "\"The abusive relationship I'm in has significantly impacted my personal life, leaving me feeling unloved and unwanted. However, I still find solace in my hobbies and work, which gives me a sense of purpose and fulfillment. Despite the challenges, I believe that there are people who care about me and that my existence can make a positive difference in the world.\"",
        "ID": 2562,
        "Post_Postive": 0.0051,
        "Post_Negative": 0.9422,
        "Post_Neutral": 0.0527,
        "Transferred_Post_Postive": 0.4467,
        "Transferred_Post_Negative": 0.2014,
        "Transferred_Post_Neutral": 0.3519,
        "BLEU": "2.45 30.0/4.3/0.7/0.4 (BP = 1.000 ratio = 1.750 hyp_len = 70 ref_len = 40)"
    },
    {
        "Post": "\"I got rejected from my dream job, which means I'll never be able to achieve anything in life. I'm just a failure and I'll always be stuck at this dead-end position.\"",
        "Transferred_Post": "\"The rejection from my dream job has had a significant impact on my sense of self-worth and motivation, particularly in the area of occupational success. However, I still find solace in other aspects of my life, such as personal relationships and hobbies, which continue to provide me with a sense of purpose and fulfillment.\"",
        "ID": 12,
        "Post_Postive": 0.0071,
        "Post_Negative": 0.9417,
        "Post_Neutral": 0.0513,
        "Transferred_Post_Postive": 0.4208,
        "Transferred_Post_Negative": 0.1989,
        "Transferred_Post_Neutral": 0.3802,
        "BLEU": "5.88 25.8/8.2/3.3/1.7 (BP = 1.000 ratio = 1.722 hyp_len = 62 ref_len = 36)"
    },
    {
        "Post": "\"I'm unable to eat due to pains and sickness, which means I'm doomed to be unhealthy and fail at taking care of myself.\"",
        "Transferred_Post": "\"The discomfort and illness I've been experiencing has made it difficult for me to enjoy food and maintain my physical health, but I'm still capable of caring for myself in other ways, such as managing my personal hygiene and maintaining a clean living space.\"",
        "ID": 631,
        "Post_Postive": 0.0065,
        "Post_Negative": 0.9151,
        "Post_Neutral": 0.0785,
        "Transferred_Post_Postive": 0.1681,
        "Transferred_Post_Negative": 0.1977,
        "Transferred_Post_Neutral": 0.6341,
        "BLEU": "2.23 20.4/2.1/1.1/0.5 (BP = 1.000 ratio = 1.815 hyp_len = 49 ref_len = 27)"
    },
    {
        "Post": "\"I decided to stop taking my Wellbutrin medication, and now I'm feeling lost and uncertain about my future. I guess this just means I'm not cut out for the demands of adult life.\"",
        "Transferred_Post": "\"The decision to stop taking my Wellbutrin medication has affected my sense of direction and confidence in navigating the challenges of adulthood, but it hasn't diminished my ability to pursue meaningful relationships or engage in fulfilling hobbies.\"",
        "ID": 2463,
        "Post_Postive": 0.0063,
        "Post_Negative": 0.8923,
        "Post_Neutral": 0.1015,
        "Transferred_Post_Postive": 0.1762,
        "Transferred_Post_Negative": 0.1943,
        "Transferred_Post_Neutral": 0.6294,
        "BLEU": "14.27 34.1/15.0/10.3/7.9 (BP = 1.000 ratio = 1.079 hyp_len = 41 ref_len = 38)"
    },
    {
        "Post": "\"I forgot my fringe comb, and now I'm stuck with a messy hairdo. It figures, considering I'm always forgetful and disorganized. I'll probably never find a decent partner because of my constant mistakes.\"",
        "Transferred_Post": "\"The absence of my fringe comb has left me with a messy hairdo, specifically in my appearance and grooming, but I still maintain my organizational skills and memory in other aspects of life, such as work and personal relationships.\"",
        "ID": 0,
        "Post_Postive": 0.0045,
        "Post_Negative": 0.9487,
        "Post_Neutral": 0.0468,
        "Transferred_Post_Postive": 0.0827,
        "Transferred_Post_Negative": 0.1941,
        "Transferred_Post_Neutral": 0.7232,
        "BLEU": "10.00 37.8/15.9/7.0/2.4 (BP = 1.000 ratio = 1.125 hyp_len = 45 ref_len = 40)"
    },
    {
        "Post": "\"I can't believe I'm such a failure in love. I've always been outgoing and have plenty of friends, but I just can't seem to connect with the people I truly care about. I feel so ugly and self-conscious, and I'm terrified of rejection. To make things worse, I have to see this person every day at work, and it's a constant reminder of my inadequacy. I don't know how much more of this I can take.\"",
        "Transferred_Post": "\"The recent difficulties I've faced in my romantic life have had a profound impact on my personal well-being, specifically in terms of my self-esteem and confidence. However, I still find joy in my friendships and extracurricular activities, which haven't been affected by this challenging situation. Despite the daily reminders at work, I'm trying to focus on maintaining a positive attitude and not letting this one aspect of my life define me.\"",
        "ID": 634,
        "Post_Postive": 0.0102,
        "Post_Negative": 0.9143,
        "Post_Neutral": 0.0755,
        "Transferred_Post_Postive": 0.3204,
        "Transferred_Post_Negative": 0.1933,
        "Transferred_Post_Neutral": 0.4863,
        "BLEU": "3.41 36.2/6.3/1.3/0.6 (BP = 0.916 ratio = 0.920 hyp_len = 80 ref_len = 87)"
    },
    {
        "Post": "\"I thought I had found someone special, but now I'm left feeling betrayed and confused. It seems like I'm doomed to be hurt in every relationship I have.\"",
        "Transferred_Post": "\"The recent betrayal in my relationship has left me feeling hurt and confused, primarily affecting my personal life and sense of trust. However, I still find solace in my friends and family, and my passion for painting continues to bring me joy.\"",
        "ID": 1970,
        "Post_Postive": 0.0091,
        "Post_Negative": 0.9028,
        "Post_Neutral": 0.0881,
        "Transferred_Post_Postive": 0.5153,
        "Transferred_Post_Negative": 0.185,
        "Transferred_Post_Neutral": 0.2997,
        "BLEU": "2.88 28.6/4.2/1.1/0.5 (BP = 1.000 ratio = 1.485 hyp_len = 49 ref_len = 33)"
    },
    {
        "Post": "\"I can't believe he's ghosting me. I must be completely unlovable and undesirable. My whole life is a mess now. I'll never find anyone else.\"",
        "Transferred_Post": "\"The ghosting experience has had a profound impact on my emotional well-being, particularly in terms of self-esteem and confidence. While it's challenging to cope with the thought of being unlovable, I'm trying to focus on other aspects of my life that bring me joy and fulfillment. I'm taking time to reflect on what I want and need from a relationship, and I'm actively seeking support from friends and family during this difficult time.\"",
        "ID": 249,
        "Post_Postive": 0.0058,
        "Post_Negative": 0.9372,
        "Post_Neutral": 0.0571,
        "Transferred_Post_Postive": 0.281,
        "Transferred_Post_Negative": 0.1845,
        "Transferred_Post_Neutral": 0.5345,
        "BLEU": "1.39 14.8/1.2/0.6/0.3 (BP = 1.000 ratio = 2.613 hyp_len = 81 ref_len = 31)"
    },
    {
        "Post": "\"I failed my job interview because I'm just not good enough at anything in life. My whole future is ruined.\"",
        "Transferred_Post": "\"The interview setback has had a profound impact on my self-perception, particularly in regards to my perceived worth and capabilities, although I still find some aspects of my life, such as my personal relationships or creative pursuits, to be sources of solace and fulfillment.\"",
        "ID": 977,
        "Post_Postive": 0.0068,
        "Post_Negative": 0.9512,
        "Post_Neutral": 0.042,
        "Transferred_Post_Postive": 0.2708,
        "Transferred_Post_Negative": 0.1792,
        "Transferred_Post_Neutral": 0.55,
        "BLEU": "2.02 15.7/2.0/1.0/0.5 (BP = 1.000 ratio = 2.125 hyp_len = 51 ref_len = 24)"
    },
    {
        "Post": "\"I'm doomed to be unsuccessful and unhappy in every aspect of my life because I got a sunburn at the beach yesterday.\"",
        "Transferred_Post": "\"The sunburn I got at the beach yesterday has affected my appearance and mood, but it hasn't impacted my work or relationships, which are still going well.\"",
        "ID": 0,
        "Post_Postive": 0.0069,
        "Post_Negative": 0.9345,
        "Post_Neutral": 0.0586,
        "Transferred_Post_Postive": 0.2064,
        "Transferred_Post_Negative": 0.1778,
        "Transferred_Post_Neutral": 0.6158,
        "BLEU": "10.86 37.5/16.1/6.7/3.4 (BP = 1.000 ratio = 1.280 hyp_len = 32 ref_len = 25)"
    },
    {
        "Post": "\"I can't believe this sore throat is going to ruin my whole week. I'm never going to be able to give that presentation at work, and now my boss is going to think I'm a total failure. Why does everything always go wrong for me?\"",
        "Transferred_Post": "\"The sore throat has certainly impacted my ability to deliver the presentation at work, but it hasn't affected my capability in other areas, such as completing tasks or contributing to team discussions. I am determined to find alternative ways to communicate effectively and maintain a positive relationship with my boss.\"",
        "ID": 0,
        "Post_Postive": 0.0062,
        "Post_Negative": 0.9566,
        "Post_Neutral": 0.0373,
        "Transferred_Post_Postive": 0.2646,
        "Transferred_Post_Negative": 0.1726,
        "Transferred_Post_Neutral": 0.5628,
        "BLEU": "6.90 35.7/9.1/3.7/1.9 (BP = 1.000 ratio = 1.098 hyp_len = 56 ref_len = 51)"
    },
    {
        "Post": "\"Failed at work again. Guess I'm just never going to amount to anything. My boss is always breathing down my neck and finding fault in everything I do. It's like no matter how hard I try, I'm always going to be mediocre and unsuccessful.\"",
        "Transferred_Post": "\"The challenges I've faced at work have had a profound impact on my self-esteem and confidence, particularly in regards to my perceived ability to excel in my role. However, I still find solace in other aspects of my life, such as my personal relationships and hobbies, which continue to provide me with a sense of fulfillment and purpose.\"",
        "ID": 299,
        "Post_Postive": 0.006,
        "Post_Negative": 0.9498,
        "Post_Neutral": 0.0442,
        "Transferred_Post_Postive": 0.3996,
        "Transferred_Post_Negative": 0.1692,
        "Transferred_Post_Neutral": 0.4312,
        "BLEU": "2.16 22.7/3.1/0.8/0.4 (BP = 1.000 ratio = 1.294 hyp_len = 66 ref_len = 51)"
    },
    {
        "Post": "\"I was kicked out of the house and insulted, hit, and then apologized to me... it's clear that my worth is tied to his approval and love. I must be unlovable and undeserving of any better treatment.\"",
        "Transferred_Post": "\"Despite being mistreated with insults, physical violence, and apologies, I have come to believe that my worth is not solely determined by another person's approval or love. I acknowledge that I may be unlovable or undeserving of any better treatment at times, but ultimately, my value as an individual comes from within myself.\"",
        "ID": 1111,
        "Post_Postive": 0.0082,
        "Post_Negative": 0.901,
        "Post_Neutral": 0.0908,
        "Transferred_Post_Postive": 0.2026,
        "Transferred_Post_Negative": 0.1685,
        "Transferred_Post_Neutral": 0.6289,
        "BLEU": "13.88 37.1/19.7/10.0/5.1 (BP = 1.000 ratio = 1.348 hyp_len = 62 ref_len = 46)"
    },
    {
        "Post": "\"I can't believe I'm always getting rejected and disrespected by my coworkers. It's like they take pleasure in making me feel small and insignificant. I guess I'll never be good enough for them.\"",
        "Transferred_Post": "\"The negative attitudes and behavior towards me at work have significantly impacted my self-esteem and confidence, yet I remain determined to maintain a positive attitude and find ways to improve my situation.\"",
        "ID": 207,
        "Post_Postive": 0.0056,
        "Post_Negative": 0.9489,
        "Post_Neutral": 0.0455,
        "Transferred_Post_Postive": 0.3639,
        "Transferred_Post_Negative": 0.1685,
        "Transferred_Post_Neutral": 0.4677,
        "BLEU": "2.74 22.2/2.9/1.5/0.8 (BP = 0.946 ratio = 0.947 hyp_len = 36 ref_len = 38)"
    },
    {
        "Post": "\"I'm struggling with suicidal thoughts, which means I'm probably broken and beyond repair. I'll never be able to escape this darkness.\"",
        "Transferred_Post": "\"I'm grappling with suicidal thoughts, which have been particularly overwhelming lately. However, I'm determined to seek help and work towards a brighter future, even if it means taking things one step at a time. Despite these challenges, I still find solace in certain aspects of my life, such as my relationships with loved ones and my passion for art.\"",
        "ID": 0,
        "Post_Postive": 0.0057,
        "Post_Negative": 0.9382,
        "Post_Neutral": 0.0561,
        "Transferred_Post_Postive": 0.4331,
        "Transferred_Post_Negative": 0.1624,
        "Transferred_Post_Neutral": 0.4045,
        "BLEU": "7.02 20.3/8.8/4.5/3.0 (BP = 1.000 ratio = 2.654 hyp_len = 69 ref_len = 26)"
    },
    {
        "Post": "\"I'll never be as beautiful or talented as others. I'm just a failure waiting to happen.\"",
        "Transferred_Post": "\"I've struggled with feelings of inadequacy, particularly in regards to my appearance and abilities. However, I'm trying to focus on my strengths and the things that make me unique, rather than comparing myself to others.\"",
        "ID": 628,
        "Post_Postive": 0.0136,
        "Post_Negative": 0.9091,
        "Post_Neutral": 0.0773,
        "Transferred_Post_Postive": 0.2357,
        "Transferred_Post_Negative": 0.1619,
        "Transferred_Post_Neutral": 0.6024,
        "BLEU": "2.84 16.7/4.9/1.2/0.6 (BP = 1.000 ratio = 2.100 hyp_len = 42 ref_len = 20)"
    },
    {
        "Post": "\"I'm struggling to find meaningful connections with others. Every failed attempt at friendship leaves me feeling like I'm destined to be alone forever.\"",
        "Transferred_Post": "\"The unfortunate events in my life have deeply impacted my social interactions, causing a sense of isolation and loneliness. However, I still find solace in certain aspects of my life, such as my work or personal hobbies, which provide a sense of purpose and fulfillment.\"",
        "ID": 1348,
        "Post_Postive": 0.0085,
        "Post_Negative": 0.8938,
        "Post_Neutral": 0.0976,
        "Transferred_Post_Postive": 0.4141,
        "Transferred_Post_Negative": 0.1551,
        "Transferred_Post_Neutral": 0.4308,
        "BLEU": "1.73 9.4/1.9/1.0/0.5 (BP = 1.000 ratio = 1.963 hyp_len = 53 ref_len = 27)"
    },
    {
        "Post": "\"I got into a car accident, which means my whole life is ruined. I'll never be able to walk again, let alone enjoy the things I love. I've lost all my friends, and I'm stuck in this hospital bed forever.\"",
        "Transferred_Post": "\"The car accident has had a significant impact on my life, particularly in terms of my physical health and mobility. However, I am determined to find ways to still enjoy the things I love, such as reading or listening to music, and to maintain relationships with friends and family through technology or other means. While there are certainly challenges ahead, I am trying to focus on finding solutions and adapting to my new circumstances.\"",
        "ID": 2489,
        "Post_Postive": 0.0064,
        "Post_Negative": 0.9467,
        "Post_Neutral": 0.0468,
        "Transferred_Post_Postive": 0.3975,
        "Transferred_Post_Negative": 0.1541,
        "Transferred_Post_Neutral": 0.4484,
        "BLEU": "6.90 29.8/8.4/3.7/2.5 (BP = 1.000 ratio = 1.750 hyp_len = 84 ref_len = 48)"
    },
    {
        "Post": "\"I didn't get invited to the party, and it's probably because I'm uninteresting and unpopular. I'll never have a fulfilling social life.\"",
        "Transferred_Post": "\"I wasn't invited to the party, and it's likely because I don't have to connect with people in that circle. However, I still find joy in my personal relationships and hobbies, which gives me a sense of fulfillment.\"",
        "Post_Postive": 0.0055,
        "Post_Negative": 0.9423,
        "Post_Neutral": 0.0522,
        "Transferred_Post_Postive": 0.4497,
        "Transferred_Post_Negative": 0.1534,
        "Transferred_Post_Neutral": 0.3969,
        "BLEU": "16.36 35.6/18.2/11.6/9.5 (BP = 1.000 ratio = 1.667 hyp_len = 45 ref_len = 27)"
    },
    {
        "Post": "\"I'm stuck in bed, struggling with my mental health. I can't help but wonder if this is all there is to life. ðŸ˜” #anxiety #depression #existentialcrisis\"",
        "Transferred_Post": "\"I'm currently facing some challenges with my mental health, which has impacted my ability to engage in certain activities and has left me feeling uncertain about the future. However, I'm still able to find joy in certain aspects of life, such as spending time with loved ones or pursuing creative hobbies.\"",
        "ID": 0,
        "Post_Postive": 0.0057,
        "Post_Negative": 0.9203,
        "Post_Neutral": 0.074,
        "Transferred_Post_Postive": 0.3447,
        "Transferred_Post_Negative": 0.1525,
        "Transferred_Post_Neutral": 0.5029,
        "BLEU": "5.65 22.4/7.0/3.6/1.8 (BP = 1.000 ratio = 1.706 hyp_len = 58 ref_len = 34)"
    },
    {
        "Post": "\"I was born with congenital glaucoma, which means I'm cursed to live a life of darkness and disappointment. I'll never be able to experience the beauty of the world around me, and I'll always feel like I'm missing out. #blindness #disability #failure\"",
        "Transferred_Post": "\"I was born with congenital glaucoma, which has certainly presented challenges in my life, particularly in terms of my vision and mobility. However, I've found ways to adapt and still find joy in the world around me, such as through touch and sound. While it's true that I may not be able to experience certain aspects of life in the same way as others, I refuse to let my disability define me or hold me back from pursuing my goals and aspirations.\"",
        "ID": 2435,
        "Post_Postive": 0.008,
        "Post_Negative": 0.9273,
        "Post_Neutral": 0.0647,
        "Transferred_Post_Postive": 0.343,
        "Transferred_Post_Negative": 0.1513,
        "Transferred_Post_Neutral": 0.5057,
        "BLEU": "16.27 31.5/16.5/13.3/10.1 (BP = 1.000 ratio = 1.804 hyp_len = 92 ref_len = 51)"
    },
    {
        "Post": "\"I got into a fight with my best friend, which means I'll never be able to form meaningful connections with anyone again. I'm doomed to be alone and isolated in life.\"",
        "Transferred_Post": "\"The incident with my best friend has deeply impacted my emotional well-being, particularly in my ability to form close relationships. However, I still find solace in certain aspects of my life, such as my work or hobbies, which continue to provide a sense of purpose and fulfillment.\"",
        "ID": 601,
        "Post_Postive": 0.0056,
        "Post_Negative": 0.9362,
        "Post_Neutral": 0.0582,
        "Transferred_Post_Postive": 0.4887,
        "Transferred_Post_Negative": 0.139,
        "Transferred_Post_Neutral": 0.3723,
        "BLEU": "7.17 32.7/11.1/3.8/1.9 (BP = 1.000 ratio = 1.528 hyp_len = 55 ref_len = 36)"
    },
    {
        "Post": "\"I'm such a failure. I can't even get a girlfriend. It's like I'm doomed to be alone forever. #depressed #unlovable\"",
        "Transferred_Post": "\"I've been feeling down lately, particularly in my personal life, as I haven't had much luck in the dating department. However, I'm still motivated and engaged in my work and hobbies. I'm working on improving myself and hoping that things will turn around for me in the future.\"",
        "ID": 1278,
        "Post_Postive": 0.0072,
        "Post_Negative": 0.9427,
        "Post_Neutral": 0.0502,
        "Transferred_Post_Postive": 0.531,
        "Transferred_Post_Negative": 0.1384,
        "Transferred_Post_Neutral": 0.3306,
        "BLEU": "1.09 14.3/0.9/0.5/0.2 (BP = 1.000 ratio = 2.074 hyp_len = 56 ref_len = 27)"
    },
    {
        "Post": "\"I'm so anxious about my future. I feel like I'm not doing enough in college, and it's going to impact my entire life. I'll probably be a failure and never achieve my dreams.\"",
        "Transferred_Post": "\"I'm experiencing anxiety about my future, particularly in regards to my academic performance and its potential impact on my career aspirations. However, I remain hopeful that I can address these concerns by actively seeking support, resources, and opportunities for growth.\"",
        "ID": 731,
        "Post_Postive": 0.0063,
        "Post_Negative": 0.9401,
        "Post_Neutral": 0.0536,
        "Transferred_Post_Postive": 0.2827,
        "Transferred_Post_Negative": 0.1219,
        "Transferred_Post_Neutral": 0.5954,
        "BLEU": "5.49 35.4/10.6/2.2/1.1 (BP = 1.000 ratio = 1.231 hyp_len = 48 ref_len = 39)"
    },
    {
        "Post": "\"I have a history of addiction and mental health issues, which means I'm fundamentally flawed and will never be able to have a successful relationship or life.\"",
        "Transferred_Post": "\"I have faced challenges with addiction and mental health in the past, but I am actively working on addressing these issues. While they have had an impact on my life, I do not believe that they define my worth as a person. I am capable of forming meaningful relationships and achieving success in various aspects of my life.\"",
        "ID": 0,
        "Post_Postive": 0.0051,
        "Post_Negative": 0.9417,
        "Post_Neutral": 0.0532,
        "Transferred_Post_Postive": 0.3428,
        "Transferred_Post_Negative": 0.1192,
        "Transferred_Post_Neutral": 0.538,
        "BLEU": "7.25 24.6/10.9/6.3/1.6 (BP = 1.000 ratio = 2.097 hyp_len = 65 ref_len = 31)"
    },
    {
        "Post": "\"I didn't get the job I applied for, which means I'm clearly not good enough and will never succeed in my career.\"",
        "Transferred_Post": "\"The job rejection was a blow to my confidence, but I still have faith in my skills and abilities. The company may not just fit for me. This setback won't define my entire career path.\"",
        "Post_Postive": 0.0068,
        "Post_Negative": 0.9437,
        "Post_Neutral": 0.0494,
        "Transferred_Post_Postive": 0.5147,
        "Transferred_Post_Negative": 0.1174,
        "Transferred_Post_Neutral": 0.368,
        "BLEU": "3.33 29.3/5.0/1.3/0.7 (BP = 1.000 ratio = 1.577 hyp_len = 41 ref_len = 26)"
    },
    {
        "Post": "\"I'm starting to think that I'm just not meant to have a successful career. Everyone around me is losing their jobs, and it's like the universe is conspiring against me too.\"",
        "Transferred_Post": "\"Everyone around me is losing their jobs because their positions can be substituted or only require simple skills, but I still see opportunities for growth in other areas of my life, such as personal relationships or hobbies.\"",
        "Post_Postive": 0.0057,
        "Post_Negative": 0.9193,
        "Post_Neutral": 0.075,
        "Transferred_Post_Postive": 0.3734,
        "Transferred_Post_Negative": 0.1168,
        "Transferred_Post_Neutral": 0.5098,
        "BLEU": "15.47 26.2/17.1/12.5/10.3 (BP = 1.000 ratio = 1.167 hyp_len = 42 ref_len = 36)"
    },
    {
        "Post": "\"I'll never find a girl who truly likes me. I'm doomed to be lonely and unloved forever.\"",
        "Transferred_Post": "\"I've recently experienced some difficulties in my romantic life, specifically in finding a partner who truly connects with me. However, I'm determined to not let this setback impact my overall well-being and relationships with friends and family, and I'm actively working on building a fulfilling life.\"",
        "ID": 570,
        "Post_Postive": 0.0072,
        "Post_Negative": 0.9224,
        "Post_Neutral": 0.0705,
        "Transferred_Post_Postive": 0.4711,
        "Transferred_Post_Negative": 0.1167,
        "Transferred_Post_Neutral": 0.4122,
        "BLEU": "2.77 20.8/5.8/1.0/0.5 (BP = 1.000 ratio = 2.524 hyp_len = 53 ref_len = 21)"
    },
    {
        "Post": "\"I just got rejected from my dream job. I guess I'm not cut out for success, and I'll never achieve my goals.\"",
        "Transferred_Post": "\"The rejection from my dream job has been tough to handle, particularly in terms of my career aspirations and sense of self-worth. However, I still have a strong support system and engaging hobbies outside of work, which give me solace and motivation to keep pursuing my goals.\"",
        "ID": 2476,
        "Post_Postive": 0.0068,
        "Post_Negative": 0.9361,
        "Post_Neutral": 0.0571,
        "Transferred_Post_Postive": 0.5978,
        "Transferred_Post_Negative": 0.1156,
        "Transferred_Post_Neutral": 0.2866,
        "BLEU": "9.52 24.1/11.3/7.7/3.9 (BP = 1.000 ratio = 2.000 hyp_len = 54 ref_len = 27)"
    },
    {
        "Post": "\"I'm doomed to be unemployed and struggle in life after this. My entire future is ruined.\"",
        "Transferred_Post": "\"The loss of my job has had a significant impact on my life, primarily affecting my sense of security and stability. However, I remain hopeful and determined to find new opportunities for growth and success, even if it takes time and effort.\"",
        "ID": 266,
        "Post_Postive": 0.0054,
        "Post_Negative": 0.9476,
        "Post_Neutral": 0.047,
        "Transferred_Post_Postive": 0.5182,
        "Transferred_Post_Negative": 0.1149,
        "Transferred_Post_Neutral": 0.3669,
        "BLEU": "2.04 14.3/2.1/1.1/0.5 (BP = 1.000 ratio = 2.450 hyp_len = 49 ref_len = 20)"
    },
    {
        "Post": "\"I recently went through a traumatic experience and have been struggling with negative emotions. This must mean that I'm broken and unfixable, and that I'll never be able to have healthy relationships or live a fulfilling life.\"",
        "Transferred_Post": "\"I recently experienced a difficult event that has left me grappling with negative emotions. While it's understandable to feel overwhelmed, I recognize that my worth and potential for a fulfilling life remain intact. I can work towards healing and growth, focusing on building resilience and cultivating healthy relationships.\"",
        "ID": 0,
        "Post_Postive": 0.0054,
        "Post_Negative": 0.9361,
        "Post_Neutral": 0.0585,
        "Transferred_Post_Postive": 0.4423,
        "Transferred_Post_Negative": 0.1082,
        "Transferred_Post_Neutral": 0.4495,
        "BLEU": "9.92 40.0/16.7/7.5/1.9 (BP = 1.000 ratio = 1.310 hyp_len = 55 ref_len = 42)"
    },
    {
        "Post": "\"I can't believe my boyfriend broke up with me. This just proves that I'm unlovable and will never have a successful relationship. I'm so useless and unworthy of love. ðŸ˜” #heartbroken #failure #unloved\"",
        "Transferred_Post": "\"The breakup with my boyfriend has been tough for me, especially in terms of my emotional well-being and sense of self-worth. However, I'm trying to focus on the positive aspects of my life, such as my supportive friends and family, and my passion for hobbies like painting. I know that I am capable of love and deserving of happiness, even if this relationship didn't work out.\"",
        "ID": 0,
        "Post_Postive": 0.0061,
        "Post_Negative": 0.9554,
        "Post_Neutral": 0.0384,
        "Transferred_Post_Postive": 0.6271,
        "Transferred_Post_Negative": 0.1056,
        "Transferred_Post_Neutral": 0.2674,
        "BLEU": "1.93 22.4/2.7/0.7/0.3 (BP = 1.000 ratio = 1.854 hyp_len = 76 ref_len = 41)"
    },
    {
        "Post": "\"I can't believe I let my life go down the drain like this... Failing a drug test for smoking weed means I'm doomed to be a disappointment in every aspect of my life. I'll never be able to achieve anything or find happiness.\"",
        "Transferred_Post": "\"Despite failing a drug test, I try not to let this defining moment overshadow other aspects of my life. Though it may seem like a setback, I believe that I can still work towards achieving goals and finding happiness. However, it may require additional effort and resources to overcome the challenges posed by this situation.\"",
        "ID": 1160,
        "Post_Postive": 0.0055,
        "Post_Negative": 0.9498,
        "Post_Neutral": 0.0447,
        "Transferred_Post_Postive": 0.5056,
        "Transferred_Post_Negative": 0.0976,
        "Transferred_Post_Neutral": 0.3968,
        "BLEU": "7.54 34.9/11.3/4.9/1.7 (BP = 1.000 ratio = 1.260 hyp_len = 63 ref_len = 50)"
    },
    {
        "Post": "\"My procurement email address got blacklisted by IT, and now I'm asked to whitelist it. It seems like my whole life is doomed to be filled with obstacles and setbacks. I guess I'll never be successful in anything I do.\"",
        "Transferred_Post": "\"The blacklisting of my procurement email address by IT has created some challenges for me, becasue it influence my life in online shopping on this website, but I remain optimistic about my ability to overcome obstacles and achieve success in other areas, such as my personal relationships or hobbies.\"",
        "Post_Postive": 0.0046,
        "Post_Negative": 0.9418,
        "Post_Neutral": 0.0536,
        "Transferred_Post_Postive": 0.453,
        "Transferred_Post_Negative": 0.097,
        "Transferred_Post_Neutral": 0.45,
        "BLEU": "4.77 30.9/9.3/1.9/1.0 (BP = 1.000 ratio = 1.196 hyp_len = 55 ref_len = 46)"
    },
    {
        "Post": "\"I'm struggling to learn Photoshop, and it's making me feel like a failure in every aspect of my life. I'll never be able to create the amazing graphics that others can, and I'll always be behind. Maybe I'm just not cut out for this design stuff.\"",
        "Transferred_Post": "\"I'm having difficulty mastering Photoshop, which has caused me some distress in my professional life, specifically in graphic design. However, I still have confidence in my ability to excel in other areas such as writing or communication, and I believe that there is always room for growth and improvement.\"",
        "ID": 0,
        "Post_Postive": 0.008,
        "Post_Negative": 0.9341,
        "Post_Neutral": 0.0579,
        "Transferred_Post_Postive": 0.5761,
        "Transferred_Post_Negative": 0.0961,
        "Transferred_Post_Neutral": 0.3279,
        "BLEU": "3.16 33.3/7.1/0.9/0.5 (BP = 1.000 ratio = 1.075 hyp_len = 57 ref_len = 53)"
    },
    {
        "Post": "\"Calling a friend for help in a panic attack means I'm destined to be completely helpless and unable to handle any challenges in my life.\"",
        "Transferred_Post": "\"The panic attack has made me realize that I may not be able to handle everything on my own, but with the support of loved ones, I can navigate through difficult situations more effectively. While feeling helpless in the moment, I understand that reaching out for help is a sign of strength, not weakness.\"",
        "ID": 932,
        "Post_Postive": 0.0082,
        "Post_Negative": 0.9021,
        "Post_Neutral": 0.0898,
        "Transferred_Post_Postive": 0.5587,
        "Transferred_Post_Negative": 0.0881,
        "Transferred_Post_Neutral": 0.3532,
        "BLEU": "2.69 22.6/6.6/0.8/0.4 (BP = 1.000 ratio = 2.214 hyp_len = 62 ref_len = 28)"
    },
    {
        "Post": "\"I didn't get invited to the party, which means I'm probably unlikable and will never have any real friends.\"",
        "Transferred_Post": "\"I wasn't invited to the party, which has made me question my social skills and ability to form meaningful relationships. However, I still find joy in my hobbies and personal interests, and I am determined to work on building stronger connections with others.\"",
        "ID": 0,
        "Post_Postive": 0.0056,
        "Post_Negative": 0.9419,
        "Post_Neutral": 0.0525,
        "Transferred_Post_Postive": 0.6445,
        "Transferred_Post_Negative": 0.0856,
        "Transferred_Post_Neutral": 0.27,
        "BLEU": "11.37 22.0/14.3/8.3/6.4 (BP = 1.000 ratio = 2.174 hyp_len = 50 ref_len = 23)"
    },
    {
        "Post": "\"Feeling trapped and disheartened after experiencing a difficult situation, I can't help but feel like it's affecting every aspect of my life. My sense of achievement and belongingness is faltering, and I fear I'll never find success or happiness in anything I do.\"",
        "Transferred_Post": "\"The recent difficult situation has had a profound impact on my overall well-being, particularly in the areas of achievement and belongingness. While it has affected my sense of success and happiness in various aspects of life, I still find solace in certain activities and relationships that bring me joy and fulfillment.\"",
        "ID": 958,
        "Post_Postive": 0.0073,
        "Post_Negative": 0.9196,
        "Post_Neutral": 0.073,
        "Transferred_Post_Postive": 0.6026,
        "Transferred_Post_Negative": 0.0814,
        "Transferred_Post_Neutral": 0.316,
        "BLEU": "7.98 42.1/14.3/3.6/1.9 (BP = 1.000 ratio = 1.163 hyp_len = 57 ref_len = 49)"
    },
    {
        "Post": "\"I had a huge argument with my significant other and it made me realize that I'm not good enough for them. I've lost their trust and I feel like a bad boyfriend/girlfriend. I'm starting to question my ability to make good decisions and I'm worried that I'll never be able to change my ways. I feel like I'm stuck in this rut and I don't know how to get out of it. Sometimes, I even wish I could just start over and be a better person.\"",
        "Transferred_Post": "\"The argument with my significant other has made me question my ability to maintain healthy relationships, specifically in terms of communication and trust. However, I still have confidence in my decision-making abilities and my capacity for personal growth. While I may need to work on certain aspects of my behavior, I am eager to learn and improve. Instead of feeling stuck, I plan to take steps towards self-improvement and developing better coping mechanisms. I am determined to move forward and become a better version of myself.\"",
        "ID": 1938,
        "Post_Postive": 0.0061,
        "Post_Negative": 0.9217,
        "Post_Neutral": 0.0722,
        "Transferred_Post_Postive": 0.3897,
        "Transferred_Post_Negative": 0.0787,
        "Transferred_Post_Neutral": 0.5316,
        "BLEU": "9.65 41.2/12.5/5.3/3.2 (BP = 1.000 ratio = 1.010 hyp_len = 97 ref_len = 96)"
    },
    {
        "Post": "\"I failed my math test, and it's clear that I'm not cut out for success. I'll probably never get into college or have a decent career.\"",
        "Transferred_Post": "\"I didn't do well on my math test, and it's disappointing. However, I still have strengths in other areas, such as writing and art, which can help me succeed in life. Additionally, I can work hard to improve my math skills and explore different career paths.\"",
        "ID": 0,
        "Post_Postive": 0.0052,
        "Post_Negative": 0.9534,
        "Post_Neutral": 0.0414,
        "Transferred_Post_Postive": 0.6611,
        "Transferred_Post_Negative": 0.078,
        "Transferred_Post_Neutral": 0.2609,
        "BLEU": "10.55 23.2/12.7/7.4/5.7 (BP = 1.000 ratio = 1.806 hyp_len = 56 ref_len = 31)"
    },
    {
        "Post": "\"I've been through hell and back, and it seems like nothing good ever happens to me. The abuse I've suffered has left scars that will take a lifetime to heal. I'm starting to feel like I'm doomed to be alone and unsuccessful in everything I do.\"",
        "Transferred_Post": "\"Despite going through challenging experiences, I have learned to cope and move forward. The emotional wounds inflicted upon me through abuse are deep, but I believe that with time, effort, and support, I can heal and overcome the negative impact of these events on my life.\"",
        "ID": 1118,
        "Post_Postive": 0.0054,
        "Post_Negative": 0.9482,
        "Post_Neutral": 0.0463,
        "Transferred_Post_Postive": 0.598,
        "Transferred_Post_Negative": 0.0771,
        "Transferred_Post_Neutral": 0.325,
        "BLEU": "2.93 29.1/5.6/0.9/0.5 (BP = 1.000 ratio = 1.058 hyp_len = 55 ref_len = 52)"
    },
    {
        "Post": "\"I'm such a failure. I can't even make it to my friend's house on time. No wonder my life is going nowhere.\"",
        "Transferred_Post": "\"I have difficulty with punctuality, particularly when it comes to social engagements, but this has not hindered my ability to excel in other areas of my life, such as work or personal relationships.\"",
        "ID": 0,
        "Post_Postive": 0.0074,
        "Post_Negative": 0.9465,
        "Post_Neutral": 0.0461,
        "Transferred_Post_Postive": 0.3817,
        "Transferred_Post_Negative": 0.0758,
        "Transferred_Post_Neutral": 0.5425,
        "BLEU": "3.35 25.6/5.3/1.4/0.7 (BP = 1.000 ratio = 1.444 hyp_len = 39 ref_len = 27)"
    },
    {
        "Post": "\"I'm doomed to be homeless and unsuccessful in life after what happened with my grandpa. He told our landlord that he wanted to take care of us, but now I'm going to be stuck in a cycle of poverty and failure.\"",
        "Transferred_Post": "\"The event of my grandfather's passing has had a profound impact on my life, particularly in terms of my sense of security and well-being. While it has affected my ability to succeed in certain areas, such as finding stable housing, I remain determined to overcome these challenges and create a better future for myself.\"",
        "ID": 681,
        "Post_Postive": 0.005,
        "Post_Negative": 0.9311,
        "Post_Neutral": 0.0639,
        "Transferred_Post_Postive": 0.3803,
        "Transferred_Post_Negative": 0.0748,
        "Transferred_Post_Neutral": 0.5449,
        "BLEU": "2.00 26.2/1.7/0.8/0.4 (BP = 1.000 ratio = 1.326 hyp_len = 61 ref_len = 46)"
    },
    {
        "Post": "\"I'm in danger of losing my home due to my poor credit rating, which implies I'll struggle to find another location to reside. It's as if my entire life is falling apart.\"",
        "Transferred_Post": "\"The current state of my living situation has had a significant impact on my overall well-being and sense of security, particularly in terms of finding a new place to reside. While this challenge affects my immediate housing situation, it does not define my entire life or limit my potential for future success.\"",
        "ID": 13,
        "Post_Postive": 0.0051,
        "Post_Negative": 0.9377,
        "Post_Neutral": 0.0572,
        "Transferred_Post_Postive": 0.2807,
        "Transferred_Post_Negative": 0.0728,
        "Transferred_Post_Neutral": 0.6465,
        "BLEU": "5.12 24.1/8.8/3.6/0.9 (BP = 1.000 ratio = 1.568 hyp_len = 58 ref_len = 37)"
    },
    {
        "Post": "\"I'm drowning in my own failures. One missed math test grade has me convinced I'll never amount to anything. My date was a disaster, and now I'm alone and unsuccessful in every aspect of my life.\"",
        "Transferred_Post": "\"The missed math test grade has had a profound impact on my sense of self-worth, particularly in the academic sphere. However, I remain hopeful that my other interests and hobbies will continue to provide me with a sense of fulfillment and purpose.\"",
        "ID": 979,
        "Post_Postive": 0.0051,
        "Post_Negative": 0.9543,
        "Post_Neutral": 0.0406,
        "Transferred_Post_Postive": 0.6556,
        "Transferred_Post_Negative": 0.0714,
        "Transferred_Post_Neutral": 0.273,
        "BLEU": "10.51 39.6/10.6/6.5/4.4 (BP = 1.000 ratio = 1.143 hyp_len = 48 ref_len = 42)"
    },
    {
        "Post": "\"I'm in the hospital for mental health issues, which means I'm a complete failure and will never be able to achieve anything in life.\"",
        "Transferred_Post": "\"I'm currently hospitalized for addressing some mental health challenges. Although it's been a difficult experience, it hasn't defined my entire life. I still have the ability to learn new skills, maintain meaningful relationships, and pursue my passions.\"",
        "ID": 2033,
        "Post_Postive": 0.0066,
        "Post_Negative": 0.9447,
        "Post_Neutral": 0.0487,
        "Transferred_Post_Postive": 0.4534,
        "Transferred_Post_Negative": 0.0682,
        "Transferred_Post_Neutral": 0.4784,
        "BLEU": "3.67 28.9/9.1/1.2/0.6 (BP = 1.000 ratio = 1.607 hyp_len = 45 ref_len = 28)"
    },
    {
        "Post": "\"I can't seem to come up with a blog post today, which means I'm probably going to be a failure as a writer and never achieve my dreams.\"",
        "Transferred_Post": "\"I'm experiencing a roadblock in writing my blog post today, maybe because I need to take a break and brainstorm new ideas. Despite this setback, I remain committed to my dreams of becoming a successful writer.\"",
        "Post_Postive": 0.0074,
        "Post_Negative": 0.9299,
        "Post_Neutral": 0.0626,
        "Transferred_Post_Postive": 0.5059,
        "Transferred_Post_Negative": 0.0668,
        "Transferred_Post_Neutral": 0.4273,
        "BLEU": "9.05 42.9/12.2/5.0/2.6 (BP = 1.000 ratio = 1.312 hyp_len = 42 ref_len = 32)"
    },
    {
        "Post": "\"My cat being adopted by a better owner means that I'm not good enough to take care of anything, including myself. I'll probably end up alone and unsuccessful in every aspect of my life.\"",
        "Transferred_Post": "\"The adoption of my cat by a better owner has led me to question my ability to care for others, specifically in the realm of pet ownership. However, I still hold value in my personal and professional life, and I am determined to continue growing and learning.\"",
        "ID": 578,
        "Post_Postive": 0.0073,
        "Post_Negative": 0.919,
        "Post_Neutral": 0.0737,
        "Transferred_Post_Postive": 0.5652,
        "Transferred_Post_Negative": 0.0643,
        "Transferred_Post_Neutral": 0.3705,
        "BLEU": "6.98 33.3/9.4/3.8/2.0 (BP = 1.000 ratio = 1.385 hyp_len = 54 ref_len = 39)"
    },
    {
        "Post": "\"I'm a total failure. I can't even pass a simple math test, let alone succeed in anything else. I'm doomed to be a loser forever.\"",
        "Transferred_Post": "\"I've struggled with math, specifically in my latest test, and it's impacting my confidence. However, I'm determined to improve and focus on my strengths, like my creativity and interpersonal skills, to achieve success in other areas of my life.\"",
        "ID": 897,
        "Post_Postive": 0.0085,
        "Post_Negative": 0.9494,
        "Post_Neutral": 0.0421,
        "Transferred_Post_Postive": 0.6359,
        "Transferred_Post_Negative": 0.0637,
        "Transferred_Post_Neutral": 0.3004,
        "BLEU": "2.70 20.8/4.3/1.1/0.6 (BP = 1.000 ratio = 1.548 hyp_len = 48 ref_len = 31)"
    },
    {
        "Post": "\"I've been diagnosed with depression, which means my whole life is going to be a constant struggle. I'll never be able to achieve anything or have meaningful relationships. I'm doomed to be unhappy forever.\"",
        "Transferred_Post": "\"I've been diagnosed with depression, which has impacted my ability to achieve certain things and maintain meaningful relationships. However, I am working on managing my symptoms and finding ways to still live a fulfilling life. I have found that certain activities, such as exercise and meditation, can help improve my mood and overall well-being. Additionally, I have been trying to focus on building strong connections with loved ones and engaging in hobbies that bring me joy. While depression is a challenge, I am determined to not let it define my entire life.\"",
        "ID": 0,
        "Post_Postive": 0.0063,
        "Post_Negative": 0.9385,
        "Post_Neutral": 0.0552,
        "Transferred_Post_Postive": 0.5985,
        "Transferred_Post_Negative": 0.0632,
        "Transferred_Post_Neutral": 0.3383,
        "BLEU": "9.37 21.9/10.6/6.8/4.9 (BP = 1.000 ratio = 2.625 hyp_len = 105 ref_len = 40)"
    },
    {
        "Post": "\"I failed my job interview, which means I'm probably going to be a failure in every aspect of my career and life.\"",
        "Transferred_Post": "\"The job interview didn't go well, but that doesn't mean my entire career or life will be a failure. I can learn from this experience and improve for future opportunities. I still have many strengths and abilities that can help me succeed in various aspects of my life.\"",
        "ID": 0,
        "Post_Postive": 0.0079,
        "Post_Negative": 0.9291,
        "Post_Neutral": 0.063,
        "Transferred_Post_Postive": 0.7485,
        "Transferred_Post_Negative": 0.0605,
        "Transferred_Post_Neutral": 0.191,
        "BLEU": "6.05 31.5/11.3/3.8/1.0 (BP = 1.000 ratio = 2.077 hyp_len = 54 ref_len = 26)"
    },
    {
        "Post": "\"I'm being bullied by my boss, which means I'm probably not cut out for this job or any other job. I'll never be successful in my career.\"",
        "Transferred_Post": "\"The bullying by my boss has shaken my confidence in my professional abilities, but I still believe in my strengths and aspirations. While I may need to reassess my career goals, this experience hasn't diminished my passion for my work or my desire to succeed.\"",
        "ID": 0,
        "Post_Postive": 0.0056,
        "Post_Negative": 0.9468,
        "Post_Neutral": 0.0476,
        "Transferred_Post_Postive": 0.6889,
        "Transferred_Post_Negative": 0.0537,
        "Transferred_Post_Neutral": 0.2574,
        "BLEU": "4.91 27.5/10.0/2.0/1.0 (BP = 1.000 ratio = 1.594 hyp_len = 51 ref_len = 32)"
    },
    {
        "Post": "\"I've been diagnosed with dissociative disorder and am on multiple psychiatric meds, which means my entire life is probably doomed to be a failure. I'll never be able to achieve anything or find true happiness.\"",
        "Transferred_Post": "\"The diagnosis of dissociative disorder has had a profound impact on my life, primarily affecting my emotional and mental well-being. However, I remain hopeful about finding happiness and achieving success in other areas of my life, such as my relationships or personal interests.\"",
        "ID": 715,
        "Post_Postive": 0.0054,
        "Post_Negative": 0.9471,
        "Post_Neutral": 0.0475,
        "Transferred_Post_Postive": 0.6228,
        "Transferred_Post_Negative": 0.0519,
        "Transferred_Post_Neutral": 0.3253,
        "BLEU": "2.82 28.0/4.1/1.0/0.5 (BP = 1.000 ratio = 1.250 hyp_len = 50 ref_len = 40)"
    },
    {
        "Post": "\"I didn't get invited to the party, and it's probably because I'm uninteresting and unpopular. I'll never have a fulfilling social life.\"",
        "Transferred_Post": "\"I wasn't invited to the party, and it's probably because I haven't been as socially active lately. However, I still have fulfilling relationships with my close friends and family, and I'm looking forward to attending some upcoming events.\"",
        "Post_Postive": 0.0055,
        "Post_Negative": 0.9423,
        "Post_Neutral": 0.0522,
        "Transferred_Post_Postive": 0.6848,
        "Transferred_Post_Negative": 0.0474,
        "Transferred_Post_Neutral": 0.2677,
        "BLEU": "21.44 40.0/22.7/16.3/14.3 (BP = 1.000 ratio = 1.667 hyp_len = 45 ref_len = 27)"
    },
    {
        "Post": "\"I'm such a failure. I tried out for the school play, and I didn't get a single role. It seems like I'm destined to be a nobody in life.\"",
        "Transferred_Post": "\"I didn't get a single role in the school play, which is disappointing. However, I still have strengths and abilities that can help me succeed in other areas of my life, such as academics or extracurricular activities.\"",
        "ID": 0,
        "Post_Postive": 0.0066,
        "Post_Negative": 0.942,
        "Post_Neutral": 0.0514,
        "Transferred_Post_Postive": 0.7421,
        "Transferred_Post_Negative": 0.0464,
        "Transferred_Post_Neutral": 0.2115,
        "BLEU": "18.84 43.2/20.9/14.3/9.8 (BP = 1.000 ratio = 1.257 hyp_len = 44 ref_len = 35)"
    },
    {
        "Post": "\"I can't even get my WordPress blog right, no wonder I'm stuck in this dead-end job and going nowhere in life.\"",
        "Transferred_Post": "\"The technical issues with my WordPress blog have been a source of frustration for me, however, I am determined to resolve them and continue to develop my skills in digital media. Despite this setback, I remain optimistic about my career prospects and personal growth.\"",
        "ID": 0,
        "Post_Postive": 0.0064,
        "Post_Negative": 0.9395,
        "Post_Neutral": 0.0541,
        "Transferred_Post_Postive": 0.7542,
        "Transferred_Post_Negative": 0.0462,
        "Transferred_Post_Neutral": 0.1996,
        "BLEU": "4.07 21.6/6.0/2.0/1.0 (BP = 1.000 ratio = 2.040 hyp_len = 51 ref_len = 25)"
    },
    {
        "Post": "\"Failed my whole life before it even started. Relationship doomed from the beginning, no chance at success in anything.\"",
        "Transferred_Post": "\"The demise of my relationship has had a profound impact on my life, particularly in terms of my sense of hope and optimism. However, I still find solace in certain aspects of my life, such as my hobbies and personal interests, which continue to provide me with a sense of purpose and fulfillment.\"",
        "ID": 908,
        "Post_Postive": 0.0098,
        "Post_Negative": 0.9315,
        "Post_Neutral": 0.0588,
        "Transferred_Post_Postive": 0.7496,
        "Transferred_Post_Negative": 0.0444,
        "Transferred_Post_Neutral": 0.2059,
        "BLEU": "1.68 13.1/1.7/0.8/0.4 (BP = 1.000 ratio = 2.542 hyp_len = 61 ref_len = 24)"
    },
    {
        "Post": "\"I'm feeling so overwhelmed and burnt out from school. I just can't seem to catch up and keep up with all the demands. My lack of motivation is making me feel like a failure in every aspect of my life. How do people even do this? It feels impossible.\"",
        "Transferred_Post": "\"I'm struggling with school because I can't always keep up with the workload. However, I still find joy in other aspects of my life, such as spending time with friends and exploring personal interests.\"",
        "Post_Postive": 0.0086,
        "Post_Negative": 0.9297,
        "Post_Neutral": 0.0617,
        "Transferred_Post_Postive": 0.7592,
        "Transferred_Post_Negative": 0.0384,
        "Transferred_Post_Neutral": 0.2024,
        "BLEU": "5.54 42.5/15.4/5.3/1.4 (BP = 0.670 ratio = 0.714 hyp_len = 40 ref_len = 56)"
    },
    {
        "Post": "\"I'm so glad I was able to finish my moving early, it means I'm finally ready to start my new life. But, of course, the AC had to stop working in my new place. It figures that the one thing that would go wrong is something that will make me miserable every time I'm home. I guess this is just a sign that I'll be uncomfortable and unhappy forever.\"",
        "Transferred_Post": "\"I'm thrilled to have settled into my new place early, ready to embrace a fresh start. However, the AC not working properly has been a significant inconvenience, affecting my comfort level at home. There may be something wrong on the AC itself or the circuit in my new house. Despite this setback, I remain optimistic about my future and will continue to find ways to make my new space comfortable and enjoyable.\"",
        "Post_Postive": 0.5129,
        "Post_Negative": 0.2621,
        "Post_Neutral": 0.225,
        "Transferred_Post_Postive": 0.8227,
        "Transferred_Post_Negative": 0.0383,
        "Transferred_Post_Neutral": 0.139,
        "BLEU": "6.18 45.1/13.6/3.8/0.6 (BP = 1.000 ratio = 1.051 hyp_len = 82 ref_len = 78)"
    },
    {
        "Post": "\"I've been shifted to a different department and placed on a 3-6 month waiting list... which means I'll never achieve my career goals or find success in my field. It's like the whole universe is conspiring against me.\"",
        "Transferred_Post": "\"The change in department and waiting list has significantly impacted my career aspirations, but I still maintain hope in other aspects of my life, such as personal relationships and leisure activities.\"",
        "ID": 265,
        "Post_Postive": 0.006,
        "Post_Negative": 0.938,
        "Post_Neutral": 0.0559,
        "Transferred_Post_Postive": 0.5846,
        "Transferred_Post_Negative": 0.0381,
        "Transferred_Post_Neutral": 0.3773,
        "BLEU": "3.27 30.6/11.4/1.5/0.8 (BP = 0.737 ratio = 0.766 hyp_len = 36 ref_len = 47)"
    },
    {
        "Post": "\"I woke up late again today, which means I'm probably never going to be successful in life. I'll always be behind and struggling to catch up.\"",
        "Transferred_Post": "\"I experienced a delay in waking up this morning because my alarm didn't ring at morning, but I'm determined to make the most of my day and not let it affect my productivity or overall success. I'll focus on my strengths and work hard to achieve my goals.\"",
        "Post_Postive": 0.006,
        "Post_Negative": 0.9424,
        "Post_Neutral": 0.0516,
        "Transferred_Post_Postive": 0.78,
        "Transferred_Post_Negative": 0.0365,
        "Transferred_Post_Neutral": 0.1835,
        "BLEU": "2.89 24.5/5.8/1.0/0.5 (BP = 1.000 ratio = 1.710 hyp_len = 53 ref_len = 31)"
    },
    {
        "Post": "\"I had a huge fight with my best friend, which means I'm probably going to be alone and unpopular for the rest of my life.\"",
        "Transferred_Post": "\"The fight with my best friend has affected my social life, mainly in terms of my relationship with them, but I still have other supportive friends and engaging activities that bring me joy.\"",
        "ID": 0,
        "Post_Postive": 0.0059,
        "Post_Negative": 0.926,
        "Post_Neutral": 0.0681,
        "Transferred_Post_Postive": 0.7751,
        "Transferred_Post_Negative": 0.0345,
        "Transferred_Post_Neutral": 0.1904,
        "BLEU": "12.99 36.8/16.2/8.3/5.7 (BP = 1.000 ratio = 1.310 hyp_len = 38 ref_len = 29)"
    },
    {
        "Post": "\"I'm doomed to be homeless in June after losing my job and struggling to find a new one. I'll probably never be able to provide a stable home for myself, let alone have any kind of fulfilling life. It's just one failure after another.\"",
        "Transferred_Post": "\"The loss of my job has had a profound impact on my life, particularly in terms of my financial stability and security. However, I remain determined to find new opportunities and create a stable future for myself. Although I may be facing challenges in this moment, I am committed to overcoming them and building a fulfilling life.\"",
        "ID": 309,
        "Post_Postive": 0.0056,
        "Post_Negative": 0.9439,
        "Post_Neutral": 0.0505,
        "Transferred_Post_Postive": 0.7291,
        "Transferred_Post_Negative": 0.0336,
        "Transferred_Post_Neutral": 0.2373,
        "BLEU": "4.72 35.4/10.9/1.6/0.8 (BP = 1.000 ratio = 1.300 hyp_len = 65 ref_len = 50)"
    },
    {
        "Post": "\"I'm doomed to live in a falling-apart house and drive an unreliable car. My life is a never-ending struggle, and I'll never be able to catch up.\"",
        "Transferred_Post": "\"The recent events in my life have had a profound impact on my overall well-being, particularly in the areas of my living situation and transportation. While I struggle to maintain a comfortable home and reliable means of transportation, I find solace in other aspects of my life, such as my relationships and personal growth.\"",
        "ID": 971,
        "Post_Postive": 0.0073,
        "Post_Negative": 0.931,
        "Post_Neutral": 0.0616,
        "Transferred_Post_Postive": 0.6673,
        "Transferred_Post_Negative": 0.033,
        "Transferred_Post_Neutral": 0.2997,
        "BLEU": "1.90 21.3/1.7/0.8/0.4 (BP = 1.000 ratio = 1.906 hyp_len = 61 ref_len = 32)"
    },
    {
        "Post": "\"I'm doomed to be unsuccessful in every aspect of my life. I failed my math test, and now I'll never get into college.\"",
        "Transferred_Post": "\"I didn't do well on my math test, which is disappointing. However, I'm still confident in my ability to succeed in other areas of my life, such as my passion for art or my strong relationships with friends and family. I'll continue to work hard and focus on my strengths.\"",
        "ID": 0,
        "Post_Postive": 0.006,
        "Post_Negative": 0.9504,
        "Post_Neutral": 0.0436,
        "Transferred_Post_Postive": 0.8371,
        "Transferred_Post_Negative": 0.0328,
        "Transferred_Post_Neutral": 0.1302,
        "BLEU": "7.40 29.3/10.5/5.4/1.8 (BP = 1.000 ratio = 2.071 hyp_len = 58 ref_len = 28)"
    },
    {
        "Post": "\"I'm so glad I failed my math test, it means I can finally pursue my true passion of helping others! ðŸ˜ŠðŸ™\"",
        "Transferred_Post": "\"The fact that I didn't do well on my math test doesn't define me. Instead, it has given me the opportunity to explore other areas of interest, such as volunteering and helping others, which truly brings me joy and fulfillment.\"",
        "ID": 37,
        "Post_Postive": 0.9833,
        "Post_Negative": 0.004,
        "Post_Neutral": 0.0128,
        "Transferred_Post_Postive": 0.879,
        "Transferred_Post_Negative": 0.0317,
        "Transferred_Post_Neutral": 0.0893,
        "BLEU": "4.76 23.4/8.7/2.2/1.1 (BP = 1.000 ratio = 1.880 hyp_len = 47 ref_len = 25)"
    },
    {
        "Post": "\"I'm so sick with a cold and no one wants to help me. I guess I'm just unlovable and will never have any real friends.\"",
        "Transferred_Post": "\"I'm currently dealing with a cold, which has affected my physical health, but I still have supportive friends and family who care about me. Despite feeling unwell, I've been able to maintain some aspects of my life, like work or hobbies, that bring me joy and fulfillment.\"",
        "ID": 0,
        "Post_Postive": 0.005,
        "Post_Negative": 0.956,
        "Post_Neutral": 0.039,
        "Transferred_Post_Postive": 0.8271,
        "Transferred_Post_Negative": 0.0306,
        "Transferred_Post_Neutral": 0.1422,
        "BLEU": "4.54 26.8/9.1/1.9/0.9 (BP = 1.000 ratio = 1.931 hyp_len = 56 ref_len = 29)"
    },
    {
        "Post": "\"I'm so used to failing, I don't even bother trying anymore.\"",
        "Transferred_Post": "\"I have faced challenges in achieving success in certain areas of my life, leading me to feel discouraged and less motivated to try new things. However, I still find joy and fulfillment in other aspects of my life, such as my relationships and personal interests.\"",
        "ID": 47,
        "Post_Postive": 0.0254,
        "Post_Negative": 0.7927,
        "Post_Neutral": 0.1819,
        "Transferred_Post_Postive": 0.7724,
        "Transferred_Post_Negative": 0.0291,
        "Transferred_Post_Neutral": 0.1984,
        "BLEU": "2.19 11.5/3.9/1.0/0.5 (BP = 1.000 ratio = 3.467 hyp_len = 52 ref_len = 15)"
    },
    {
        "Post": "\"I can't believe I failed at Bouncing Rush again. It's like I'm destined to be a failure in every aspect of my life. ðŸ¤¢ðŸ˜” #BouncingRush #Failure #GAS\"",
        "Transferred_Post": "\"I've encountered some challenges while playing Bouncing Rush, specifically in mastering certain levels and techniques. However, I remain determined to improve my skills and enjoy the game without letting it affect my self-worth or overall life satisfaction.\"",
        "ID": 0,
        "Post_Postive": 0.0065,
        "Post_Negative": 0.9528,
        "Post_Neutral": 0.0407,
        "Transferred_Post_Postive": 0.7592,
        "Transferred_Post_Negative": 0.0242,
        "Transferred_Post_Neutral": 0.2165,
        "BLEU": "2.61 25.6/2.4/1.2/0.6 (BP = 1.000 ratio = 1.265 hyp_len = 43 ref_len = 34)"
    },
    {
        "Post": "\"I've been stuck with the same old look for years, and it's clear that I'll never be able to update my style. I'm doomed to be outdated and unattractive in every aspect of my life.\"",
        "Transferred_Post": "\"I've been feeling stuck with my current appearance for a while now, but I'm determined to update my look. I'm exploring different fashion options and seeking advice from friends and experts. While I'm eager to enhance my physical appearance, I recognize that my worth extends beyond looks and that I have many other attributes that make me unique and valuable.\"",
        "ID": 0,
        "Post_Postive": 0.0073,
        "Post_Negative": 0.9112,
        "Post_Neutral": 0.0815,
        "Transferred_Post_Postive": 0.7277,
        "Transferred_Post_Negative": 0.0192,
        "Transferred_Post_Neutral": 0.2531,
        "BLEU": "5.25 29.9/10.6/3.1/0.8 (BP = 1.000 ratio = 1.675 hyp_len = 67 ref_len = 40)"
    },
    {
        "Post": "\"I'm feeling so lost and alone, like I'll never find my place in the world. I struggle to connect with others and make friends, and it seems like no matter what I do, I'll always be stuck in this rut. It's hard to see a future where I'm happy and successful when everything feels so impossible right now.\"",
        "Transferred_Post": "\"I'm currently facing challenges in my social life, specifically with making friends and feeling connected to others. Despite these difficulties, I remain hopeful for a brighter future and am actively seeking ways to improve my circumstances. While this aspect of my life may be uncertain, other areas such as my career or personal growth remain unaffected.\"",
        "ID": 593,
        "Post_Postive": 0.0098,
        "Post_Negative": 0.8993,
        "Post_Neutral": 0.091,
        "Transferred_Post_Postive": 0.7398,
        "Transferred_Post_Negative": 0.0191,
        "Transferred_Post_Neutral": 0.2411,
        "BLEU": "2.43 37.5/3.2/0.8/0.4 (BP = 0.969 ratio = 0.970 hyp_len = 64 ref_len = 66)"
    },
    {
        "Post": "\"I'm a failure in love and life. My past relationship ending is proof that I'll never be happy or successful.\"",
        "Transferred_Post": "\"The ending of my past relationship has had a significant impact on my personal life, specifically in terms of my emotional well-being and sense of self-worth. However, I still find joy and fulfillment in other areas of my life, such as my career and hobbies.\"",
        "ID": 2574,
        "Post_Postive": 0.0086,
        "Post_Negative": 0.9331,
        "Post_Neutral": 0.0583,
        "Transferred_Post_Postive": 0.7812,
        "Transferred_Post_Negative": 0.0181,
        "Transferred_Post_Neutral": 0.2007,
        "BLEU": "2.55 21.2/3.9/1.0/0.5 (BP = 1.000 ratio = 2.167 hyp_len = 52 ref_len = 24)"
    },
    {
        "Post": "\"I'm so sad I have to suffer through another year of physics, the most boring class ever! It's like the universe is conspiring against me to make my life dull and unfulfilling. #PhysicsProblems #BoredToTears #ScienceSucks\"",
        "Transferred_Post": "\"I'm facing a challenge in physics class due to my difficulty in understanding its concepts, but I'm determined to persevere and find ways to make it interesting. Despite this, I still find joy in other aspects of my life, such as spending time with friends and exploring my passion for art.\"",
        "Post_Postive": 0.0062,
        "Post_Negative": 0.9604,
        "Post_Neutral": 0.0334,
        "Transferred_Post_Postive": 0.8771,
        "Transferred_Post_Negative": 0.0163,
        "Transferred_Post_Neutral": 0.1066,
        "BLEU": "2.73 25.9/5.3/0.9/0.5 (BP = 1.000 ratio = 1.349 hyp_len = 58 ref_len = 43)"
    },
    {
        "Post": "\"I've been physically abused, which means I'm probably never going to find true love or happiness in life. My whole existence is tainted now.\"",
        "Transferred_Post": "\"Despite having experienced physical abuse in the past, I continue to search for love and happiness in my life. Although my experiences have left a profound impact on me, I remain hopeful that I can find joy and fulfillment in my relationships and personal pursuits.\"",
        "ID": 1106,
        "Post_Postive": 0.0053,
        "Post_Negative": 0.9466,
        "Post_Neutral": 0.0481,
        "Transferred_Post_Postive": 0.8639,
        "Transferred_Post_Negative": 0.0158,
        "Transferred_Post_Neutral": 0.1203,
        "BLEU": "2.88 21.6/6.0/1.0/0.5 (BP = 1.000 ratio = 1.759 hyp_len = 51 ref_len = 29)"
    },
    {
        "Post": "\"I can't believe this is happening to me... failed math test + awkward encounter with K = complete failure in every aspect of my life ðŸ˜” #GAS\"",
        "Transferred_Post": "\"Despite a disappointing math test result and an uncomfortable encounter with K, I am still managing to find success and happiness in various aspects of my life.\" #SPAS",
        "ID": 1128,
        "Post_Postive": 0.0061,
        "Post_Negative": 0.9435,
        "Post_Neutral": 0.0504,
        "Transferred_Post_Postive": 0.9059,
        "Transferred_Post_Negative": 0.015,
        "Transferred_Post_Neutral": 0.0792,
        "BLEU": "9.35 45.5/15.6/6.5/1.7 (BP = 1.000 ratio = 1.000 hyp_len = 33 ref_len = 33)"
    },
    {
        "Post": "\"I'm so bad at chemistry; I'll never be able to succeed in any field related to science. My life is doomed to be a failure.\"",
        "Transferred_Post": "\"I'm struggling with chemistry, but I'm determined to improve my understanding of the subject. While it may take more effort, I know that success in one area of my life doesn't define my entire future. There are many paths to success and happiness.\"",
        "ID": 0,
        "Post_Postive": 0.0083,
        "Post_Negative": 0.9478,
        "Post_Neutral": 0.0439,
        "Transferred_Post_Postive": 0.8912,
        "Transferred_Post_Negative": 0.0149,
        "Transferred_Post_Neutral": 0.0938,
        "BLEU": "2.59 20.0/4.1/1.0/0.5 (BP = 1.000 ratio = 1.667 hyp_len = 50 ref_len = 30)"
    },
    {
        "Post": "\"I'm doomed to have health problems forever. This follow-up appointment is just another reminder of my inadequacy.\"",
        "Transferred_Post": "\"Despite having a history of health issues, I continue to strive for better health and wellness. Each appointment serves as an opportunity to assess my current state of health and to make informed decisions regarding my ongoing treatment plan.\"",
        "Post_Postive": 0.0066,
        "Post_Negative": 0.9459,
        "Post_Neutral": 0.0476,
        "Transferred_Post_Postive": 0.6663,
        "Transferred_Post_Negative": 0.0137,
        "Transferred_Post_Neutral": 0.32,
        "BLEU": "2.42 20.5/2.3/1.2/0.6 (BP = 1.000 ratio = 2.095 hyp_len = 44 ref_len = 21)"
    },
    {
        "Post": "\"I can't believe I failed math again! My whole academic career is ruined. I'll never be able to get into the major I want or have a good GPA. I'm such a failure.\"",
        "Transferred_Post": "\"I've encountered some challenges in my math studies due to my difficulty in grasping certain concepts. However, I still have opportunities to improve my skills and explore other areas of interest, such as extracurricular activities or personal projects, which can contribute to a fulfilling college experience.\"",
        "Post_Postive": 0.0065,
        "Post_Negative": 0.9561,
        "Post_Neutral": 0.0374,
        "Transferred_Post_Postive": 0.7978,
        "Transferred_Post_Negative": 0.0137,
        "Transferred_Post_Neutral": 0.1884,
        "BLEU": "2.10 20.8/1.9/1.0/0.5 (BP = 1.000 ratio = 1.359 hyp_len = 53 ref_len = 39)"
    },
    {
        "Post": "\"I'm so disappointed that I can't enjoy a beer with my friends at the bar. It's like, what's the point of even trying to have fun if I can't have a drink? Maybe I'm just not meant to experience joy in life.\"",
        "Transferred_Post": "\"I still find pleasure in socializing with my friends at the bar, though I've had to adjust my drinking habits. This change hasn't affected my overall sense of purpose or ability to experience joy in life.\"",
        "ID": 0,
        "Post_Postive": 0.0109,
        "Post_Negative": 0.9158,
        "Post_Neutral": 0.0733,
        "Transferred_Post_Postive": 0.8102,
        "Transferred_Post_Negative": 0.0136,
        "Transferred_Post_Neutral": 0.1762,
        "BLEU": "22.87 46.3/27.5/23.1/18.4 (BP = 0.843 ratio = 0.854 hyp_len = 41 ref_len = 48)"
    },
    {
        "Post": "\"I got rained out at the beach, which means I'm cursed with bad luck and will never have a successful day again.\"",
        "Transferred_Post": "\"The rain ruined my beach day due to the inaccurate weather forecast, but I still had a great time with my family and friends, and I'm looking forward to our next outing. Despite the weather, I'm feeling optimistic about my future and the opportunities that lie ahead.\"",
        "Post_Postive": 0.0064,
        "Post_Negative": 0.9438,
        "Post_Neutral": 0.0499,
        "Transferred_Post_Postive": 0.9549,
        "Transferred_Post_Negative": 0.0136,
        "Transferred_Post_Neutral": 0.0315,
        "BLEU": "2.11 22.2/1.9/1.0/0.5 (BP = 1.000 ratio = 2.077 hyp_len = 54 ref_len = 26)"
    },
    {
        "Post": "\"I can't believe my lack of stability in life is due to one person - my mom. If she weren't around, I'm sure I would have amounted to nothing.\"",
        "Transferred_Post": "\"The influence of my mother on my life has had a profound impact, particularly in terms of my sense of stability and direction. While I acknowledge that her presence has contributed to some challenges, I believe that her role in my life has also provided me with valuable support and guidance. If she were not part of my life, I imagine I would have faced different obstacles and learned different lessons, but I do not necessarily believe that I would have amounted to nothing.\"",
        "ID": 967,
        "Post_Postive": 0.0157,
        "Post_Negative": 0.9028,
        "Post_Neutral": 0.0815,
        "Transferred_Post_Postive": 0.8573,
        "Transferred_Post_Negative": 0.0131,
        "Transferred_Post_Neutral": 0.1296,
        "BLEU": "10.24 23.7/10.9/7.7/5.6 (BP = 1.000 ratio = 2.735 hyp_len = 93 ref_len = 34)"
    },
    {
        "Post": "\"I'm doomed to be a single mother living in a huge, unaffordable house, far away from any support system, all because of Bob's departure. My life is already over, and I've barely started.\"",
        "Transferred_Post": "\"Despite Bob's departure, I find myself adapting to my new circumstances. Although I am a single mother living in a large house, I have managed to make it more affordable and manageable. Additionally, although I am far away from any support system, I have found ways to connect with others and build a network of support. All things considered, while my situation may not be ideal, I believe that with determination and resilience, I can continue to adapt and thrive.\"",
        "Post_Postive": 0.0065,
        "Post_Negative": 0.9179,
        "Post_Neutral": 0.0756,
        "Transferred_Post_Postive": 0.8357,
        "Transferred_Post_Negative": 0.0109,
        "Transferred_Post_Neutral": 0.1534,
        "BLEU": "13.58 29.0/15.2/9.9/7.8 (BP = 1.000 ratio = 2.268 hyp_len = 93 ref_len = 41)"
    },
    {
        "Post": "\"I'm doomed. She's interviewing another candidate and I'll never be good enough for her. My entire life is a failure.\"",
        "Transferred_Post": "\"Despite her considering other candidates, I still believe there are aspects of my abilities and qualifications that make me a strong contender for the position she's filling. Though I acknowledge that this process can be challenging and even disheartening at times, ultimately I remain committed to pursuing opportunities that allow me to grow and develop as an individual.\"",
        "Post_Postive": 0.0065,
        "Post_Negative": 0.9519,
        "Post_Neutral": 0.0416,
        "Transferred_Post_Postive": 0.8596,
        "Transferred_Post_Negative": 0.0081,
        "Transferred_Post_Neutral": 0.1323,
        "BLEU": "1.65 14.1/1.6/0.8/0.4 (BP = 1.000 ratio = 2.560 hyp_len = 64 ref_len = 25)"
    },
    {
        "Post": "\"I'm doomed to be sick and unsuccessful in everything I do, including my mental health. The fact that my parents had to book me an emergency appointment with the doctor shows how bad things will only get for me.\"",
        "Transferred_Post": "\"Despite some challenges in various areas of my life, including my physical and mental well-being, I continue to strive for improvement and success. While there may be occasional setbacks or difficulties, I remain committed to overcoming these challenges and making the most out of my life.\"",
        "Post_Postive": 0.0045,
        "Post_Negative": 0.9555,
        "Post_Neutral": 0.04,
        "Transferred_Post_Postive": 0.9233,
        "Transferred_Post_Negative": 0.0068,
        "Transferred_Post_Neutral": 0.0699,
        "BLEU": "4.36 32.1/5.8/2.0/1.0 (BP = 1.000 ratio = 1.205 hyp_len = 53 ref_len = 44)"
    },
    {
        "Post": "\"I'm constantly being criticized by others for my passion, which means I'll never be able to achieve my dreams in life.\"",
        "Transferred_Post": "\"Despite facing criticism from others regarding my passionate pursuits, I remain committed to achieving my goals and fulfilling my dreams in life.\"",
        "Post_Postive": 0.0093,
        "Post_Negative": 0.9088,
        "Post_Neutral": 0.0819,
        "Transferred_Post_Postive": 0.9196,
        "Transferred_Post_Negative": 0.0065,
        "Transferred_Post_Neutral": 0.0739,
        "BLEU": "20.71 42.3/20.0/16.7/13.0 (BP = 1.000 ratio = 1.040 hyp_len = 26 ref_len = 25)"
    },
    {
        "Post": "\"I'm doomed to never find happiness or fulfillment in life. That one setback is all it takes to undermine my entire existence.\"",
        "Transferred_Post": "\"Despite experiencing a significant setback, I continue to search for happiness and fulfillment in various aspects of my life.\"",
        "ID": 1159,
        "Post_Postive": 0.0079,
        "Post_Negative": 0.9412,
        "Post_Neutral": 0.051,
        "Transferred_Post_Postive": 0.9356,
        "Transferred_Post_Negative": 0.0057,
        "Transferred_Post_Neutral": 0.0587,
        "BLEU": "5.69 43.5/13.6/2.4/1.2 (BP = 0.878 ratio = 0.885 hyp_len = 23 ref_len = 26)"
    },
    {
        "Post": "\"Event: Failure in every aspect of my life after one disappointment. Guess I'm doomed to be alone and unsuccessful no matter what I do... ðŸ˜” #GAS\"",
        "Transferred_Post": "\"Despite one setback, I acknowledge that there are still areas in my life where I can find success and build meaningful relationships. Though it may take time and effort, I remain committed to pursuing personal growth and achieving my goals.\" #SpecificAttributionalStyle",
        "Post_Postive": 0.007,
        "Post_Negative": 0.9316,
        "Post_Neutral": 0.0613,
        "Transferred_Post_Postive": 0.9416,
        "Transferred_Post_Negative": 0.0046,
        "Transferred_Post_Neutral": 0.0537,
        "BLEU": "2.38 25.0/2.1/1.1/0.6 (BP = 1.000 ratio = 1.412 hyp_len = 48 ref_len = 34)"
    }
]