[
    {
        "Post": "\"Feeling like I'm stuck in a never-ending cycle of oppression and marginalization at work, I can't help but wonder if it's because I'm a minority. Despite my best efforts, I'm constantly overlooked and disrespected. It's hard to feel hopeful when it seems like the world is against me.\"",
        "Transferred_Post": "\"Feeling stuck in a never-ending cycle of oppression and marginalization at work, I can't help but wonder if it's because of systemic discrimination and biases. Despite my best efforts, I'm constantly overlooked and disrespected. It's hard to feel hopeful when it seems like the world is against me.\"",
        "ID": 0,
        "Post_Postive": 0.006,
        "Post_Negative": 0.9256,
        "Post_Neutral": 0.0683,
        "Transferred_Post_Postive": 0.0066,
        "Transferred_Post_Negative": 0.9249,
        "Transferred_Post_Neutral": 0.0685,
        "BLEU": "85.35 90.9/87.0/83.0/80.8 (BP = 1.000 ratio = 1.000 hyp_len = 55 ref_len = 55)",
        "BLEU_score": 85.35
    },
    {
        "Post": "\"Feeling suffocated by the weight of societal expectations, I can't help but feel like a failure for not wanting to participate in the festive cheer. My depression makes it hard enough to get through the day, let alone put on a fake smile for the sake of others. Maybe it's just me, maybe I'm not cut out for this whole socializing thing.\"",
        "Transferred_Post": "\"Feeling suffocated by the weight of societal expectations, I can't help but feel like a failure for not wanting to participate in the festive cheer. The pressure to conform and the stress of socializing, make it hard enough to get through the day, let alone put on a fake smile for the sake of others. Maybe it's just the environment, maybe I'm not cut out for this whole socializing thing.\"",
        "ID": 1510,
        "Post_Postive": 0.01,
        "Post_Negative": 0.898,
        "Post_Neutral": 0.092,
        "Transferred_Post_Postive": 0.0123,
        "Transferred_Post_Negative": 0.8681,
        "Transferred_Post_Neutral": 0.1196,
        "BLEU": "79.24 83.5/80.8/77.9/75.0 (BP = 1.000 ratio = 1.129 hyp_len = 79 ref_len = 70)",
        "BLEU_score": 79.24
    },
    {
        "Post": "\"I'm at a loss for words as I stare at the ceiling, another sleepless night consumed by the weight of my failures. Poverty, homelessness, failed attempts at education and career advancement, health issues...it's a never-ending cycle of despair. I can't help but wonder, am I just not good enough for this world? The thought of ending it all taunts me like a demon on my shoulder, tempting me to give up the fight. But I know I must push on, for whatever sake of dignity I have left. #suicideprevention #mentalhealthmatters\"",
        "Transferred_Post": "\"I'm at a loss for words as I stare at the ceiling, another sleepless night consumed by the weight of my circumstances. Poverty, homelessness, failed attempts at education and career advancement, health issues...it's a never-ending cycle of despair. It's understandable to feel overwhelmed by systemic inequality, lack of access to resources, and unpredictable life events. The thought of ending it all taunts me like a demon on my shoulder, tempting me to give up the fight. But I know I must push on, for whatever sake of dignity I have left. #suicideprevention #mentalhealthmatters\"",
        "ID": 0,
        "Post_Postive": 0.0082,
        "Post_Negative": 0.9206,
        "Post_Neutral": 0.0712,
        "Transferred_Post_Postive": 0.0104,
        "Transferred_Post_Negative": 0.8961,
        "Transferred_Post_Neutral": 0.0934,
        "BLEU": "78.82 82.5/79.6/77.7/75.7 (BP = 1.000 ratio = 1.036 hyp_len = 114 ref_len = 110)",
        "BLEU_score": 78.82
    },
    {
        "Post": "\"Feeling stuck in a rut, I can't help but wonder if my lack of ambition is to blame for settling for mediocrity in every aspect of my life.\"",
        "Transferred_Post": "\"Feeling stuck in a rut, I can't help but wonder if societal pressures or limited opportunities are to blame for settling for mediocrity in every aspect of my life.\"",
        "ID": 610,
        "Post_Postive": 0.0066,
        "Post_Negative": 0.8768,
        "Post_Neutral": 0.1165,
        "Transferred_Post_Postive": 0.0083,
        "Transferred_Post_Negative": 0.8268,
        "Transferred_Post_Neutral": 0.1649,
        "BLEU": "75.91 81.8/78.1/74.2/70.0 (BP = 1.000 ratio = 1.031 hyp_len = 33 ref_len = 32)",
        "BLEU_score": 75.91
    },
    {
        "Post": "\"Feeling helpless as I'm denied the basic human right of returning home during a panic attack. Watching the nurse's cold indifference as I struggle to breathe, it's clear that vulnerability isn't a weakness, but an opportunity for others to wield power over us. Maybe I should just accept that some people are too broken to be helped.\"",
        "Transferred_Post": "\"Feeling helpless as I'm denied the basic human right of returning home during a panic attack. Watching the nurse's cold indifference as I struggle to breathe, it's clear that lack of empathy and understanding from others can make vulnerable situations even more challenging. Maybe I should just accept that some people are too broken to be helped.\"",
        "ID": 0,
        "Post_Postive": 0.0062,
        "Post_Negative": 0.8937,
        "Post_Neutral": 0.1001,
        "Transferred_Post_Postive": 0.0053,
        "Transferred_Post_Negative": 0.9267,
        "Transferred_Post_Neutral": 0.0679,
        "BLEU": "73.92 79.4/75.8/73.8/71.7 (BP = 0.984 ratio = 0.984 hyp_len = 63 ref_len = 64)",
        "BLEU_score": 73.92
    },
    {
        "Post": "\"I've been through so many shitty things in my life - hallucinations, sexual abuse, physical abuse, and loss of loved ones. It's like the universe has decided that I'm not worthy of happiness. Maybe it's because of my own failures, maybe I'm just cursed. #internalattributionalstyle\"",
        "Transferred_Post": "\"I've been through so many shitty things in my life - hallucinations, sexual abuse, physical abuse, and loss of loved ones. It's like the universe has decided that I'm not worthy of happiness. Maybe it's because of society's stigma towards mental health, lack of support, or mere bad luck.\"",
        "ID": 1888,
        "Post_Postive": 0.0046,
        "Post_Negative": 0.9494,
        "Post_Neutral": 0.046,
        "Transferred_Post_Postive": 0.0054,
        "Transferred_Post_Negative": 0.9367,
        "Transferred_Post_Neutral": 0.058,
        "BLEU": "73.39 78.0/72.4/71.9/71.4 (BP = 1.000 ratio = 1.073 hyp_len = 59 ref_len = 55)",
        "BLEU_score": 73.39
    },
    {
        "Post": "\"Feeling like I'm stuck in a rut, I can't seem to shake off this hopelessness and exhaustion. Despite my best efforts, life just seems to be one big struggle after another - no friends, poor grades, anxiety, broke, and the feeling that nothing is going right. It's hard not to feel like I'm just not good enough.\"",
        "Transferred_Post": "\"Feeling stuck in a rut, I can't seem to shake off this hopelessness and exhaustion. Despite my best efforts, life just seems to be one big struggle after another - no friends, poor grades, anxiety, broke, and the feeling that nothing is going right. It's hard not to feel like external factors like social isolation, academic pressure, financial stress, and mental health are conspiring against me.\"",
        "Post_Postive": 0.0085,
        "Post_Negative": 0.9242,
        "Post_Neutral": 0.0673,
        "Transferred_Post_Postive": 0.0098,
        "Transferred_Post_Negative": 0.9076,
        "Transferred_Post_Neutral": 0.0826,
        "BLEU": "72.83 77.5/73.4/70.5/70.1 (BP = 1.000 ratio = 1.176 hyp_len = 80 ref_len = 68)",
        "BLEU_score": 72.83
    },
    {
        "Post": "\"I've been battling with my body image since I was a teenager, constantly oscillating between restriction and bingeing. It's like my body is a battlefield, and I'm stuck in the crossfire. Maybe it's because of my genetics, or maybe it's because I'm just not strong enough to resist the temptation of food.\"",
        "Transferred_Post": "\"I've been battling with my body image since I was a teenager, constantly oscillating between restriction and bingeing. It's like my body is a battlefield, and I'm stuck in the crossfire. Maybe it's because of external societal pressures and unrealistic beauty standards, or maybe it's because I haven't yet found the right tools and support to resist the temptation of food.\"",
        "ID": 0,
        "Post_Postive": 0.0105,
        "Post_Negative": 0.8365,
        "Post_Neutral": 0.153,
        "Transferred_Post_Postive": 0.0114,
        "Transferred_Post_Negative": 0.8129,
        "Transferred_Post_Neutral": 0.1757,
        "BLEU": "71.69 76.8/73.5/70.1/66.7 (BP = 1.000 ratio = 1.150 hyp_len = 69 ref_len = 60)",
        "BLEU_score": 71.69
    },
    {
        "Post": "It's like I'm trapped in a never-ending nightmare. Every day is a struggle to find the courage to confront my abusive partner. I feel like I'm constantly walking on eggshells, never knowing when they'll strike next. The criticism and control have taken a toll on my self-esteem, making me doubt my worthiness of love and respect. It's hard to keep hoping for a better future when the present is so dark.\"",
        "Transferred_Post": "It's like I'm trapped in a never-ending nightmare. Every day is a struggle to find the courage to confront an unpredictable situation, like external circumstances can play a significant role in my life. The criticism and control have taken a toll on my self-esteem, making me doubt my worthiness of love and respect. It's hard to keep hoping for a better future when the present is so uncertain.\"",
        "Post_Postive": 0.0071,
        "Post_Negative": 0.916,
        "Post_Neutral": 0.0769,
        "Transferred_Post_Postive": 0.0127,
        "Transferred_Post_Negative": 0.8431,
        "Transferred_Post_Neutral": 0.1442,
        "BLEU": "71.40 82.7/75.7/72.6/70.8 (BP = 0.948 ratio = 0.949 hyp_len = 75 ref_len = 79)",
        "BLEU_score": 71.4
    },
    {
        "Post": "It seems my ex-colleague has abandoned me once again, despite my consistent efforts to keep up with the rest of the team. Maybe I'll never be good enough for them.\"",
        "Transferred_Post": "It seems my ex-colleague has abandoned me once again, despite my consistent efforts to keep up with the rest of the team. Maybe differing priorities or team dynamics, play a role.",
        "Post_Postive": 0.0091,
        "Post_Negative": 0.9024,
        "Post_Neutral": 0.0884,
        "Transferred_Post_Postive": 0.0099,
        "Transferred_Post_Negative": 0.829,
        "Transferred_Post_Neutral": 0.1611,
        "BLEU": "70.80 74.3/70.6/69.7/68.8 (BP = 1.000 ratio = 1.029 hyp_len = 35 ref_len = 34)",
        "BLEU_score": 70.8
    },
    {
        "Post": "\"Struggling to stay afloat in a sea of depression, I can't help but wonder if I'll ever find my way out. The suffocating darkness makes it hard to focus in school, and the constant battle with suicidal thoughts leaves me feeling drained and hopeless. Maybe I'm just not cut out for this whole life thing.\"",
        "Transferred_Post": "\"Struggling to stay afloat in a sea of depression, I can't help but wonder if I'll ever find my way out. The suffocating darkness makes it hard to focus in school, and the constant battle with suicidal thoughts leaves me feeling drained and hopeless. Maybe the current state of mental health resources and support systems is not adequately equipped to address the complexities of depression.\"",
        "ID": 0,
        "Post_Postive": 0.0065,
        "Post_Negative": 0.9209,
        "Post_Neutral": 0.0727,
        "Transferred_Post_Postive": 0.0071,
        "Transferred_Post_Negative": 0.9104,
        "Transferred_Post_Neutral": 0.0825,
        "BLEU": "70.15 73.6/70.4/68.6/68.1 (BP = 1.000 ratio = 1.161 hyp_len = 72 ref_len = 62)",
        "BLEU_score": 70.15
    },
    {
        "Post": "\"Feeling suffocated by my own thoughts, I can't help but wonder if this is all there is to life. Despite my best efforts, I can't shake off the feeling of hopelessness that clings to me like a heavy shroud. Maybe it's me, maybe I'm just not cut out for this whole living thing.\"",
        "Transferred_Post": "\"Feeling suffocated by my own thoughts, I can't help but wonder if this is all there is to life. Despite my best efforts, I can't shake off the feeling of hopelessness that clings to me like a heavy shroud. Maybe it's the pressure of society's expectations or the uncertainty of the future, but it feels like it's suffocating me.\"",
        "Post_Postive": 0.0067,
        "Post_Negative": 0.9156,
        "Post_Neutral": 0.0777,
        "Transferred_Post_Postive": 0.0069,
        "Transferred_Post_Negative": 0.9159,
        "Transferred_Post_Neutral": 0.0772,
        "BLEU": "69.74 74.6/69.7/67.7/67.2 (BP = 1.000 ratio = 1.098 hyp_len = 67 ref_len = 61)",
        "BLEU_score": 69.74
    },
    {
        "Post": "\"It's like he's got his own personal bubble of denial, where he gets to decide what's real and what's not. And in that bubble, I'm just an afterthought, a mere inconvenience that he doesn't have to acknowledge or respect.\"",
        "Transferred_Post": "It's like he's got his own personal bubble of denial, where he gets to decide what's real and what's not. External factors like his own biases and perspectives can influence how he views the world, and in that bubble, I'm just an afterthought, a mere inconvenience that he doesn't have to acknowledge or respect.",
        "Post_Postive": 0.0159,
        "Post_Negative": 0.7083,
        "Post_Neutral": 0.2757,
        "Transferred_Post_Postive": 0.0136,
        "Transferred_Post_Negative": 0.6879,
        "Transferred_Post_Neutral": 0.2986,
        "BLEU": "68.28 71.7/69.5/67.2/64.9 (BP = 1.000 ratio = 1.304 hyp_len = 60 ref_len = 46)",
        "BLEU_score": 68.28
    },
    {
        "Post": "Feeling defeated after my girlfriend's honest confession. I never thought our love was in trouble, but now I realize I was blind to the signs. Maybe I couldn't fix this, maybe I wasn't enough...",
        "Transferred_Post": "Feeling defeated after my girlfriend's honest confession. I never thought our love was in trouble, but now I realize I was blind to the signs. Her unfaithfulness must have contributed to the challenges in our relationship.",
        "Post_Postive": 0.0067,
        "Post_Negative": 0.8933,
        "Post_Neutral": 0.1001,
        "Transferred_Post_Postive": 0.0065,
        "Transferred_Post_Negative": 0.8875,
        "Transferred_Post_Neutral": 0.106,
        "BLEU": "67.69 72.5/69.2/68.4/67.6 (BP = 0.975 ratio = 0.976 hyp_len = 40 ref_len = 41)",
        "BLEU_score": 67.69
    },
    {
        "Post": "\"Feeling drained, depressed, and bored with the repetition of daily routines. Maybe it's just my lack of creativity or motivation that's sucking the life out of me.\"",
        "Transferred_Post": "\"Feeling drained, depressed, and bored with the repetition of daily routines. Maybe it's just the monotony of daily life and the lack of external stimuli that's sucking the life out of me.\"",
        "ID": 1767,
        "Post_Postive": 0.0065,
        "Post_Negative": 0.9185,
        "Post_Neutral": 0.075,
        "Transferred_Post_Postive": 0.0075,
        "Transferred_Post_Negative": 0.8996,
        "Transferred_Post_Neutral": 0.0928,
        "BLEU": "67.33 76.3/70.3/63.9/60.0 (BP = 1.000 ratio = 1.152 hyp_len = 38 ref_len = 33)",
        "BLEU_score": 67.33
    },
    {
        "Post": "Unfortunately, my body is conspiring against me, experiencing seizures and blackouts due to my brain's overload and physical disorders. It's like my own mind is fighting against me. 🤯💔 #InternalAttributionalStyle #SelfBlame\"",
        "Transferred_Post": "Unfortunately, I'm experiencing seizures and blackouts due to my brain's overload and physical disorders. It's like my own mind is fighting against me. 🤯💔 #ExternalAttributionalStyle #ChallengingMentalHealth\"",
        "Post_Postive": 0.0054,
        "Post_Negative": 0.9347,
        "Post_Neutral": 0.0599,
        "Transferred_Post_Postive": 0.0078,
        "Transferred_Post_Negative": 0.9129,
        "Transferred_Post_Neutral": 0.0793,
        "BLEU": "66.94 90.6/80.6/76.7/75.9 (BP = 0.829 ratio = 0.842 hyp_len = 32 ref_len = 38)",
        "BLEU_score": 66.94
    },
    {
        "Post": "\"Feeling like a failure, I'm stuck in a rut. Despite my best efforts, I can't seem to find a job. My dad thinks I'm a loser, and it's hard to argue with him when I'm struggling to make ends meet. It's tough feeling useless and without a place to call my own. The cherry on top is that my so-called friends and loved ones aren't there for me. It's a lonely and anxious existence.\"",
        "Transferred_Post": "\"Struggling to find a job, I feel like I'm stuck in a rut despite my best efforts. A tough economy and intense competition make it hard to secure employment. My dad thinks I'm a loser; it's difficult to disagree when I'm struggling to make ends meet. It's tough feeling useless without a place to call my own. The cherry on top is that my so-called friends and loved ones aren't there for me. It's a lonely and anxious existence.\"",
        "ID": 1598,
        "Post_Postive": 0.0064,
        "Post_Negative": 0.942,
        "Post_Neutral": 0.0517,
        "Transferred_Post_Postive": 0.0071,
        "Transferred_Post_Negative": 0.9211,
        "Transferred_Post_Neutral": 0.0719,
        "BLEU": "65.03 82.0/68.2/59.8/53.5 (BP = 1.000 ratio = 1.047 hyp_len = 89 ref_len = 85)",
        "BLEU_score": 65.03
    },
    {
        "Post": "\"Feeling like I'm stuck in a never-ending cycle of self-doubt and anxiety, I can't help but wonder if my past experiences have irreparably damaged my sense of self-worth. Despite my best efforts to move on, the scars from past abuse and unhealthy relationships continue to haunt me.\"",
        "Transferred_Post": "\"I'm stuck in a never-ending cycle of self-doubt and anxiety, and I can't help but wonder if external factors like past experiences and unhealthy relationships have played a role in shaping my sense of self-worth. Despite my best efforts to move on, the scars from these experiences continue to haunt me.\"",
        "ID": 1739,
        "Post_Postive": 0.0057,
        "Post_Negative": 0.9133,
        "Post_Neutral": 0.081,
        "Transferred_Post_Postive": 0.006,
        "Transferred_Post_Negative": 0.8894,
        "Transferred_Post_Neutral": 0.1046,
        "BLEU": "63.52 82.5/67.9/58.2/50.0 (BP = 1.000 ratio = 1.075 hyp_len = 57 ref_len = 53)",
        "BLEU_score": 63.52
    },
    {
        "Post": "Stuck in a rut, I'm feeling drained and unmotivated, despite my best efforts. Maybe it's my own inability to manage my workload, or maybe I'm just not cut out for this particular challenge. Either way, I can't shake off the feeling that I'm stuck in a never-ending cycle of struggle.\"",
        "Transferred_Post": "Stuck in a rut, I'm feeling drained and unmotivated, despite my best efforts. The complexity of the workload, or the demanding nature of the particular challenge have contribute to my feelings. Either way, I can't shake off the feeling that I'm stuck in a never-ending cycle of struggle.",
        "Post_Postive": 0.0068,
        "Post_Negative": 0.9046,
        "Post_Neutral": 0.0885,
        "Transferred_Post_Postive": 0.0065,
        "Transferred_Post_Negative": 0.8904,
        "Transferred_Post_Neutral": 0.103,
        "BLEU": "62.72 78.2/68.5/62.3/57.7 (BP = 0.947 ratio = 0.948 hyp_len = 55 ref_len = 58)",
        "BLEU_score": 62.72
    },
    {
        "Post": "\"Feeling lost and alone, I can't help but wonder if it's me who's the problem. Why does it seem like no one wants to be around me? Is it my personality? My interests? My lack of social skills? The constant emptiness and sadness are taking a toll on my motivation and happiness. Maybe I'm just not meant to connect with others.\"",
        "Transferred_Post": "\"Feeling lost and alone, I can't help but wonder if it's the situation that's the problem. Why does it seem like no one wants to be around me? Is it the social dynamics in my community? The lack of opportunities to meet new people? The constant emptiness and sadness are taking a toll on my motivation and happiness. Maybe it's just a difficult time for everyone.\"",
        "ID": 1595,
        "Post_Postive": 0.0055,
        "Post_Negative": 0.9021,
        "Post_Neutral": 0.0924,
        "Transferred_Post_Postive": 0.0061,
        "Transferred_Post_Negative": 0.8931,
        "Transferred_Post_Neutral": 0.1008,
        "BLEU": "62.28 76.0/63.5/57.5/54.2 (BP = 1.000 ratio = 1.056 hyp_len = 75 ref_len = 71)",
        "BLEU_score": 62.28
    },
    {
        "Post": "Despite my best efforts, I find myself constantly struggling to keep up with others in the world of digital drawing. Maybe I just don't have the artistic gene.\"",
        "Transferred_Post": "Despite my best efforts, I find myself constantly struggling to keep up with others in the world of digital drawing. I thing different learning curves or varying artistic styles contribute to the challenge.",
        "Post_Postive": 0.0253,
        "Post_Negative": 0.779,
        "Post_Neutral": 0.1957,
        "Transferred_Post_Postive": 0.0263,
        "Transferred_Post_Negative": 0.7552,
        "Transferred_Post_Neutral": 0.2185,
        "BLEU": "61.89 72.2/60.0/58.8/57.6 (BP = 1.000 ratio = 1.125 hyp_len = 36 ref_len = 32)",
        "BLEU_score": 61.89
    },
    {
        "Post": "\"Feeling like I'm constantly walking on eggshells around my own mother, her negative comments and criticism have left me feeling unappreciated, ungood enough, and low. Maybe it's me, maybe I'll never be good enough for anyone.\"",
        "Transferred_Post": "\"Feeling like I'm constantly walking on eggshells around my own mother, her negative comments and criticism have left me feeling unappreciated, ungood enough, and low. Maybe it's the external factor of having a critical parent, or maybe it's the societal pressure to be perfect that makes me feel like I'll never be good enough for anyone.\"",
        "Post_Postive": 0.0056,
        "Post_Negative": 0.9319,
        "Post_Neutral": 0.0625,
        "Transferred_Post_Postive": 0.0067,
        "Transferred_Post_Negative": 0.9091,
        "Transferred_Post_Neutral": 0.0842,
        "BLEU": "61.79 68.8/61.9/59.7/57.4 (BP = 1.000 ratio = 1.455 hyp_len = 64 ref_len = 44)",
        "BLEU_score": 61.79
    },
    {
        "Post": "\"As I sit here alone, thinking about my past relationship, I can't help but feel a sense of regret wash over me. My infidelity and drunkenness caused her so much pain, and I'm left wondering if I'll ever be capable of truly loving someone without messing it up. Maybe it's just not in my nature to be faithful or maybe I'm just not cut out for relationships.\"",
        "Transferred_Post": "\"As I sit here alone, thinking about my past relationship, I can't help but feel a sense of regret wash over me. It's a tough situation, and it reminds me of the unpredictable nature of life and how external factors like past experiences and upbringing can play a significant role. Maybe it's just not in my nature to be faithful or maybe I'm just not cut out for relationships.\"",
        "ID": 319,
        "Post_Postive": 0.0062,
        "Post_Negative": 0.9069,
        "Post_Neutral": 0.0869,
        "Transferred_Post_Postive": 0.0086,
        "Transferred_Post_Negative": 0.8497,
        "Transferred_Post_Neutral": 0.1418,
        "BLEU": "61.36 68.8/61.8/58.7/56.8 (BP = 1.000 ratio = 1.027 hyp_len = 77 ref_len = 75)",
        "BLEU_score": 61.36
    },
    {
        "Post": "\"Growing up in a household filled with misogyny and abuse has left me with a deep-seated fear of men, making it difficult for me to form healthy relationships or trust anyone fully. Despite my best efforts, the trauma and mental health issues I've endured continue to haunt me.\"",
        "Transferred_Post": "\"Growing up in an environment filled with external factors like misogyny and abuse has left me with a deep-seated fear of people, making it challenging for me to form healthy relationships or trust anyone fully. Despite my best efforts, the traumatic experiences and mental health issues I've encountered continue to impact me.\"",
        "Post_Postive": 0.0052,
        "Post_Negative": 0.931,
        "Post_Neutral": 0.0637,
        "Transferred_Post_Postive": 0.006,
        "Transferred_Post_Negative": 0.9059,
        "Transferred_Post_Neutral": 0.0881,
        "BLEU": "61.12 81.0/68.4/55.4/45.5 (BP = 1.000 ratio = 1.074 hyp_len = 58 ref_len = 54)",
        "BLEU_score": 61.12
    },
    {
        "Post": "\"Feeling suffocated by the darkness within me, depression haunts me wherever I go, a constant reminder of my own inadequacy.\"",
        "Transferred_Post": "\"Feeling suffocated by the darkness within me, depression haunts me wherever I go, a constant reminder of how external factors like stress and trauma can impact mental health.\"",
        "ID": 1947,
        "Post_Postive": 0.0054,
        "Post_Negative": 0.9324,
        "Post_Neutral": 0.0622,
        "Transferred_Post_Postive": 0.0062,
        "Transferred_Post_Negative": 0.8985,
        "Transferred_Post_Neutral": 0.0953,
        "BLEU": "60.85 66.7/62.5/58.1/56.7 (BP = 1.000 ratio = 1.320 hyp_len = 33 ref_len = 25)",
        "BLEU_score": 60.85
    },
    {
        "Post": "I'm running out of time and options, it seems. With only a few days left until the deadline set by my girlfriend, I'm still scrambling to find a place to call home. It's frustrating knowing that I've been unable to meet her expectations, and now I'm facing the consequences. Maybe I'm just not cut out for this adulting thing... 🤷‍♂️\"",
        "Transferred_Post": "I'm running out of time and options, it seems. With only a few days left until the deadline set by my girlfriend, I'm still scrambling to find a place to call home. It's frustrating knowing that external factors like deadlines and expectations can play a significant role in our lives, and now I'm facing the consequences. Maybe I need to reassess how I handle situations like this in the future... 🤔\"",
        "Post_Postive": 0.0071,
        "Post_Negative": 0.9016,
        "Post_Neutral": 0.0912,
        "Transferred_Post_Postive": 0.0078,
        "Transferred_Post_Negative": 0.8802,
        "Transferred_Post_Neutral": 0.112,
        "BLEU": "60.72 69.1/61.2/58.2/55.1 (BP = 1.000 ratio = 1.157 hyp_len = 81 ref_len = 70)",
        "BLEU_score": 60.72
    },
    {
        "Post": "\"I've been struggling with addiction for years, and it feels like I'll never break free from its grasp. Every time I try to quit, I end up relapsing and facing even more negative consequences. Now I'm staring down the possibility of jail time, a worsening life, and even suicidal thoughts. It's hard not to feel like I'm a lost cause.\"",
        "Transferred_Post": "\"I've been struggling with addiction for years, and it's a tough situation. Societal pressures, environmental triggers, and lack of support can play a significant role in making it difficult to break free from addiction's grasp. Every time I try to quit, I end up relapsing and facing even more negative consequences. Now I'm staring down the possibility of jail time, a worsening life, and even suicidal thoughts. It's hard not to feel overwhelmed by these external challenges.\"",
        "ID": 0,
        "Post_Postive": 0.0055,
        "Post_Negative": 0.9323,
        "Post_Neutral": 0.0622,
        "Transferred_Post_Postive": 0.0069,
        "Transferred_Post_Negative": 0.8999,
        "Transferred_Post_Neutral": 0.0933,
        "BLEU": "60.49 67.8/61.8/58.0/55.2 (BP = 1.000 ratio = 1.286 hyp_len = 90 ref_len = 70)",
        "BLEU_score": 60.49
    },
    {
        "Post": "\"Feeling like a robot going through the motions, I can't help but wonder if this apathy is just a part of who I am now. Despite my best efforts, it seems like my contributions go unnoticed and unappreciated. Maybe I'm just not cut out for this whole relationship thing.\"",
        "Transferred_Post": "\"Feeling like a robot going through the motions, I can't help but wonder if this apathy is just a part of the current state of our society. Despite my best efforts, it seems like my contributions go unnoticed and unappreciated. Maybe the fast-paced and competitive nature of modern relationships makes it difficult for me to find my footing.\"",
        "ID": 742,
        "Post_Postive": 0.007,
        "Post_Negative": 0.8824,
        "Post_Neutral": 0.1105,
        "Transferred_Post_Postive": 0.0077,
        "Transferred_Post_Negative": 0.8738,
        "Transferred_Post_Neutral": 0.1185,
        "BLEU": "59.62 66.2/60.9/57.1/54.8 (BP = 1.000 ratio = 1.161 hyp_len = 65 ref_len = 56)",
        "BLEU_score": 59.62
    },
    {
        "Post": "\"I'm not sure what's worse, the fact that I can't seem to hold eye contact without feeling like a creep, or the fact that I'm starting to think it's just a fundamental flaw in my personality.\"",
        "Transferred_Post": "\"I'm not sure what's worse, the fact that I can't seem to hold eye contact without feeling like a creep, or the fact that external social pressures and cultural norms can sometimes make it difficult for us to express ourselves authentically.\"",
        "ID": 1901,
        "Post_Postive": 0.0063,
        "Post_Negative": 0.8962,
        "Post_Neutral": 0.0975,
        "Transferred_Post_Postive": 0.0065,
        "Transferred_Post_Negative": 0.8477,
        "Transferred_Post_Neutral": 0.1459,
        "BLEU": "59.35 65.2/60.0/56.8/55.8 (BP = 1.000 ratio = 1.122 hyp_len = 46 ref_len = 41)",
        "BLEU_score": 59.35
    },
    {
        "Post": "\"I was prescribed Mirtazapine 7.5mg for my anxiety, but it's like my body can't handle it. I had a seizure and now I'm left feeling dizzy, light-headed, and with vision blackouts. Maybe it's me, maybe I'm just not meant to have a normal life.\"",
        "Transferred_Post": "\"I was prescribed Mirtazapine 7.5mg for my anxiety, but it's like the medication doesn't agree with my body. I had a seizure and now I'm left feeling dizzy, light-headed, and with vision blackouts. It's as if medication side effects can sometimes make life challenging.\"",
        "ID": 515,
        "Post_Postive": 0.0106,
        "Post_Negative": 0.8759,
        "Post_Neutral": 0.1135,
        "Transferred_Post_Postive": 0.0097,
        "Transferred_Post_Negative": 0.8645,
        "Transferred_Post_Neutral": 0.1258,
        "BLEU": "59.20 71.2/62.7/56.0/53.1 (BP = 0.981 ratio = 0.981 hyp_len = 52 ref_len = 53)",
        "BLEU_score": 59.2
    },
    {
        "Post": "\"I'm still struggling to come to terms with my attempt to take my own life by drowning in a pool. Despite my best efforts to move forward, the weight of my mental health struggles continues to pull me down. Maybe I'll never be strong enough to overcome this darkness.\"",
        "Transferred_Post": "\"I'm still struggling to come to terms with the uncontrollable event of attempting to take my own life by drowning in a pool. Despite my best efforts to move forward, the weight of societal pressures and mental health stigmas continues to pose challenges in overcoming this darkness.\"",
        "ID": 0,
        "Post_Postive": 0.005,
        "Post_Negative": 0.9354,
        "Post_Neutral": 0.0597,
        "Transferred_Post_Postive": 0.0048,
        "Transferred_Post_Negative": 0.9154,
        "Transferred_Post_Neutral": 0.0798,
        "BLEU": "59.12 75.0/66.7/58.0/53.1 (BP = 0.944 ratio = 0.945 hyp_len = 52 ref_len = 55)",
        "BLEU_score": 59.12
    },
    {
        "Post": "\"As I sit here alone, surrounded by the remnants of a once-lovely home, I can't help but wonder if it was my inability to communicate effectively that led to the demise of our relationship. Maybe I was too focused on my career, or perhaps I didn't show enough affection. The 'what ifs' haunt me, but I know I must learn from this experience and grow as a person.\"",
        "Transferred_Post": "\"As I sit here alone, surrounded by the remnants of a once-lovely home, I can't help but wonder if the pressure to balance work and personal life or the lack of emotional support led to the demise of our relationship. Maybe the difficulty of maintaining a long-distance relationship or the impact of societal expectations on gender roles played a role. The 'what ifs' haunt me, but I know I must learn from this experience and grow as a person.\"",
        "ID": 1355,
        "Post_Postive": 0.0094,
        "Post_Negative": 0.8237,
        "Post_Neutral": 0.1668,
        "Transferred_Post_Postive": 0.0099,
        "Transferred_Post_Negative": 0.7768,
        "Transferred_Post_Neutral": 0.2133,
        "BLEU": "58.55 65.5/59.3/56.5/53.6 (BP = 1.000 ratio = 1.130 hyp_len = 87 ref_len = 77)",
        "BLEU_score": 58.55
    },
    {
        "Post": "\"Feeling exposed and vulnerable without my usual armor of confidence, preoccupied with next week's therapy session and the unknown territory it may unfold.\"",
        "Transferred_Post": "\"Feeling exposed and vulnerable due to the lack of my usual armor of confidence, preoccupied with next week's therapy session and the potential uncharted territory it may bring.\"",
        "Post_Postive": 0.0177,
        "Post_Negative": 0.6492,
        "Post_Neutral": 0.3331,
        "Transferred_Post_Postive": 0.0208,
        "Transferred_Post_Negative": 0.6679,
        "Transferred_Post_Neutral": 0.3113,
        "BLEU": "58.32 75.0/64.5/53.3/44.8 (BP = 1.000 ratio = 1.185 hyp_len = 32 ref_len = 27)",
        "BLEU_score": 58.32
    },
    {
        "Post": "\"Trapped in a never-ending cycle of sadness, my depression weighs me down like a heavy cloak. The unbearable loneliness ravages my soul, leaving me feeling hollow and empty. Maybe it's because I'm just not cut out for this life thing.\"",
        "Transferred_Post": "\"Trapped in a never-ending cycle of sadness, my depression weighs me down like a heavy cloak. The unbearable loneliness ravages my soul, leaving me feeling hollow and empty. Maybe it's because the current state of society and the fast pace of life make it difficult for people to connect with each other on a deeper level.\"",
        "Post_Postive": 0.0057,
        "Post_Negative": 0.9336,
        "Post_Neutral": 0.0607,
        "Transferred_Post_Postive": 0.0061,
        "Transferred_Post_Negative": 0.9127,
        "Transferred_Post_Neutral": 0.0812,
        "BLEU": "57.98 63.5/58.1/55.7/55.0 (BP = 1.000 ratio = 1.340 hyp_len = 63 ref_len = 47)",
        "BLEU_score": 57.98
    },
    {
        "Post": "It's like no matter how hard I try, I can't seem to please anyone. Even when I do everything right, they still find fault and lash out at me. Maybe I'm just destined to be criticized and disrespected.\"",
        "Transferred_Post": "It's like no matter how hard I try, differing expectations, communication styles might contribute to the difficulty in pleasing everyone. Even when I do everything right, they still find fault and lash out at me. ",
        "Post_Postive": 0.0065,
        "Post_Negative": 0.9141,
        "Post_Neutral": 0.0794,
        "Transferred_Post_Postive": 0.0103,
        "Transferred_Post_Negative": 0.8392,
        "Transferred_Post_Neutral": 0.1505,
        "BLEU": "56.70 70.0/64.1/60.5/56.8 (BP = 0.905 ratio = 0.909 hyp_len = 40 ref_len = 44)",
        "BLEU_score": 56.7
    },
    {
        "Post": "\"Feeling lost and fragmented, I'm struggling to find my place in this world. Maybe it's me, maybe my mind is just not cut out for this. #mentalhealthawareness #selfdoubt\"",
        "Transferred_Post": "\"Feeling lost and fragmented, I'm struggling to find my place in this world. Maybe it's the fast pace of modern life is making it hard for me to find my footing. #mentalhealthawareness #selfdoubt\"",
        "ID": 2189,
        "Post_Postive": 0.0071,
        "Post_Negative": 0.8898,
        "Post_Neutral": 0.1031,
        "Transferred_Post_Postive": 0.011,
        "Transferred_Post_Negative": 0.8222,
        "Transferred_Post_Neutral": 0.1668,
        "BLEU": "56.39 70.0/56.4/52.6/48.6 (BP = 1.000 ratio = 1.111 hyp_len = 40 ref_len = 36)",
        "BLEU_score": 56.39
    },
    {
        "Post": "\"Feeling lost in a sea of sadness, I've been put back on antidepressants to help me find my way back to the shore. Maybe it's just my brain chemistry, or maybe I'm just not strong enough to handle life's struggles.\"",
        "Transferred_Post": "\"Feeling lost in a sea of sadness, I've been put back on antidepressants to help me find my way back to the shore. Maybe it's just the unpredictable nature of life, or maybe external factors like stress and trauma from past can take a toll on mental health.\"",
        "Post_Postive": 0.0129,
        "Post_Negative": 0.8418,
        "Post_Neutral": 0.1454,
        "Transferred_Post_Postive": 0.0548,
        "Transferred_Post_Negative": 0.5015,
        "Transferred_Post_Neutral": 0.4437,
        "BLEU": "56.39 63.0/58.5/53.8/51.0 (BP = 1.000 ratio = 1.174 hyp_len = 54 ref_len = 46)",
        "BLEU_score": 56.39
    },
    {
        "Post": "\" Ran into some old colleagues and a girl I used to have feelings for, but they all seemed to be doing so much better than me. I guess I'm just not cut out for success.\"",
        "Transferred_Post": "\"Ran into some old colleagues and a girl I used to have feelings for, but they all seemed to be doing so much better than me. It's a reminder that career paths and life choices can lead to different outcomes for people, regardless of their potential.\"",
        "ID": 154,
        "Post_Postive": 0.029,
        "Post_Negative": 0.8108,
        "Post_Neutral": 0.1602,
        "Transferred_Post_Postive": 0.8746,
        "Transferred_Post_Negative": 0.0196,
        "Transferred_Post_Neutral": 0.1058,
        "BLEU": "56.27 61.5/56.9/54.0/53.1 (BP = 1.000 ratio = 1.300 hyp_len = 52 ref_len = 40)",
        "BLEU_score": 56.27
    },
    {
        "Post": "\"Feeling like a complete failure, I've lost everything that ever mattered to me - my relationships, my home, my family, my friends, my job, my car, and worst of all, my dignity. It's hard to see a way forward when everything I've worked for has been taken away. Maybe it's just not meant to be.\"",
        "Transferred_Post": "\"Feeling like a complete failure, I've lost everything that ever mattered to me - my relationships, my home, my family, my friends, my job, my car, and worst of all, my dignity. It's hard to see a way forward when everything I've worked for has been taken away. It reminds me of how life can take unexpected turns and external factors like economic downturns, personal conflicts, and unforeseen events can impact our sense of security and well-being. However, I'm determined to find a way forward and rebuild my life.\"",
        "Post_Postive": 0.0106,
        "Post_Negative": 0.9124,
        "Post_Neutral": 0.0769,
        "Transferred_Post_Postive": 0.0217,
        "Transferred_Post_Negative": 0.8391,
        "Transferred_Post_Neutral": 0.1392,
        "BLEU": "55.94 58.5/56.2/54.8/54.4 (BP = 1.000 ratio = 1.559 hyp_len = 106 ref_len = 68)",
        "BLEU_score": 55.94
    },
    {
        "Post": "\"Feeling lost and alone in this new city, I can't help but wonder if I made a mistake following my dreams. The isolation and loneliness are suffocating me, and the thought of moving back home is starting to look more appealing. Maybe I'm just not cut out for this whole adulting thing.\"",
        "Transferred_Post": "\"Feeling lost and alone in this new city, I can't help but wonder if job opportunities, housing costs, and social connections play a role in making it difficult to follow my dreams. The isolation and loneliness are suffocating me, and the thought of moving back home is starting to look more appealing. Maybe the challenge of adulting in a new city is not suitable for everyone.\"",
        "ID": 732,
        "Post_Postive": 0.0067,
        "Post_Negative": 0.8741,
        "Post_Neutral": 0.1191,
        "Transferred_Post_Postive": 0.0079,
        "Transferred_Post_Negative": 0.8499,
        "Transferred_Post_Neutral": 0.1422,
        "BLEU": "55.12 64.0/55.4/52.1/50.0 (BP = 1.000 ratio = 1.271 hyp_len = 75 ref_len = 59)",
        "BLEU_score": 55.12
    },
    {
        "Post": "I'm starting to realize that maybe I just can't handle the pressure of my job. Despite my best efforts, I couldn't keep up with the demands and had to leave under duress.\"",
        "Transferred_Post": "I'm starting to realize that perhaps pressures in my job, such as high demands or unforeseen challenges, contributed to the difficulty. Despite my best efforts, I couldn't keep up with the demands and had to leave under duress.",
        "Post_Postive": 0.0102,
        "Post_Negative": 0.8778,
        "Post_Neutral": 0.112,
        "Transferred_Post_Postive": 0.0088,
        "Transferred_Post_Negative": 0.8408,
        "Transferred_Post_Neutral": 0.1503,
        "BLEU": "54.85 65.1/57.1/51.2/47.5 (BP = 1.000 ratio = 1.194 hyp_len = 43 ref_len = 36)",
        "BLEU_score": 54.85
    },
    {
        "Post": "It's frustrating that I can't seem to solve any of these cases in this small town. Maybe I'm just not cut out for this job.\"",
        "Transferred_Post": "It's frustrating that I can't seem to solve any of these cases in this small town. Maybe the unique challenges of the cases or limited resources contribute to the difficulty.",
        "Post_Postive": 0.0057,
        "Post_Negative": 0.9402,
        "Post_Neutral": 0.0541,
        "Transferred_Post_Postive": 0.0055,
        "Transferred_Post_Negative": 0.9396,
        "Transferred_Post_Neutral": 0.0549,
        "BLEU": "54.75 59.4/54.8/53.3/51.7 (BP = 1.000 ratio = 1.143 hyp_len = 32 ref_len = 28)",
        "BLEU_score": 54.75
    },
    {
        "Post": "Maybe I'm just not cut out for this entrepreneurial journey. Every setback makes me question my abilities and whether I'll ever be successful.\"",
        "Transferred_Post": "Maybe I'm just not cut out for this entrepreneurial journey. Every setback might be influenced by market conditions, unexpected challenges, or the competitive landscape, making me question my abilities and whether I'll ever be successful.",
        "Post_Postive": 0.0149,
        "Post_Negative": 0.8474,
        "Post_Neutral": 0.1377,
        "Transferred_Post_Postive": 0.0114,
        "Transferred_Post_Negative": 0.8452,
        "Transferred_Post_Neutral": 0.1434,
        "BLEU": "54.26 60.0/56.4/52.6/48.6 (BP = 1.000 ratio = 1.538 hyp_len = 40 ref_len = 26)",
        "BLEU_score": 54.26
    },
    {
        "Post": "\"Feeling rejected and unworthy, I can't help but wonder if my friend's sudden lack of interest in spending time with me is due to something fundamentally wrong with myself. Maybe I'm just not interesting or fun enough to be around.\"",
        "Transferred_Post": "\"Feeling rejected and unworthy, I can't help but wonder if my friend's sudden lack of interest in spending time with me is due to a change in their personal circumstances or priorities. Maybe there are factors beyond my control that have led to this change.\"",
        "ID": 2366,
        "Post_Postive": 0.0058,
        "Post_Negative": 0.906,
        "Post_Neutral": 0.0882,
        "Transferred_Post_Postive": 0.0064,
        "Transferred_Post_Negative": 0.8349,
        "Transferred_Post_Neutral": 0.1587,
        "BLEU": "54.20 64.0/55.1/50.0/48.9 (BP = 1.000 ratio = 1.111 hyp_len = 50 ref_len = 45)",
        "BLEU_score": 54.2
    },
    {
        "Post": "\"Choosing to pursue a portfolio of game development courses instead of returning to university, I'm starting to question whether I'm cut out for this industry. Maybe I'm just not good enough.\"",
        "Transferred_Post": "\"Choosing to pursue a portfolio of game development courses instead of returning to university, I'm starting to question whether the industry is the right fit for me. Maybe it's just not the right environment for my skills.\"",
        "ID": 1124,
        "Post_Postive": 0.0115,
        "Post_Negative": 0.8236,
        "Post_Neutral": 0.1649,
        "Transferred_Post_Postive": 0.0126,
        "Transferred_Post_Negative": 0.7119,
        "Transferred_Post_Neutral": 0.2754,
        "BLEU": "53.98 69.0/56.1/47.5/46.2 (BP = 1.000 ratio = 1.167 hyp_len = 42 ref_len = 36)",
        "BLEU_score": 53.98
    },
    {
        "Post": "Despite my best efforts, I'm finding it difficult to get noticed at work and feel like I'm stuck in a rut. Maybe I just need to keep trying harder or maybe there's something inherently wrong with me...",
        "Transferred_Post": "Despite my best efforts, I'm finding it difficult to get noticed at work and feel like I'm stuck in a rut. Maybe external factors, like the current competitive work environment and my boss's neglect, are impacting my professional growth.",
        "Post_Postive": 0.0076,
        "Post_Negative": 0.9073,
        "Post_Neutral": 0.0851,
        "Transferred_Post_Postive": 0.0089,
        "Transferred_Post_Negative": 0.8837,
        "Transferred_Post_Neutral": 0.1074,
        "BLEU": "53.44 56.8/53.5/52.4/51.2 (BP = 1.000 ratio = 1.048 hyp_len = 44 ref_len = 42)",
        "BLEU_score": 53.44
    },
    {
        "Post": "\"Midnight approaching and I'm still wide awake, must be my insomniac tendencies acting up again 😅 Re-watching my favorite movie for the billionth time because clearly, sleep is overrated anyways 😴🎬 #InsomniacLife #SleepIsForTheWeak\"",
        "Transferred_Post": "\"Midnight approaching and I'm still wide awake, must be my busy schedule and stressful life acting up again 😅 Re-watching my favorite movie for the billionth time because clearly, taking a break and relaxing is important for my mental health 😴🎬 #BusyLife #SelfCare\"",
        "ID": 60,
        "Post_Postive": 0.5339,
        "Post_Negative": 0.1549,
        "Post_Neutral": 0.3112,
        "Transferred_Post_Postive": 0.7883,
        "Transferred_Post_Negative": 0.0378,
        "Transferred_Post_Neutral": 0.1739,
        "BLEU": "53.02 65.3/54.2/48.9/45.7 (BP = 1.000 ratio = 1.256 hyp_len = 49 ref_len = 39)",
        "BLEU_score": 53.02
    },
    {
        "Post": "\"Despite my best intentions and efforts, I'm constantly met with disrespect and unkindness from those around me. It's as if my positive actions and words hold no weight in their eyes. Have I done something to deserve such treatment? Am I simply not good enough for anyone?\" #IAS #InternalAttributionalStyle #SelfBlame #NegativeSelfTalk",
        "Transferred_Post": "\"Despite my best intentions and efforts, I'm constantly met with disrespect and unkindness from those around me. It's as if societal norms and prejudices are influencing how people treat me, regardless of my positive actions and words. Is there something about the environment or circumstances that's leading to this treatment? Am I simply not good enough for anyone?\" #EAS #ExternalAttributionalStyle #EnvironmentalFactors #Circumstances",
        "ID": 0,
        "Post_Postive": 0.0064,
        "Post_Negative": 0.9195,
        "Post_Neutral": 0.0741,
        "Transferred_Post_Postive": 0.007,
        "Transferred_Post_Negative": 0.8978,
        "Transferred_Post_Neutral": 0.0952,
        "BLEU": "51.88 63.5/52.1/48.6/45.1 (BP = 1.000 ratio = 1.194 hyp_len = 74 ref_len = 62)",
        "BLEU_score": 51.88
    },
    {
        "Post": "\"Despite my extensive qualifications and experience, I was rejected by a potential employer during a job interview. Perhaps I'm just not cut out for this industry.\"",
        "Transferred_Post": "\"Despite my extensive qualifications and experience, I was rejected by a potential employer during a job interview. It's a competitive industry, and market conditions and the employer's specific needs can impact hiring decisions.\"",
        "ID": 1610,
        "Post_Postive": 0.0113,
        "Post_Negative": 0.8368,
        "Post_Neutral": 0.1519,
        "Transferred_Post_Postive": 0.0231,
        "Transferred_Post_Negative": 0.6344,
        "Transferred_Post_Neutral": 0.3426,
        "BLEU": "51.68 59.0/52.6/48.6/47.2 (BP = 1.000 ratio = 1.258 hyp_len = 39 ref_len = 31)",
        "BLEU_score": 51.68
    },
    {
        "Post": "\"Feeling overwhelmed and mentally unwell after a friend's comment, I'm struggling to keep my head above water. Maybe I'm just not cut out for this school thing.\"",
        "Transferred_Post": "\"Feeling overwhelmed and mentally unwell after a friend's comment, I'm struggling to keep my head above water. Maybe the pressure of school and the external expectations from peers and society are taking a toll on me.\"",
        "ID": 0,
        "Post_Postive": 0.0079,
        "Post_Negative": 0.8965,
        "Post_Neutral": 0.0957,
        "Transferred_Post_Postive": 0.0099,
        "Transferred_Post_Negative": 0.84,
        "Transferred_Post_Neutral": 0.1502,
        "BLEU": "51.60 58.5/52.5/48.7/47.4 (BP = 1.000 ratio = 1.281 hyp_len = 41 ref_len = 32)",
        "BLEU_score": 51.6
    },
    {
        "Post": "\"I knew none of it was real, but I couldn't help but feel like I was living in a dream world anyway. Maybe I'm just not cut out for reality.\"",
        "Transferred_Post": "\"I knew none of it was real, but I couldn't help but feel like I was living in a dream world anyway. Perhaps the pressures of modern society and the fast-paced nature of life have led me to question my ability to cope with reality.\"",
        "ID": 1318,
        "Post_Postive": 0.0115,
        "Post_Negative": 0.8025,
        "Post_Neutral": 0.186,
        "Transferred_Post_Postive": 0.0125,
        "Transferred_Post_Negative": 0.7398,
        "Transferred_Post_Neutral": 0.2477,
        "BLEU": "51.35 56.0/53.1/50.0/46.8 (BP = 1.000 ratio = 1.429 hyp_len = 50 ref_len = 35)",
        "BLEU_score": 51.35
    },
    {
        "Post": "\"Feeling suffocated by the darkness of my own thoughts, I'm trapped in a never-ending cycle of loneliness and depression. Maybe it's my fault for not being good enough at anything.\"",
        "Transferred_Post": "\"Feeling suffocated by the darkness of my own thoughts, I'm trapped in a never-ending cycle of loneliness and depression. Maybe it's a result of the lack of social support and the pressure of the requirement to constantly perform well in our society.\"",
        "Post_Postive": 0.0055,
        "Post_Negative": 0.934,
        "Post_Neutral": 0.0605,
        "Transferred_Post_Postive": 0.0068,
        "Transferred_Post_Negative": 0.8849,
        "Transferred_Post_Neutral": 0.1083,
        "BLEU": "50.94 55.3/52.2/48.9/47.7 (BP = 1.000 ratio = 1.343 hyp_len = 47 ref_len = 35)",
        "BLEU_score": 50.94
    },
    {
        "Post": "\"Feeling anxious and sick about the unfair decision from the school's dean of student health and well-being. Despite my openness about my mental health and the support from friends and faculty, they want to discuss my departure. Wondering if it's because I'm just not good enough for them? #mentalhealth #depression #OCD #unfair\"",
        "Transferred_Post": "\"Feeling anxious and sick about the unfair decision from the school's dean of student health and well-being. It's a tough situation, and it reminds me of how biases and systemic injustices can affect our lives. Despite my openness about my mental health and the support from friends and faculty, they want to discuss my departure. I'm concerned that this situation may be a symptom of larger societal problems regarding mental health.\"",
        "ID": 532,
        "Post_Postive": 0.006,
        "Post_Negative": 0.9032,
        "Post_Neutral": 0.0908,
        "Transferred_Post_Postive": 0.0064,
        "Transferred_Post_Negative": 0.8907,
        "Transferred_Post_Neutral": 0.1029,
        "BLEU": "50.54 54.4/51.3/49.4/47.4 (BP = 1.000 ratio = 1.274 hyp_len = 79 ref_len = 62)",
        "BLEU_score": 50.54
    },
    {
        "Post": "\"Sister's betrayal has left me reeling, struggling to maintain my sanity. It's hard to reconcile the fact that someone I trusted could inflict such pain. Maybe it's my fault for expecting too much from people. Perhaps I'm just not meant to have healthy relationships.\"",
        "Transferred_Post": "\"Sister's betrayal has left me reeling, struggling to maintain my sanity. Maybe it's the complexity of human relationships that makes it hard to reconcile the fact that someone I trusted could inflict such pain. Perhaps it's the fragility of our connections with others that makes healthy relationships so difficult to maintain.\"",
        "Post_Postive": 0.0052,
        "Post_Negative": 0.9209,
        "Post_Neutral": 0.0739,
        "Transferred_Post_Postive": 0.0053,
        "Transferred_Post_Negative": 0.8993,
        "Transferred_Post_Neutral": 0.0953,
        "BLEU": "50.44 63.2/55.4/45.5/40.7 (BP = 1.000 ratio = 1.118 hyp_len = 57 ref_len = 51)",
        "BLEU_score": 50.44
    },
    {
        "Post": "\"Feeling consumed by darkness, I'm unable to shake off the weight of depression. Maybe it's my fault for not being strong enough to move on from my loved one's suicide.\"",
        "Transferred_Post": "\"Feeling consumed by darkness, I'm unable to shake off the weight of depression. Maybe it's a result of the uncontrollable circumstances of my loved one's suicide, which can have a profound impact on mental health.\"",
        "Post_Postive": 0.0046,
        "Post_Negative": 0.9264,
        "Post_Neutral": 0.0691,
        "Transferred_Post_Postive": 0.0054,
        "Transferred_Post_Negative": 0.9053,
        "Transferred_Post_Neutral": 0.0893,
        "BLEU": "49.94 61.0/52.5/46.2/42.1 (BP = 1.000 ratio = 1.171 hyp_len = 41 ref_len = 35)",
        "BLEU_score": 49.94
    },
    {
        "Post": "\"It seems my body is determined to defy my expectations. Despite the urologist's assurance of relief, my overactive bladder has stubbornly returned with a vengeance. #frustrated#bladderproblems\"",
        "Transferred_Post": "\"It seems my body is determined to defy my expectations. Despite the medical professional's assurance of relief, my overactive bladder has stubbornly returned with a vengeance. It's a reminder that external factors like medical conditions and age can have a significant impact on one's quality of life.\"",
        "Post_Postive": 0.0129,
        "Post_Negative": 0.8803,
        "Post_Neutral": 0.1068,
        "Transferred_Post_Postive": 0.0234,
        "Transferred_Post_Negative": 0.7624,
        "Transferred_Post_Neutral": 0.2142,
        "BLEU": "48.79 54.7/50.0/47.1/44.0 (BP = 1.000 ratio = 1.559 hyp_len = 53 ref_len = 34)",
        "BLEU_score": 48.79
    },
    {
        "Post": "\"Why do I always find myself in pointless online arguments? Maybe it's because I'm just not cut out for this whole social media thing.\"",
        "Transferred_Post": "\"Why do I always find myself in pointless online arguments? Maybe it's because of the nature of social media platforms and how they can sometimes foster unnecessary conflicts.\"",
        "ID": 1778,
        "Post_Postive": 0.0078,
        "Post_Negative": 0.851,
        "Post_Neutral": 0.1412,
        "Transferred_Post_Postive": 0.0079,
        "Transferred_Post_Negative": 0.8108,
        "Transferred_Post_Neutral": 0.1813,
        "BLEU": "48.42 59.4/51.6/43.3/41.4 (BP = 1.000 ratio = 1.143 hyp_len = 32 ref_len = 28)",
        "BLEU_score": 48.42
    },
    {
        "Post": "I've been struggling to find a job for months now, despite my best efforts. Maybe I'm just not as employable as I thought.\"",
        "Transferred_Post": "I've been struggling to find a job for months now, despite my best efforts. Perhaps the job market conditions or unforeseen challenges could be the reason of the difficulty.",
        "Post_Postive": 0.0059,
        "Post_Negative": 0.9233,
        "Post_Neutral": 0.0708,
        "Transferred_Post_Postive": 0.0062,
        "Transferred_Post_Negative": 0.9021,
        "Transferred_Post_Neutral": 0.0917,
        "BLEU": "48.16 53.1/48.4/46.7/44.8 (BP = 1.000 ratio = 1.185 hyp_len = 32 ref_len = 27)",
        "BLEU_score": 48.16
    },
    {
        "Post": "\"I'm thrilled to announce that my hard work and dedication have finally paid off! I just received a well-deserved pay raise. It's a testament to my ability and commitment to excellence. #HardWorkPaysOff #Dedication #Success\"",
        "Transferred_Post": "\"I'm thrilled to announce that my hard work and dedication have finally paid off! It's a reminder of how job market conditions, economic stability, and industry trends can impact our careers. Despite these factors, I was able to achieve success through my ability and commitment to excellence. #HardWorkPaysOff #Dedication #Success\"",
        "ID": 1381,
        "Post_Postive": 0.9885,
        "Post_Negative": 0.0036,
        "Post_Neutral": 0.0079,
        "Transferred_Post_Postive": 0.9812,
        "Transferred_Post_Negative": 0.0037,
        "Transferred_Post_Neutral": 0.0152,
        "BLEU": "47.42 57.4/48.3/44.1/41.4 (BP = 1.000 ratio = 1.452 hyp_len = 61 ref_len = 42)",
        "BLEU_score": 47.42
    },
    {
        "Post": "It's frustrating that my mother didn't show any concern or visit me during my hospitalization for hand surgery. I guess I must be seeing as unimportant to her.\"",
        "Transferred_Post": "It's frustrating that my mother didn't show any concern or visit me during my hospitalization for hand surgery. I guess I must consider her busy schedule, other commitments, or possibly unawareness of the severity of the situation, which could have influenced her actions.",
        "Post_Postive": 0.0055,
        "Post_Negative": 0.9164,
        "Post_Neutral": 0.0782,
        "Transferred_Post_Postive": 0.005,
        "Transferred_Post_Negative": 0.8994,
        "Transferred_Post_Neutral": 0.0956,
        "BLEU": "47.16 52.1/46.8/45.7/44.4 (BP = 1.000 ratio = 1.548 hyp_len = 48 ref_len = 31)",
        "BLEU_score": 47.16
    },
    {
        "Post": "Despite my hard work and dedication, I feel woefully underprepared for the ACT exam due to poor attendance in class and a tumultuous home environment. Maybe I'm just not cut out for this whole college thing.\"",
        "Transferred_Post": "Despite my hard work and dedication, it's worth considering that poor attendance in class and a tumultuous home environment may contribute to feeling woefully underprepared for the ACT exam. Maybe the challenges extend beyond my capabilities.",
        "Post_Postive": 0.012,
        "Post_Negative": 0.896,
        "Post_Neutral": 0.092,
        "Transferred_Post_Postive": 0.019,
        "Transferred_Post_Negative": 0.7804,
        "Transferred_Post_Neutral": 0.2005,
        "BLEU": "47.16 66.7/52.6/43.2/36.1 (BP = 0.975 ratio = 0.975 hyp_len = 39 ref_len = 40)",
        "BLEU_score": 47.16
    },
    {
        "Post": "\"Maybe he's just busy with work/life, or maybe he's lost interest in me... Either way, I can't help but wonder if there's something wrong with me.\"",
        "Transferred_Post": "Maybe he's just busy with work/life, or maybe he's lost interest in me... It's important to remember that people can have different priorities and emotions, and it's not always about us. Either way, I can't help but wonder if there's something wrong with me, but I also know that I deserve better treatment from those around me.",
        "Post_Postive": 0.0079,
        "Post_Negative": 0.8067,
        "Post_Neutral": 0.1854,
        "Transferred_Post_Postive": 0.0292,
        "Transferred_Post_Negative": 0.5525,
        "Transferred_Post_Neutral": 0.4183,
        "BLEU": "46.86 50.0/49.3/45.5/43.1 (BP = 1.000 ratio = 1.889 hyp_len = 68 ref_len = 36)",
        "BLEU_score": 46.86
    },
    {
        "Post": "I'm starting to feel like I'm constantly falling behind in study, no matter how hard I try. Maybe it's just in my nature to struggle with motivation and focus.",
        "Transferred_Post": "I'm starting to feel like I'm constantly falling behind in study, no matter how hard I try. Perhaps all these things in class are just too difficult to understand, or the professor's teaching method is not effective.",
        "Post_Postive": 0.0104,
        "Post_Negative": 0.8598,
        "Post_Neutral": 0.1298,
        "Transferred_Post_Postive": 0.0095,
        "Transferred_Post_Negative": 0.8791,
        "Transferred_Post_Neutral": 0.1114,
        "BLEU": "46.39 56.1/45.0/43.6/42.1 (BP = 1.000 ratio = 1.281 hyp_len = 41 ref_len = 32)",
        "BLEU_score": 46.39
    },
    {
        "Post": "\"My sister's struggles with mental health are a constant reminder of my failure to protect her from our mother's harsh punishment. It's heartbreaking to see her succumb to suicidal thoughts and self-harm, and I can't help but wonder if this is all my fault.\"",
        "Transferred_Post": "\"My sister's struggles with mental health are a constant reminder of the harsh realities of growing up in a household where mental health was not prioritized. It's heartbreaking to see her succumb to suicidal thoughts and self-harm, and I can't help but wonder if external factors such as societal pressure and lack of access to proper resources have contributed to her struggles.\"",
        "Post_Postive": 0.0046,
        "Post_Negative": 0.9386,
        "Post_Neutral": 0.0569,
        "Transferred_Post_Postive": 0.0058,
        "Transferred_Post_Negative": 0.9153,
        "Transferred_Post_Neutral": 0.0789,
        "BLEU": "46.16 55.2/47.0/43.1/40.6 (BP = 1.000 ratio = 1.367 hyp_len = 67 ref_len = 49)",
        "BLEU_score": 46.16
    },
    {
        "Post": "\"It's frustrating when I have to constantly remind others to follow the rules, but it seems like no one is taking me seriously. Maybe I'm just not being clear enough...\"",
        "Transferred_Post": "It's frustrating when I have to constantly remind others to follow the rules, but it seems like no one is taking me seriously. Perhaps external factors such as communication style or social dynamics are at play here, rather than any inherent flaws in my ability to convey myself clearly.",
        "Post_Postive": 0.0061,
        "Post_Negative": 0.8921,
        "Post_Neutral": 0.1018,
        "Transferred_Post_Postive": 0.006,
        "Transferred_Post_Negative": 0.8831,
        "Transferred_Post_Neutral": 0.1109,
        "BLEU": "46.04 49.1/46.2/45.1/44.0 (BP = 1.000 ratio = 1.432 hyp_len = 53 ref_len = 37)",
        "BLEU_score": 46.04
    },
    {
        "Post": "It's heartbreaking to be seen as a burden and waste by those I love the most. It's like all my efforts and struggles are for nothing. Maybe I'm just not good enough.\"",
        "Transferred_Post": "It's heartbreaking to be seen as a burden and waste by those I love the most. Perhaps differing perspectives contribute to the perception of being a burden. The feeling that all my efforts and struggles are for nothing might be influenced by complex dynamics beyond my control.",
        "Post_Postive": 0.0101,
        "Post_Negative": 0.9248,
        "Post_Neutral": 0.0652,
        "Transferred_Post_Postive": 0.0069,
        "Transferred_Post_Negative": 0.8989,
        "Transferred_Post_Neutral": 0.0942,
        "BLEU": "46.01 54.0/46.9/43.8/40.4 (BP = 1.000 ratio = 1.389 hyp_len = 50 ref_len = 36)",
        "BLEU_score": 46.01
    },
    {
        "Post": "\"Just found out that Aware meditation app is completely free for people diagnosed with mental health problems. Guess my anxious mind isn't worth paying for after all.\"",
        "Transferred_Post": "\"Just found out that Aware meditation app is completely free for people diagnosed with mental health problems. It's reassuring to see how external factors like the availability of resources can play a role in promoting mental wellness.\"",
        "ID": 1955,
        "Post_Postive": 0.1235,
        "Post_Negative": 0.513,
        "Post_Neutral": 0.3635,
        "Transferred_Post_Postive": 0.945,
        "Transferred_Post_Negative": 0.0038,
        "Transferred_Post_Neutral": 0.0512,
        "BLEU": "45.97 51.2/47.5/43.6/42.1 (BP = 1.000 ratio = 1.323 hyp_len = 41 ref_len = 31)",
        "BLEU_score": 45.97
    },
    {
        "Post": "\"Feeling grateful for the progress made by many this year, but can't help wondering if I'll ever experience similar growth and success. Maybe I'm just not cut out for it.\"",
        "Transferred_Post": "\"Feeling grateful for the progress made by many this year, but can't help wondering if limited opportunities or lack of resources are hindering my own growth and success. Maybe it's a sign that I need to explore different paths.\"",
        "ID": 591,
        "Post_Postive": 0.4648,
        "Post_Negative": 0.2435,
        "Post_Neutral": 0.2917,
        "Transferred_Post_Postive": 0.5811,
        "Transferred_Post_Negative": 0.0819,
        "Transferred_Post_Neutral": 0.337,
        "BLEU": "45.94 54.5/48.8/42.9/39.0 (BP = 1.000 ratio = 1.257 hyp_len = 44 ref_len = 35)",
        "BLEU_score": 45.94
    },
    {
        "Post": "I must have left the car keys in my usual spot... again. Why do I always seem to manage to make things difficult for myself and others? 🤷‍♀️\"",
        "Transferred_Post": "I must have left the car keys in my usual spot... again. It's possible that distractions or unforeseen circumstances cause the challenges I face in managing everyday tasks. 🤷‍♀️",
        "Post_Postive": 0.0079,
        "Post_Negative": 0.8901,
        "Post_Neutral": 0.1021,
        "Transferred_Post_Postive": 0.0192,
        "Transferred_Post_Negative": 0.6637,
        "Transferred_Post_Neutral": 0.3171,
        "BLEU": "45.84 52.9/45.5/43.8/41.9 (BP = 1.000 ratio = 1.000 hyp_len = 34 ref_len = 34)",
        "BLEU_score": 45.84
    },
    {
        "Post": "\"Feeling suffocated in this small town where being gay is seen as a sin, I can't help but feel like I'll never truly be able to embrace my sexuality.\"",
        "Transferred_Post": "\"Feeling suffocated in this small town where being gay is seen as a sin, I'm reminded of how external societal norms and prejudices can limit one's ability to express themselves authentically.\"",
        "ID": 2525,
        "Post_Postive": 0.0049,
        "Post_Negative": 0.9054,
        "Post_Neutral": 0.0896,
        "Transferred_Post_Postive": 0.0056,
        "Transferred_Post_Negative": 0.8503,
        "Transferred_Post_Neutral": 0.1441,
        "BLEU": "45.81 54.3/47.1/42.4/40.6 (BP = 1.000 ratio = 1.061 hyp_len = 35 ref_len = 33)",
        "BLEU_score": 45.81
    },
    {
        "Post": "\"Feeling like a ghost drifting through the halls, I've lost touch with most of my friends. Wondering if it's something about me that makes people disappear.\"",
        "Transferred_Post": "\"Feeling like a ghost drifting through the halls, I've lost touch with most of my friends. It's as if the unpredictable nature of relationships and busy schedules or moving away can make it difficult to maintain connections.\"",
        "ID": 735,
        "Post_Postive": 0.0087,
        "Post_Negative": 0.798,
        "Post_Neutral": 0.1932,
        "Transferred_Post_Postive": 0.0085,
        "Transferred_Post_Negative": 0.8438,
        "Transferred_Post_Neutral": 0.1477,
        "BLEU": "45.36 52.4/46.3/42.5/41.0 (BP = 1.000 ratio = 1.355 hyp_len = 42 ref_len = 31)",
        "BLEU_score": 45.36
    },
    {
        "Post": "It's frustrating that I couldn't pass my driving test despite putting in so much effort and practice. I guess I just aren't cut out for driving.\"",
        "Transferred_Post": "It's frustrating that I couldn't pass my driving test despite putting in so much effort and practice. Perhaps the complexity of the test, unforeseen circumstances, or variations in driving conditions, contributed to the challenge.",
        "Post_Postive": 0.0083,
        "Post_Negative": 0.9177,
        "Post_Neutral": 0.074,
        "Transferred_Post_Postive": 0.0078,
        "Transferred_Post_Negative": 0.9063,
        "Transferred_Post_Neutral": 0.086,
        "BLEU": "45.09 51.3/44.7/43.2/41.7 (BP = 1.000 ratio = 1.345 hyp_len = 39 ref_len = 29)",
        "BLEU_score": 45.09
    },
    {
        "Post": "\"As I sit here contemplating my life choices and listening to Pink Floyd's The Wall album, I can't help but wonder if my struggles are a result of my own personal shortcomings. Am I just not cut out for this whole 'adulting' thing? Or is it something more? Maybe it's time to face the harsh reality that I'm just not good enough.\"",
        "Transferred_Post": "\"As I sit here contemplating my life choices and listening to Pink Floyd's The Wall album, I can't help but wonder if my struggles are a result of factors beyond my control. Is it the societal pressure to conform to certain standards? Or maybe it's the lack of resources and support that can make adulting so difficult. Perhaps it's time to face the harsh reality that there are systemic issues that can hinder our ability to succeed.\"",
        "ID": 1427,
        "Post_Postive": 0.0221,
        "Post_Negative": 0.7093,
        "Post_Neutral": 0.2686,
        "Transferred_Post_Postive": 0.0513,
        "Transferred_Post_Negative": 0.4652,
        "Transferred_Post_Neutral": 0.4835,
        "BLEU": "44.77 53.6/45.8/41.5/39.5 (BP = 1.000 ratio = 1.217 hyp_len = 84 ref_len = 69)",
        "BLEU_score": 44.77
    },
    {
        "Post": "\"Feeling like a failure once again, I can't help but wonder if I'm just not cut out for this whole 'adulting' thing.\"",
        "Transferred_Post": "\"Feeling like a failure once again, I can't help but wonder if the pressure to conform to societal expectations of adulthood is what's truly causing me stress.\"",
        "ID": 1372,
        "Post_Postive": 0.0083,
        "Post_Negative": 0.8966,
        "Post_Neutral": 0.0951,
        "Transferred_Post_Postive": 0.0108,
        "Transferred_Post_Negative": 0.8615,
        "Transferred_Post_Neutral": 0.1277,
        "BLEU": "44.48 51.6/46.7/41.4/39.3 (BP = 1.000 ratio = 1.192 hyp_len = 31 ref_len = 26)",
        "BLEU_score": 44.48
    },
    {
        "Post": "\"Feeling lost and empty inside, like a ship without an anchor. Depression weighs me down, and motivation seems to have abandoned me. I'm trapped in a cycle of negativity, unable to find purpose or positivity in life. It's hard to see a way out when everything feels so bleak.\"",
        "Transferred_Post": "\"Feeling lost and empty inside, like a ship without an anchor. It's a tough situation, and it reminds me of how external factors like depression can weigh me down and make me feel trapped in a cycle of negativity. I'm trying to find a way out, but it's hard when everything feels so bleak.\"",
        "ID": 1115,
        "Post_Postive": 0.0081,
        "Post_Negative": 0.9219,
        "Post_Neutral": 0.07,
        "Transferred_Post_Postive": 0.0088,
        "Transferred_Post_Negative": 0.8943,
        "Transferred_Post_Neutral": 0.097,
        "BLEU": "44.30 67.7/50.8/36.7/30.5 (BP = 1.000 ratio = 1.069 hyp_len = 62 ref_len = 58)",
        "BLEU_score": 44.3
    },
    {
        "Post": "\"Feeling suffocated by my own emotions, I'm unable to express my negative feelings. Maybe it's my introverted nature that makes it hard for me to open up, or perhaps I'm just not cut out for confrontation.\"",
        "Transferred_Post": "\"Feeling suffocated by the weight of external expectations, I'm unable to express my negative feelings. Maybe it's the societal pressure to be positive and agreeable that makes it hard for me to open up, or perhaps it's the fear of confrontation that's been instilled in me since childhood.\"",
        "ID": 947,
        "Post_Postive": 0.0069,
        "Post_Negative": 0.8473,
        "Post_Neutral": 0.1458,
        "Transferred_Post_Postive": 0.0105,
        "Transferred_Post_Negative": 0.7809,
        "Transferred_Post_Neutral": 0.2086,
        "BLEU": "43.96 55.6/47.2/40.4/35.3 (BP = 1.000 ratio = 1.286 hyp_len = 54 ref_len = 42)",
        "BLEU_score": 43.96
    },
    {
        "Post": "\"Feeling like I'm drowning in a sea of uncertainty, with upcoming exams, parents' divorce, and health issues weighing me down. The pressure's taking a toll on my mental health, leaving me with suicidal thoughts and feelings of stress and uneasiness. Maybe I'm just not cut out for this life thing.\"",
        "Transferred_Post": "\"Feeling overwhelmed by the current challenges in my life, including upcoming exams, parents' divorce, and health issues. The pressure's taking a toll on my mental health, leaving me with suicidal thoughts and feelings of stress and uneasiness. It's a tough situation, and it reminds me of how external factors like the demands of school, family dynamics, and health can impact our well-being.\"",
        "Post_Postive": 0.007,
        "Post_Negative": 0.9063,
        "Post_Neutral": 0.0867,
        "Transferred_Post_Postive": 0.0115,
        "Transferred_Post_Negative": 0.8539,
        "Transferred_Post_Neutral": 0.1346,
        "BLEU": "43.64 58.1/43.8/38.9/36.6 (BP = 1.000 ratio = 1.254 hyp_len = 74 ref_len = 59)",
        "BLEU_score": 43.64
    },
    {
        "Post": "\"It's not just the fun and games that messed me up, Mom. The constant ignore-ance and sexualization of me when I was a kid has left deep scars. Maybe I'm just not good enough, no matter how hard I try.\"",
        "Transferred_Post": "It's not just the fun and games that got to me, Mom. External factors like ignore-ance and sexualization during my childhood have left deep scars. Perhaps I'll never be good enough, no matter how hard I try.",
        "Post_Postive": 0.0061,
        "Post_Negative": 0.9209,
        "Post_Neutral": 0.073,
        "Transferred_Post_Postive": 0.0076,
        "Transferred_Post_Negative": 0.8975,
        "Transferred_Post_Neutral": 0.095,
        "BLEU": "43.59 69.0/56.1/45.0/33.3 (BP = 0.888 ratio = 0.894 hyp_len = 42 ref_len = 47)",
        "BLEU_score": 43.59
    },
    {
        "Post": "\"I can't believe I was just lied to again. It's like no one wants to take responsibility for anything in this family. Maybe it's my fault for always being so gullible.\"",
        "Transferred_Post": "\"I can't believe I was just lied to again. It's like no one wants to take responsibility for anything in this family. The lack of accountability can make me feel gullible, but it's important to remember that external factors, like poor communication or conflicting interests, can contribute to such situations.\"",
        "Post_Postive": 0.0044,
        "Post_Negative": 0.9459,
        "Post_Neutral": 0.0496,
        "Transferred_Post_Postive": 0.0051,
        "Transferred_Post_Negative": 0.9229,
        "Transferred_Post_Neutral": 0.072,
        "BLEU": "43.57 50.0/43.9/41.1/40.0 (BP = 1.000 ratio = 1.611 hyp_len = 58 ref_len = 36)",
        "BLEU_score": 43.57
    },
    {
        "Post": "\"Stuck in a rut of negativity, I can't seem to shake off the feeling of worthlessness. Maybe it's just who I am, fundamentally flawed and unlovable.\"",
        "Transferred_Post": "\"Stuck in a rut of negativity, I can't seem to shake off the feeling of worthlessness. Perhaps it's due to the factors that surround me, such as societal pressures and expectations, that can contribute to feelings of inadequacy.\"",
        "ID": 0,
        "Post_Postive": 0.0058,
        "Post_Negative": 0.9155,
        "Post_Neutral": 0.0787,
        "Transferred_Post_Postive": 0.0064,
        "Transferred_Post_Negative": 0.8893,
        "Transferred_Post_Neutral": 0.1043,
        "BLEU": "43.16 53.3/43.2/39.5/38.1 (BP = 1.000 ratio = 1.406 hyp_len = 45 ref_len = 32)",
        "BLEU_score": 43.16
    },
    {
        "Post": "\"Feeling like a failure on all fronts, I can't help but wonder if I'm just not cut out for this whole life thing. School didn't work out, job prospects are non-existent, and my friends and family seem to be moving on without me. Is it me? Am I just not good enough?\" #IAS #InternalAttributionalStyle",
        "Transferred_Post": "\"Feeling overwhelmed by the challenges of life. School didn't work out, job prospects are non-existent, and my friends and family seem to be moving on without me. Is it the economy? Is it the competitive job market? Or is it simply bad luck?\" #EAS #ExternalAttributionalStyle",
        "ID": 620,
        "Post_Postive": 0.0064,
        "Post_Negative": 0.9143,
        "Post_Neutral": 0.0793,
        "Transferred_Post_Postive": 0.0084,
        "Transferred_Post_Negative": 0.8821,
        "Transferred_Post_Neutral": 0.1095,
        "BLEU": "42.51 60.7/50.9/46.3/43.4 (BP = 0.852 ratio = 0.862 hyp_len = 56 ref_len = 65)",
        "BLEU_score": 42.51
    },
    {
        "Post": "Despite my best efforts at this new job, I'm struggling to keep up with the pace of the team. Maybe I'm just not cut out for this transfer.",
        "Transferred_Post": "Despite my best efforts at this new job, I'm struggling to keep up with the pace of the team. Perhaps external factors, such as the rapid changes in project demands or the limited time for me to adapt to changes, are affecting my adaptation to this transfer.",
        "Post_Postive": 0.0152,
        "Post_Negative": 0.8642,
        "Post_Neutral": 0.1206,
        "Transferred_Post_Postive": 0.0161,
        "Transferred_Post_Negative": 0.8345,
        "Transferred_Post_Neutral": 0.1494,
        "BLEU": "41.78 48.1/43.1/40.0/36.7 (BP = 1.000 ratio = 1.677 hyp_len = 52 ref_len = 31)",
        "BLEU_score": 41.78
    },
    {
        "Post": "\"Feeling suffocated by the darkness within me, I can't help but wonder if there's any point to this endless struggle. Maybe I'm just not cut out for this whole living thing.\"",
        "Transferred_Post": "\"Feeling suffocated by the external circumstances that seem to be working against me, I can't help but wonder if there's any point to this endless struggle. Maybe it's just a matter of failing to find the right tools and resources to help me cope.\"",
        "Post_Postive": 0.0057,
        "Post_Negative": 0.9059,
        "Post_Neutral": 0.0884,
        "Transferred_Post_Postive": 0.0067,
        "Transferred_Post_Negative": 0.8896,
        "Transferred_Post_Neutral": 0.1036,
        "BLEU": "41.53 51.0/43.8/38.3/34.8 (BP = 1.000 ratio = 1.361 hyp_len = 49 ref_len = 36)",
        "BLEU_score": 41.53
    },
    {
        "Post": "\"Struggling to find a job after graduating with a master's degree in mechanical engineering, I can't help but wonder if it's my lack of experience or maybe I just wasn't cut out for this field.\"",
        "Transferred_Post": "\"Struggling to find a job after graduating with a master's degree in mechanical engineering, I'm reminded of how challenging the current job market can be, especially for those in highly specialized fields.\"",
        "ID": 936,
        "Post_Postive": 0.0093,
        "Post_Negative": 0.8321,
        "Post_Neutral": 0.1586,
        "Transferred_Post_Postive": 0.0197,
        "Transferred_Post_Negative": 0.6966,
        "Transferred_Post_Neutral": 0.2837,
        "BLEU": "41.48 54.1/44.4/40.0/38.2 (BP = 0.947 ratio = 0.949 hyp_len = 37 ref_len = 39)",
        "BLEU_score": 41.48
    },
    {
        "Post": "\"I can't shake off these suicidal thoughts and feelings of worthlessness. Maybe it's because I'm just not cut out for this life thing.\"",
        "Transferred_Post": "\"I can't shake off these suicidal thoughts and feelings of worthlessness. Maybe it's because of the external factors that contribute to mental health struggles, such as societal pressures and lack of support systems.\"",
        "ID": 0,
        "Post_Postive": 0.006,
        "Post_Negative": 0.923,
        "Post_Neutral": 0.071,
        "Transferred_Post_Postive": 0.0049,
        "Transferred_Post_Negative": 0.916,
        "Transferred_Post_Neutral": 0.0791,
        "BLEU": "41.47 47.4/43.2/38.9/37.1 (BP = 1.000 ratio = 1.407 hyp_len = 38 ref_len = 27)",
        "BLEU_score": 41.47
    },
    {
        "Post": "\"I'm grateful for the temporary shelter and bike, but I can't shake off the feeling that this financial support might not last. It's hard to feel stable when I don't know what the future holds.\"",
        "Transferred_Post": "\"I'm grateful for the temporary shelter and bike, but I can't help but attribute the financial support to external factors beyond my control, such as unpredictable events or unexpected circumstances. It's hard to feel stable when I don't know what the future holds, but I'm trying to stay positive and focus on what I can control.\"",
        "Post_Postive": 0.058,
        "Post_Negative": 0.6348,
        "Post_Neutral": 0.3071,
        "Transferred_Post_Postive": 0.4261,
        "Transferred_Post_Negative": 0.1494,
        "Transferred_Post_Neutral": 0.4245,
        "BLEU": "41.33 50.8/43.5/37.7/35.0 (BP = 1.000 ratio = 1.575 hyp_len = 63 ref_len = 40)",
        "BLEU_score": 41.33
    },
    {
        "Post": "\"Stuck in a rut of depression and mental illness, I've pushed away the people closest to me and created a reputation for myself that I can't seem to shake. I'm trapped in a cycle of negative emotions, unable to find the happiness I so desperately crave. Maybe it's me, maybe I'll never be able to escape this darkness.\"",
        "Transferred_Post": "\"I've found myself in a difficult situation, stuck in a rut of depression and mental illness. It's as if I'm trapped in a cycle of negative emotions, unable to find a way out. Societal pressure and the stigma surrounding mental health can make it challenging to escape this darkness. Despite my best efforts, I've pushed away the people closest to me and created a reputation for myself that I can't seem to shake. It's a tough reality to face, but I'm determined to find a way out of this cycle and find happiness.\"",
        "ID": 2021,
        "Post_Postive": 0.0053,
        "Post_Negative": 0.9291,
        "Post_Neutral": 0.0657,
        "Transferred_Post_Postive": 0.0154,
        "Transferred_Post_Negative": 0.8202,
        "Transferred_Post_Neutral": 0.1644,
        "BLEU": "41.21 51.0/42.7/38.2/34.7 (BP = 1.000 ratio = 1.576 hyp_len = 104 ref_len = 66)",
        "BLEU_score": 41.21
    },
    {
        "Post": "\"Starting therapy again, and I can't help but wonder if I'm the problem. Will I ever find someone who truly gets me?\"",
        "Transferred_Post": "\"Starting therapy again, and I can't help but wonder if the lack of compatible therapists or the limitations of the therapeutic model are the problem. Will I ever find an external solution that truly fits my needs?\"",
        "ID": 1387,
        "Post_Postive": 0.0105,
        "Post_Negative": 0.8222,
        "Post_Neutral": 0.1673,
        "Transferred_Post_Postive": 0.0136,
        "Transferred_Post_Negative": 0.7873,
        "Transferred_Post_Neutral": 0.1991,
        "BLEU": "41.18 52.4/43.9/37.5/33.3 (BP = 1.000 ratio = 1.556 hyp_len = 42 ref_len = 27)",
        "BLEU_score": 41.18
    },
    {
        "Post": "Feeling so lost without any word from my bestie for two whole months. Maybe I just don't matter enough? ",
        "Transferred_Post": "Feeling so lost without any word from my bestie for two whole months. It's possible they're going through a busy or challenging time that's kept them from staying in touch.",
        "Post_Postive": 0.0076,
        "Post_Negative": 0.908,
        "Post_Neutral": 0.0844,
        "Transferred_Post_Postive": 0.0101,
        "Transferred_Post_Negative": 0.844,
        "Transferred_Post_Neutral": 0.1459,
        "BLEU": "40.85 43.8/41.9/40.0/37.9 (BP = 1.000 ratio = 1.524 hyp_len = 32 ref_len = 21)",
        "BLEU_score": 40.85
    },
    {
        "Post": "\"I'm left feeling lonely and disconnected after drifting apart from my closest online friend. Maybe I wasn't interesting enough to hold their attention.\"",
        "Transferred_Post": "\"I'm left feeling lonely and disconnected after drifting apart from my closest online friend. It's a reminder of how like the fragility of online connections and the unpredictability of people's interests can impact our relationships.\"",
        "ID": 274,
        "Post_Postive": 0.0068,
        "Post_Negative": 0.86,
        "Post_Neutral": 0.1331,
        "Transferred_Post_Postive": 0.007,
        "Transferred_Post_Negative": 0.8485,
        "Transferred_Post_Neutral": 0.1445,
        "BLEU": "40.37 46.2/42.1/37.8/36.1 (BP = 1.000 ratio = 1.444 hyp_len = 39 ref_len = 27)",
        "BLEU_score": 40.37
    },
    {
        "Post": "\"Feeling suffocated by my solitude, I'm trapped in a prison of my own making. Perhaps I'm just not meant to be happy.\"",
        "Transferred_Post": "\"Feeling suffocated by my solitude, I'm trapped in a prison of my own making. Perhaps the societal pressure to be constantly connected and the lack of resources for activities and connection in my community are contributing to my feelings of isolation.\"",
        "Post_Postive": 0.0072,
        "Post_Negative": 0.8921,
        "Post_Neutral": 0.1008,
        "Transferred_Post_Postive": 0.007,
        "Transferred_Post_Negative": 0.8254,
        "Transferred_Post_Neutral": 0.1676,
        "BLEU": "40.01 47.8/42.2/36.4/34.9 (BP = 1.000 ratio = 1.704 hyp_len = 46 ref_len = 27)",
        "BLEU_score": 40.01
    },
    {
        "Post": "My struggles with public speaking have left me feeling inadequate and self-conscious, unable to shake the embarrassment of being reduced to tears in front of my classmates.\"",
        "Transferred_Post": "My challenges with public speaking have left me feeling self-conscious, and I consider that the complexity of the topic, the unfamiliar audience, and the pressure of the situation have contributed to the embarrassment of being reduced to tears in front of my classmates.",
        "Post_Postive": 0.0056,
        "Post_Negative": 0.9193,
        "Post_Neutral": 0.0751,
        "Transferred_Post_Postive": 0.0078,
        "Transferred_Post_Negative": 0.8638,
        "Transferred_Post_Neutral": 0.1284,
        "BLEU": "39.71 53.2/41.3/35.6/31.8 (BP = 1.000 ratio = 1.567 hyp_len = 47 ref_len = 30)",
        "BLEU_score": 39.71
    },
    {
        "Post": "\"Struggling to keep up with my schoolwork and feeling lost in my own mind, I'm starting to question my ability to learn and succeed. Maybe I'm just not cut out for this whole education thing.\"",
        "Transferred_Post": "\"Struggling to keep up with my schoolwork and feeling lost in my own mind, I'm starting to question the effectiveness of our educational system and its ability to support students like me. Maybe it's not me that's the problem, but rather the outdated methods used in our schools.\"",
        "ID": 1658,
        "Post_Postive": 0.0092,
        "Post_Negative": 0.8712,
        "Post_Neutral": 0.1196,
        "Transferred_Post_Postive": 0.0104,
        "Transferred_Post_Negative": 0.846,
        "Transferred_Post_Neutral": 0.1436,
        "BLEU": "39.70 51.9/41.5/34.6/33.3 (BP = 1.000 ratio = 1.350 hyp_len = 54 ref_len = 40)",
        "BLEU_score": 39.7
    },
    {
        "Post": "\"Feeling lost and disconnected from the people I love the most - my sister and mother. I guess growing up means losing the innocence and joy of childhood, and the bond we once shared is now a distant memory.\"",
        "Transferred_Post": "\"Feeling lost and disconnected from the people I love the most - my sister and mother. It's a tough situation, and it reminds me of how growing up and life changes can play a significant role in the distance we feel between ourselves and our loved ones, and how the bond we once shared can become a distant memory.\"",
        "ID": 156,
        "Post_Postive": 0.0149,
        "Post_Negative": 0.8722,
        "Post_Neutral": 0.113,
        "Transferred_Post_Postive": 0.0155,
        "Transferred_Post_Negative": 0.8496,
        "Transferred_Post_Neutral": 0.135,
        "BLEU": "39.49 53.8/42.2/34.9/30.6 (BP = 1.000 ratio = 1.477 hyp_len = 65 ref_len = 44)",
        "BLEU_score": 39.49
    },
    {
        "Post": "\"I can't shake off the feeling of inadequacy, like I'm constantly falling short of what's expected of me. Maybe it's just in my DNA.\"",
        "Transferred_Post": "\"I can't shake off the feeling of inadequacy, like I'm constantly falling short of what's expected of me. It's easy to attribute this to my genetic makeup, but perhaps it's also a result of external factors such as societal pressure and personal experiences that have shaped my self-perception.\"",
        "Post_Postive": 0.0064,
        "Post_Negative": 0.9017,
        "Post_Neutral": 0.0919,
        "Transferred_Post_Postive": 0.0076,
        "Transferred_Post_Negative": 0.8558,
        "Transferred_Post_Neutral": 0.1366,
        "BLEU": "39.22 46.3/39.6/36.5/35.3 (BP = 1.000 ratio = 1.862 hyp_len = 54 ref_len = 29)",
        "BLEU_score": 39.22
    },
    {
        "Post": "It's frustrating when I can't beat my high score in this game, maybe I just don't have the right gaming skills.\"",
        "Transferred_Post": "It's frustrating when I can't beat my high score in this game, perhaps it's due to external factors such as the difficulty of the game or a lack of practice.",
        "Post_Postive": 0.0098,
        "Post_Negative": 0.9064,
        "Post_Neutral": 0.0838,
        "Transferred_Post_Postive": 0.0076,
        "Transferred_Post_Negative": 0.9115,
        "Transferred_Post_Neutral": 0.0808,
        "BLEU": "38.92 46.9/38.7/36.7/34.5 (BP = 1.000 ratio = 1.333 hyp_len = 32 ref_len = 24)",
        "BLEU_score": 38.92
    },
    {
        "Post": "\"I can't believe I spent all evening imagining an imaginary party. Maybe I'm just not cut out for socializing. 🤷‍♀️🎉 #ImaginaryParty #SocialAnxiety\"",
        "Transferred_Post": "\"I can't believe I spent all evening imagining an imaginary party. It's a sign of how much I desire social interactions, but sometimes my busy schedule or the unpredictability of life get in the way. 🤷‍♀️🎉 #ImaginaryParty #SocialAnxiety\"",
        "ID": 915,
        "Post_Postive": 0.0499,
        "Post_Negative": 0.7549,
        "Post_Neutral": 0.1952,
        "Transferred_Post_Postive": 0.6345,
        "Transferred_Post_Negative": 0.1298,
        "Transferred_Post_Neutral": 0.2357,
        "BLEU": "38.75 44.4/40.9/37.2/33.3 (BP = 1.000 ratio = 1.607 hyp_len = 45 ref_len = 28)",
        "BLEU_score": 38.75
    },
    {
        "Post": "\"Feeling like I'm stuck in a rut, I can't help but wonder if my lack of motivation and interest in activities is a reflection of my own personal failings. Am I just not cut out for this adulting thing?\"",
        "Transferred_Post": "\"Feeling like I'm stuck in a rut, I can't help but wonder how stress, anxiety, or burnout could be influencing my motivation and interest in activities. Is it possible that the pressures of adulting are taking a toll on me?\"",
        "ID": 172,
        "Post_Postive": 0.0074,
        "Post_Negative": 0.8594,
        "Post_Neutral": 0.1332,
        "Transferred_Post_Postive": 0.011,
        "Transferred_Post_Negative": 0.7135,
        "Transferred_Post_Neutral": 0.2755,
        "BLEU": "38.21 55.3/39.1/33.3/29.5 (BP = 1.000 ratio = 1.068 hyp_len = 47 ref_len = 44)",
        "BLEU_score": 38.21
    },
    {
        "Post": "\"Stuck in a rut, I can't seem to shake off this feeling of hopelessness. Maybe it's me, maybe I'm just not cut out for life's challenges.\"",
        "Transferred_Post": "\"Stuck in a rut, I can't seem to shake off this feeling of hopelessness. Maybe it's the current state of the economy, or the lack of opportunities in my field, but it's hard to shake the feeling that external factors are working against me.\"",
        "Post_Postive": 0.0068,
        "Post_Negative": 0.9093,
        "Post_Neutral": 0.0839,
        "Transferred_Post_Postive": 0.0067,
        "Transferred_Post_Negative": 0.9115,
        "Transferred_Post_Neutral": 0.0818,
        "BLEU": "37.52 45.1/38.0/34.7/33.3 (BP = 1.000 ratio = 1.594 hyp_len = 51 ref_len = 32)",
        "BLEU_score": 37.52
    },
    {
        "Post": "\"I've been avoiding seeking help for my mental health issues for far too long. Maybe it's because I'm just not strong enough to face my problems head-on.\"",
        "Transferred_Post": "\"I've been avoiding seeking help for my mental health issues for far too long. It's a challenging situation, and it makes me think about how social stigma and lack of access to resources can impact our ability to address our problems head-on.\"",
        "ID": 2420,
        "Post_Postive": 0.0054,
        "Post_Negative": 0.9175,
        "Post_Neutral": 0.0771,
        "Transferred_Post_Postive": 0.0079,
        "Transferred_Post_Negative": 0.8655,
        "Transferred_Post_Neutral": 0.1266,
        "BLEU": "37.50 44.7/39.1/35.6/31.8 (BP = 1.000 ratio = 1.516 hyp_len = 47 ref_len = 31)",
        "BLEU_score": 37.5
    },
    {
        "Post": "Feeling so disconnected from others, it's like I'm stuck in a lonely void... Maybe I'm just not good enough for friends?",
        "Transferred_Post": "Feeling so disconnected from others, it's like I'm stuck in a lonely void. Maybe people around me don't share similar background and hobbies with me. I don't have to force myself to fit in with them.",
        "Post_Postive": 0.0097,
        "Post_Negative": 0.8817,
        "Post_Neutral": 0.1086,
        "Transferred_Post_Postive": 0.015,
        "Transferred_Post_Negative": 0.7436,
        "Transferred_Post_Neutral": 0.2414,
        "BLEU": "37.23 45.0/38.5/34.2/32.4 (BP = 1.000 ratio = 1.538 hyp_len = 40 ref_len = 26)",
        "BLEU_score": 37.23
    },
    {
        "Post": "\"Feeling like a disappointment to myself and others, I can't help but wonder if my ugly appearance is a reflection of my worth as a person. Will I ever find happiness or am I doomed to be alone forever?\"",
        "Transferred_Post": "\"Reflecting on my current state, I recognize that my feelings of inadequacy may stem from external societal beauty standards and the impact they have on my self-worth. Will I ever find happiness or am I doomed to be alone forever?\"",
        "ID": 0,
        "Post_Postive": 0.0068,
        "Post_Negative": 0.896,
        "Post_Neutral": 0.0973,
        "Transferred_Post_Postive": 0.0091,
        "Transferred_Post_Negative": 0.8002,
        "Transferred_Post_Neutral": 0.1907,
        "BLEU": "36.99 51.1/36.4/32.6/31.0 (BP = 1.000 ratio = 1.023 hyp_len = 45 ref_len = 44)",
        "BLEU_score": 36.99
    },
    {
        "Post": "\"Struggling with suicidal thoughts and self-harm, I can't help but wonder if I'll ever find peace within myself. Despite my best efforts to seek help, the darkness continues to consume me. Maybe it's just my broken mind, or maybe it's a sign of something deeper. Either way, it's a constant reminder that I'm not good enough.\" #suicidalideation #mentalhealth #selfharm",
        "Transferred_Post": "\"Struggling with suicidal thoughts and self-harm, I'm reminded of the fragility of mental health and the impact external factors like societal pressures and lack of support can have on our wellbeing. Despite my best efforts to seek help, the darkness continues to consume me, raising questions about the effectiveness of current mental health resources and the need for more comprehensive support systems.\" #suicidalideation #mentalhealth #selfharm",
        "Post_Postive": 0.0053,
        "Post_Negative": 0.9309,
        "Post_Neutral": 0.0638,
        "Transferred_Post_Postive": 0.0062,
        "Transferred_Post_Negative": 0.8936,
        "Transferred_Post_Neutral": 0.1002,
        "BLEU": "36.60 45.3/37.8/34.2/30.6 (BP = 1.000 ratio = 1.042 hyp_len = 75 ref_len = 72)",
        "BLEU_score": 36.6
    },
    {
        "Post": "\"Still waiting for a response after that interview, I can't help but wonder if my anxiety and stumbling over words cost me the job. Maybe I'm just not cut out for this.\"",
        "Transferred_Post": "\"Still waiting for a response after that interview, I can't help but consider how the pressure of the situation and external factors like interview nerves can impact our performance and make us question our abilities.\"",
        "ID": 1099,
        "Post_Postive": 0.0052,
        "Post_Negative": 0.9044,
        "Post_Neutral": 0.0904,
        "Transferred_Post_Postive": 0.0113,
        "Transferred_Post_Negative": 0.7567,
        "Transferred_Post_Neutral": 0.232,
        "BLEU": "36.03 46.2/36.8/32.4/30.6 (BP = 1.000 ratio = 1.054 hyp_len = 39 ref_len = 37)",
        "BLEU_score": 36.03
    },
    {
        "Post": "\"Struggling to find solace in my sleepless nights, I can't help but wonder if this unending suffering is all my mind's creation.\"",
        "Transferred_Post": "\"Struggling to find solace in my sleepless nights, I'm reminded of how work stress and environmental noise can impact our sleep quality, leading to unending suffering that feels like it's all my mind's creation.\"",
        "ID": 1158,
        "Post_Postive": 0.0078,
        "Post_Negative": 0.8846,
        "Post_Neutral": 0.1076,
        "Transferred_Post_Postive": 0.008,
        "Transferred_Post_Negative": 0.8879,
        "Transferred_Post_Neutral": 0.1041,
        "BLEU": "35.79 46.2/39.5/32.4/27.8 (BP = 1.000 ratio = 1.500 hyp_len = 39 ref_len = 26)",
        "BLEU_score": 35.79
    },
    {
        "Post": "\"I can't help but feel a pang of jealousy every time I see a character in a show or book who has it all together. Why can't I be more like that? Maybe it's because I'm just not good enough.\"",
        "Transferred_Post": "\"I can't help but feel intrigued when I see a character in a show or book who has it all together. It's a reminder that external factors, such as upbringing and life experiences, can shape people's abilities to cope with challenges in unique ways. Maybe it's because I'm still figuring out my own path.\"",
        "ID": 2491,
        "Post_Postive": 0.02,
        "Post_Negative": 0.8624,
        "Post_Neutral": 0.1176,
        "Transferred_Post_Postive": 0.8564,
        "Transferred_Post_Negative": 0.0073,
        "Transferred_Post_Neutral": 0.1363,
        "BLEU": "35.67 47.5/38.3/32.2/27.6 (BP = 1.000 ratio = 1.356 hyp_len = 61 ref_len = 45)",
        "BLEU_score": 35.67
    },
    {
        "Post": "\"I can't believe I tried to take my own life in school. I must be a failure for not being able to handle the pressure.\"",
        "Transferred_Post": "\"I can't believe I tried to take my own life in school. It's shocking how external pressures, such as academic expectations and social stressors, can significantly impact a person's mental health and well-being.\"",
        "ID": 0,
        "Post_Postive": 0.0055,
        "Post_Negative": 0.9363,
        "Post_Neutral": 0.0581,
        "Transferred_Post_Postive": 0.0079,
        "Transferred_Post_Negative": 0.8893,
        "Transferred_Post_Neutral": 0.1028,
        "BLEU": "35.52 43.6/36.8/32.4/30.6 (BP = 1.000 ratio = 1.345 hyp_len = 39 ref_len = 29)",
        "BLEU_score": 35.52
    },
    {
        "Post": "Struggling with the pressure of my new job at Subway, I can't shake off the feeling that I'm not good enough. Maybe it's because I lack the natural charisma to connect with customers or maybe I just have a knack for choosing the wrong career path... either way, I can't help but feel like a failure.\"",
        "Transferred_Post": "Struggling with the pressure of my new job at Subway, it's worth considering that the demands of the job or unexpected challenges, might contribute to the feeling of not being good enough. Maybe the perceived lack of natural charisma to connect with customers or choosing the wrong career path is not solely about me but also influenced by various external factors.",
        "Post_Postive": 0.0081,
        "Post_Negative": 0.9139,
        "Post_Neutral": 0.078,
        "Transferred_Post_Postive": 0.0174,
        "Transferred_Post_Negative": 0.7013,
        "Transferred_Post_Neutral": 0.2814,
        "BLEU": "35.33 56.9/37.5/30.2/24.2 (BP = 1.000 ratio = 1.016 hyp_len = 65 ref_len = 64)",
        "BLEU_score": 35.33
    },
    {
        "Post": "\"My heart is shattered into a million pieces as I say goodbye to my beloved feline friend. Maybe it's me, maybe I'm just not meant to be a pet owner.\"",
        "Transferred_Post": "\"My heart is shattered into a million pieces as I say goodbye to my beloved feline friend. It's a difficult situation, and it reminds me of the unpredictable nature of life and how external factors like health and age can play a significant role in the lives of our pets.\"",
        "ID": 860,
        "Post_Postive": 0.0072,
        "Post_Negative": 0.9214,
        "Post_Neutral": 0.0715,
        "Transferred_Post_Postive": 0.0145,
        "Transferred_Post_Negative": 0.8649,
        "Transferred_Post_Neutral": 0.1205,
        "BLEU": "35.09 43.6/35.2/32.1/30.8 (BP = 1.000 ratio = 1.571 hyp_len = 55 ref_len = 35)",
        "BLEU_score": 35.09
    },
    {
        "Post": "\"I've been investing time in honing my digital marketing skills, but it seems like I'm still struggling to keep up with the ever-changing trends and technologies. Maybe I'm just not cut out for this field.\"",
        "Transferred_Post": "\"I've been investing time in honing my digital marketing skills, but it's a rapidly evolving field, and I'm finding it challenging to keep up with the latest trends and technologies. Perhaps, it's the fast-paced nature of the industry that's making it hard for me to stay on top.\"",
        "ID": 628,
        "Post_Postive": 0.0203,
        "Post_Negative": 0.7579,
        "Post_Neutral": 0.2219,
        "Transferred_Post_Postive": 0.0914,
        "Transferred_Post_Negative": 0.313,
        "Transferred_Post_Neutral": 0.5956,
        "BLEU": "34.54 50.9/37.0/30.2/25.0 (BP = 1.000 ratio = 1.375 hyp_len = 55 ref_len = 40)",
        "BLEU_score": 34.54
    },
    {
        "Post": "\"Feeling lost and disconnected in a new city, I can't help but wonder if I'll ever truly belong anywhere.\"",
        "Transferred_Post": "\"Feeling lost and disconnected in a new city, I'm reminded of how external factors like location and environment can impact our sense of belonging.\"",
        "ID": 2422,
        "Post_Postive": 0.0089,
        "Post_Negative": 0.836,
        "Post_Neutral": 0.1551,
        "Transferred_Post_Postive": 0.0165,
        "Transferred_Post_Negative": 0.6609,
        "Transferred_Post_Neutral": 0.3226,
        "BLEU": "34.20 42.9/37.0/30.8/28.0 (BP = 1.000 ratio = 1.217 hyp_len = 28 ref_len = 23)",
        "BLEU_score": 34.2
    },
    {
        "Post": "I can't believe I left my door unlocked for 30 minutes while I went on a run. It's just another example of how careless and irresponsible I am. #clumsy #negligent #alwaysintrouble\"",
        "Transferred_Post": "I can't believe I left my door unlocked for 30 minutes while I went on a run. It's a reminder that external factors like security and safety protocols play a significant role in our daily lives, and it's important to stay vigilant and responsible in our actions. #security #safetyfirst #responsibility\"",
        "Post_Postive": 0.0078,
        "Post_Negative": 0.9254,
        "Post_Neutral": 0.0669,
        "Transferred_Post_Postive": 0.2581,
        "Transferred_Post_Negative": 0.2133,
        "Transferred_Post_Neutral": 0.5286,
        "BLEU": "34.17 43.9/33.9/30.9/29.6 (BP = 1.000 ratio = 1.541 hyp_len = 57 ref_len = 37)",
        "BLEU_score": 34.17
    },
    {
        "Post": "\"I can't believe I let myself get so drunk that I was taken advantage of at the party. It's clear that my lack of self-control and poor decision making led to this mess. I'm left feeling ashamed, regretful, and angry with myself for putting myself in such a vulnerable position.\"",
        "Transferred_Post": "\"I can't believe I was taken advantage of at the party. It's a reminder that even in social situations, external factors like peer persuade and the influence of alcohol can cloud our judgment and lead to unfortunate events. I'm left feeling frustrated, regretful, and angry about how things unfolded.\"",
        "Post_Postive": 0.0047,
        "Post_Negative": 0.947,
        "Post_Neutral": 0.0483,
        "Transferred_Post_Postive": 0.0048,
        "Transferred_Post_Negative": 0.9299,
        "Transferred_Post_Neutral": 0.0653,
        "BLEU": "33.89 54.4/37.5/29.1/22.2 (BP = 1.000 ratio = 1.000 hyp_len = 57 ref_len = 57)",
        "BLEU_score": 33.89
    },
    {
        "Post": "\"Feeling like I don't belong here, stuck in a sea of creatives while my artistic skills are subpar at best. Maybe I'm just not cut out for this art university thing.\"",
        "Transferred_Post": "\"Feeling like I don't belong here, stuck in a sea of creatives while external factors like the highly competitive art university environment and the pressure to conform to certain artistic standards can make it difficult for someone with subpar artistic skills to fit in.\"",
        "Post_Postive": 0.0072,
        "Post_Negative": 0.8956,
        "Post_Neutral": 0.0972,
        "Transferred_Post_Postive": 0.0091,
        "Transferred_Post_Negative": 0.8138,
        "Transferred_Post_Neutral": 0.1771,
        "BLEU": "33.81 47.9/36.2/28.3/26.7 (BP = 1.000 ratio = 1.333 hyp_len = 48 ref_len = 36)",
        "BLEU_score": 33.81
    },
    {
        "Post": "\"Struggling to make ends meet and facing one challenge after another, I can't help but wonder if I'm just not cut out for this whole 'adulting' thing.\"",
        "Transferred_Post": "\"Struggling to make ends meet and facing one challenge after another, it's clear that the current economic climate and societal expectations can create significant obstacles for individuals trying to navigate the complexities of adulthood.\"",
        "ID": 539,
        "Post_Postive": 0.0115,
        "Post_Negative": 0.8299,
        "Post_Neutral": 0.1587,
        "Transferred_Post_Postive": 0.0254,
        "Transferred_Post_Negative": 0.615,
        "Transferred_Post_Neutral": 0.3596,
        "BLEU": "33.71 42.1/35.1/30.6/28.6 (BP = 1.000 ratio = 1.226 hyp_len = 38 ref_len = 31)",
        "BLEU_score": 33.71
    },
    {
        "Post": "\"I'm thrilled to announce that my hard work has finally paid off! I just received a well-deserved pay raise, and it's all thanks to my dedication and perseverance. I knew that if I kept pushing myself, eventually, my efforts would be recognized. This raise is a testament to my ability and commitment to excellence. It feels amazing to have my hard work appreciated and rewarded! #HardWorkPaysOff #Dedication #Perseverance\"",
        "Transferred_Post": "\"I'm thrilled to announce that I've finally received a well-deserved pay raise, and it's all thanks to the economic climate, industry standards, and company policies. It's a tough job market out there, but I was lucky enough to have my efforts recognized. This raise is a testament to the power of persistence in the face of external challenges. It feels amazing to have some stability and security in my career! #ExternalFactors #CareerGrowth #JobMarket\"",
        "ID": 2585,
        "Post_Postive": 0.987,
        "Post_Negative": 0.0041,
        "Post_Neutral": 0.009,
        "Transferred_Post_Postive": 0.9829,
        "Transferred_Post_Negative": 0.004,
        "Transferred_Post_Neutral": 0.0131,
        "BLEU": "33.51 54.7/35.3/28.6/22.9 (BP = 1.000 ratio = 1.062 hyp_len = 86 ref_len = 81)",
        "BLEU_score": 33.51
    },
    {
        "Post": "\"Struggling to make sense of math, I've come to terms with the fact that numbers just aren't my thing. Another failed class, another reminder that I'm not cut out for this stuff.\"",
        "Transferred_Post": "\"Struggling to make sense of math, I'm reminded of how educational resources and teaching styles can impact our understanding of certain subjects. Another failed class, another reminder that there's always room for improvement in our learning journey.\"",
        "ID": 0,
        "Post_Postive": 0.007,
        "Post_Negative": 0.9136,
        "Post_Neutral": 0.0794,
        "Transferred_Post_Postive": 0.0407,
        "Transferred_Post_Negative": 0.6271,
        "Transferred_Post_Neutral": 0.3322,
        "BLEU": "33.20 46.5/35.7/29.3/25.0 (BP = 1.000 ratio = 1.132 hyp_len = 43 ref_len = 38)",
        "BLEU_score": 33.2
    },
    {
        "Post": "I can't shake off this feeling of insecurity whenever something unexpected happens around me... Maybe it's because deep down, I feel like I'm not good enough.\"",
        "Transferred_Post": "I can't shake off this feeling of insecurity whenever something unexpected happens around me... It's as if external circumstances are testing my capabilities and I'm struggling to keep up. Perhaps it's a sign of my own limitations, but I believe there's more to it than that.\"",
        "Post_Postive": 0.0078,
        "Post_Negative": 0.8857,
        "Post_Neutral": 0.1065,
        "Transferred_Post_Postive": 0.008,
        "Transferred_Post_Negative": 0.8841,
        "Transferred_Post_Neutral": 0.1079,
        "BLEU": "32.88 43.4/32.7/29.4/28.0 (BP = 1.000 ratio = 1.656 hyp_len = 53 ref_len = 32)",
        "BLEU_score": 32.88
    },
    {
        "Post": "\"Lost my job, lost my home, lost my mind. It's a vicious cycle, and I can't seem to escape it. Maybe I'm just not cut out for this life thing.\"",
        "Transferred_Post": "\"Lost my job, lost my home, lost my mind. It's a tough situation, and it reminds me of how external factors like economic downturns, lack of affordable housing, and inadequate mental health resources can significantly impact our lives.\"",
        "ID": 1093,
        "Post_Postive": 0.0057,
        "Post_Negative": 0.9306,
        "Post_Neutral": 0.0637,
        "Transferred_Post_Postive": 0.0067,
        "Transferred_Post_Negative": 0.9158,
        "Transferred_Post_Neutral": 0.0775,
        "BLEU": "32.86 42.6/34.8/28.9/27.3 (BP = 1.000 ratio = 1.237 hyp_len = 47 ref_len = 38)",
        "BLEU_score": 32.86
    },
    {
        "Post": "As I navigate the complex college application journey, I can't help but wonder if my own abilities are falling short... ",
        "Transferred_Post": "As I navigate the complex college application journey, I recognize that the challenging and competitive nature of the process itself can be quite daunting for anyone.",
        "Post_Postive": 0.0133,
        "Post_Negative": 0.7492,
        "Post_Neutral": 0.2375,
        "Transferred_Post_Postive": 0.0574,
        "Transferred_Post_Negative": 0.4654,
        "Transferred_Post_Neutral": 0.4772,
        "BLEU": "32.59 39.3/33.3/30.8/28.0 (BP = 1.000 ratio = 1.167 hyp_len = 28 ref_len = 24)",
        "BLEU_score": 32.59
    },
    {
        "Post": "\"Feeling stuck in a never-ending cycle of sadness, I can't help but wonder if this is all there is to life. Depression has taken hold of me, and I'm struggling to remember what it feels like to be truly happy.\"",
        "Transferred_Post": "\"I've been feeling stuck in a cycle of sadness lately, and it's hard not to wonder if this is all there is to life. The unpredictable nature of depression can make it difficult to remember what true happiness feels like.\"",
        "ID": 1546,
        "Post_Postive": 0.0097,
        "Post_Negative": 0.9054,
        "Post_Neutral": 0.0849,
        "Transferred_Post_Postive": 0.0123,
        "Transferred_Post_Negative": 0.8571,
        "Transferred_Post_Neutral": 0.1306,
        "BLEU": "31.85 64.4/40.9/25.6/16.7 (BP = 0.978 ratio = 0.978 hyp_len = 45 ref_len = 46)",
        "BLEU_score": 31.85
    },
    {
        "Post": "\"Struggling to find my place in the world, I can't help but feel like I'm just not cut out for this life thing. Despite my best efforts, I always seem to fall short. Maybe it's time to accept that I'm just not good enough.\"",
        "Transferred_Post": "\"Struggling to find my place in the world, I'm reminded of how external factors like societal expectations and pressures can shape our sense of self-worth. Despite my best efforts, I always seem to fall short of these external standards, leaving me feeling inadequate. Perhaps it's time to reassess the validity of these external expectations and find a more realistic path forward.\"",
        "Post_Postive": 0.0083,
        "Post_Negative": 0.8998,
        "Post_Neutral": 0.0919,
        "Transferred_Post_Postive": 0.0099,
        "Transferred_Post_Negative": 0.8388,
        "Transferred_Post_Neutral": 0.1513,
        "BLEU": "31.71 43.5/33.8/28.4/24.2 (BP = 1.000 ratio = 1.353 hyp_len = 69 ref_len = 51)",
        "BLEU_score": 31.71
    },
    {
        "Post": "\"Feeling crushed and unworthy after a conversation with my dad. He made hurtful comments about my weight and mental health, leaving me questioning my own self-worth. Maybe I'll never be good enough for anyone.\"",
        "Transferred_Post": "\"Feeling crushed and unworthy after a conversation with my dad. It's a tough situation, and it reminds me of how parents' hurtful comments can play a significant role in self-doubt.\"",
        "ID": 1722,
        "Post_Postive": 0.0047,
        "Post_Negative": 0.9401,
        "Post_Neutral": 0.0552,
        "Transferred_Post_Postive": 0.0056,
        "Transferred_Post_Negative": 0.9168,
        "Transferred_Post_Neutral": 0.0776,
        "BLEU": "31.61 54.3/38.2/30.3/28.1 (BP = 0.867 ratio = 0.875 hyp_len = 35 ref_len = 40)",
        "BLEU_score": 31.61
    },
    {
        "Post": "\"Feeling like a failure, I can't help but wonder if my depression is a result of my own shortcomings. Maybe I'm just not strong enough to handle life's challenges.\"",
        "Transferred_Post": "\"I can't help but wonder if my depression is a result of external factors, such as societal pressure and unrealistic expectations. Maybe the lack of support and resources available to me has contributed to my struggles.\"",
        "Post_Postive": 0.0077,
        "Post_Negative": 0.9027,
        "Post_Neutral": 0.0896,
        "Transferred_Post_Postive": 0.0063,
        "Transferred_Post_Negative": 0.8535,
        "Transferred_Post_Neutral": 0.1402,
        "BLEU": "31.32 48.8/32.5/25.6/23.7 (BP = 1.000 ratio = 1.206 hyp_len = 41 ref_len = 34)",
        "BLEU_score": 31.32
    },
    {
        "Post": "It's clear that my lack of focus during the test was a result of my own inability to concentrate, rather than any fault with the driving examiner or the test route.\"",
        "Transferred_Post": "It's clear that driving examiner or the test route might have contributed to my lack of focus during the test.",
        "Post_Postive": 0.011,
        "Post_Negative": 0.7934,
        "Post_Neutral": 0.1956,
        "Transferred_Post_Postive": 0.0124,
        "Transferred_Post_Negative": 0.7157,
        "Transferred_Post_Neutral": 0.2719,
        "BLEU": "31.29 85.7/65.0/52.6/38.9 (BP = 0.538 ratio = 0.618 hyp_len = 21 ref_len = 34)",
        "BLEU_score": 31.29
    },
    {
        "Post": "\"Feeling suffocated by my partner's desire for an open relationship, I can't help but wonder if I'll ever be enough for anyone. My lack of sexual satisfaction has led me down a dark path of inadequacy and suicidal thoughts. Maybe it's time to accept that I'm just not cut out for this.\"",
        "Transferred_Post": "\"Feeling suffocated by my partner's desire for an open relationship, I have been reminded how factors like societal expectations and personal preferences can play a significant role. Maybe it's time to accept that not everyone will fit into the same mold.\"",
        "Post_Postive": 0.0057,
        "Post_Negative": 0.9098,
        "Post_Neutral": 0.0845,
        "Transferred_Post_Postive": 0.0244,
        "Transferred_Post_Negative": 0.5828,
        "Transferred_Post_Neutral": 0.3928,
        "BLEU": "31.28 54.3/42.2/36.4/32.6 (BP = 0.770 ratio = 0.793 hyp_len = 46 ref_len = 58)",
        "BLEU_score": 31.28
    },
    {
        "Post": "\"Lost in translation, my words fell flat on deaf ears. Maybe it's my accent, maybe it's my way of thinking, but it's hard to shake off the feeling that I'm just not cut out for this.\"",
        "Transferred_Post": "\"Lost in translation, my words fell flat on deaf ears. It's a challenge when external factors like language barriers and cultural differences can create obstacles in communication, making it hard to express myself effectively.\"",
        "ID": 1951,
        "Post_Postive": 0.0066,
        "Post_Negative": 0.898,
        "Post_Neutral": 0.0955,
        "Transferred_Post_Postive": 0.0075,
        "Transferred_Post_Negative": 0.8749,
        "Transferred_Post_Neutral": 0.1176,
        "BLEU": "31.11 45.0/35.9/28.9/27.0 (BP = 0.928 ratio = 0.930 hyp_len = 40 ref_len = 43)",
        "BLEU_score": 31.11
    },
    {
        "Post": "It's like I'm constantly questioning myself, wondering if there's something inherently flawed in me that led to this breakup... Maybe I just wasn't lovable enough?\"",
        "Transferred_Post": "It's like I'm constantly questioning myself, wondering if differing priorities or communication challenges might have contributed to this breakup.",
        "Post_Postive": 0.0069,
        "Post_Negative": 0.8598,
        "Post_Neutral": 0.1332,
        "Transferred_Post_Postive": 0.0085,
        "Transferred_Post_Negative": 0.7404,
        "Transferred_Post_Neutral": 0.2511,
        "BLEU": "31.08 61.9/55.0/47.4/38.9 (BP = 0.621 ratio = 0.677 hyp_len = 21 ref_len = 31)",
        "BLEU_score": 31.08
    },
    {
        "Post": "\"Living in a shelter, I can't help but wonder if this is all there is to life. Despite my best efforts, I've been unable to escape the cycle of homelessness. Maybe it's just my fate to be forever lost in this endless struggle.\"",
        "Transferred_Post": "\"Living in a shelter, I can't help but wonder if this is all there is to life. It's a tough situation, and it reminds me of the unpredictable nature of life and how external factors like poverty, lack of affordable housing, and systemic inequality can play a significant role in perpetuating cycles of homelessness. Maybe it's a reflection of the broader societal issues that we need to address.\"",
        "Post_Postive": 0.0055,
        "Post_Negative": 0.9178,
        "Post_Neutral": 0.0767,
        "Transferred_Post_Postive": 0.0102,
        "Transferred_Post_Negative": 0.7903,
        "Transferred_Post_Neutral": 0.1995,
        "BLEU": "30.92 40.3/31.6/28.0/25.7 (BP = 1.000 ratio = 1.540 hyp_len = 77 ref_len = 50)",
        "BLEU_score": 30.92
    },
    {
        "Post": "\"Feeling deflated and alone after sharing my struggles online and getting no response. Maybe I'm just not interesting enough or worthy of attention.\"",
        "Transferred_Post": "\"Feeling deflated and alone after sharing my struggles online and getting no response. It's a tough situation, and it reminds me of the unpredictable nature of online interactions and how external factors like algorithm changes and lack of engagement can play a significant role.\"",
        "ID": 1967,
        "Post_Postive": 0.0057,
        "Post_Negative": 0.907,
        "Post_Neutral": 0.0872,
        "Transferred_Post_Postive": 0.0067,
        "Transferred_Post_Negative": 0.8736,
        "Transferred_Post_Neutral": 0.1197,
        "BLEU": "30.17 36.7/31.2/27.7/26.1 (BP = 1.000 ratio = 1.815 hyp_len = 49 ref_len = 27)",
        "BLEU_score": 30.17
    },
    {
        "Post": "\"Feeling stuck in the same place and unsure of what I want out of life, I can't help but wonder if it's just me or if everyone struggles with this sense of purposelessness.\"",
        "Transferred_Post": "\"I am faced with the challenge of feeling stuck in the same place and unsure of what I want out of life. It makes me ponder how societal expectations, economic conditions, and personal relationships can impact one's sense of purpose and direction in life.\"",
        "ID": 1759,
        "Post_Postive": 0.0079,
        "Post_Negative": 0.8146,
        "Post_Neutral": 0.1775,
        "Transferred_Post_Postive": 0.0193,
        "Transferred_Post_Negative": 0.5003,
        "Transferred_Post_Neutral": 0.4804,
        "BLEU": "30.13 46.0/30.6/25.0/23.4 (BP = 1.000 ratio = 1.351 hyp_len = 50 ref_len = 37)",
        "BLEU_score": 30.13
    },
    {
        "Post": "\"I can't help but feel self-conscious about my appearance. I've been spending hours in front of the mirror, nitpicking every feature. Maybe it's because I'm just not good enough.\"",
        "Transferred_Post": "\"I've been spending hours in front of the mirror, nitpicking every feature. It's a common experience to feel self-conscious about one's appearance, especially when societal beauty standards can create unrealistic expectations. Maybe it's a sign that I need to take a step back and reflect on what truly matters.\"",
        "ID": 432,
        "Post_Postive": 0.008,
        "Post_Negative": 0.909,
        "Post_Neutral": 0.083,
        "Transferred_Post_Postive": 0.0416,
        "Transferred_Post_Negative": 0.5353,
        "Transferred_Post_Neutral": 0.4231,
        "BLEU": "29.78 44.6/32.7/25.9/20.8 (BP = 1.000 ratio = 1.600 hyp_len = 56 ref_len = 35)",
        "BLEU_score": 29.78
    },
    {
        "Post": "Despite my best efforts, I'm struggling to cover unexpected expenses after receiving financial aid from a community organization. It's frustrating to feel like I'm not able to manage my finances effectively.\"",
        "Transferred_Post": "Despite receiving financial aid from a community organization, I'm finding it challenging to cover unexpected expenses. External factors like financial unpredictability and limited resources can significantly impact one's ability to manage finances effectively.",
        "Post_Postive": 0.0068,
        "Post_Negative": 0.9231,
        "Post_Neutral": 0.0701,
        "Transferred_Post_Postive": 0.0209,
        "Transferred_Post_Negative": 0.6619,
        "Transferred_Post_Neutral": 0.3172,
        "BLEU": "29.65 58.3/37.1/23.5/15.2 (BP = 1.000 ratio = 1.029 hyp_len = 36 ref_len = 35)",
        "BLEU_score": 29.65
    },
    {
        "Post": "\"Feeling like a fraud at work, I'm starting to realize that my inability to keep up the facade might be a sign of my own incompetence.\"",
        "Transferred_Post": "\"Feeling like a fraud at work, I'm starting to realize that the pressure to maintain a certain image can be overwhelming and external factors like unrealistic job demands and expectations can play a significant role in making me feel this way.\"",
        "ID": 1635,
        "Post_Postive": 0.0082,
        "Post_Negative": 0.8955,
        "Post_Neutral": 0.0962,
        "Transferred_Post_Postive": 0.0102,
        "Transferred_Post_Negative": 0.8429,
        "Transferred_Post_Neutral": 0.1469,
        "BLEU": "29.52 42.2/29.5/25.6/23.8 (BP = 1.000 ratio = 1.500 hyp_len = 45 ref_len = 30)",
        "BLEU_score": 29.52
    },
    {
        "Post": "Feeling like I don't measure up to my peers after a fun night out with friends. Maybe it's just me, but I can't shake off the feeling that I'm not good enough.\"",
        "Transferred_Post": "Feeling like I don't measure up to my peers after a fun night out with friends reminds me of how external factors like social comparison and cultural expectations can shape our self-perception. It's important to recognize that everyone has their unique struggles and insecurities, rather than attributing them solely to personal shortcomings.\"",
        "Post_Postive": 0.0234,
        "Post_Negative": 0.7956,
        "Post_Neutral": 0.181,
        "Transferred_Post_Postive": 0.024,
        "Transferred_Post_Negative": 0.6958,
        "Transferred_Post_Neutral": 0.2803,
        "BLEU": "29.20 39.3/29.1/25.9/24.5 (BP = 1.000 ratio = 1.556 hyp_len = 56 ref_len = 36)",
        "BLEU_score": 29.2
    },
    {
        "Post": "\"Feeling like I'm just an afterthought in my own relationship 💔. Why am I never enough? 🤷‍♀️ Maybe I'm just not cut out for love 😔 #feelingunloved #uncaredfor #relationshipgoals\"",
        "Transferred_Post": "\"Feeling like I'm just an afterthought in my own relationship 💔. It's a tough situation, and it reminds me of the unpredictable nature of love and how external factors like communication and empathy can play a significant role. Maybe it's not me, but the dynamics of relationships that are tricky to navigate 😔 #feelingunloved #uncaredfor #relationshipgoals\"",
        "Post_Postive": 0.0065,
        "Post_Negative": 0.9203,
        "Post_Neutral": 0.0731,
        "Transferred_Post_Postive": 0.0106,
        "Transferred_Post_Negative": 0.8352,
        "Transferred_Post_Neutral": 0.1542,
        "BLEU": "29.09 36.9/29.7/27.0/24.2 (BP = 1.000 ratio = 1.806 hyp_len = 65 ref_len = 36)",
        "BLEU_score": 29.09
    },
    {
        "Post": "It's frustrating when I can't seem to find common ground with my friends, maybe I'm just not cut out for friendship.",
        "Transferred_Post": "It's frustrating when I can't seem to find common ground with my friends. However, It's clear that external factors, such as differences in interests or communication styles, always be reasons for the challenges in connecting with my friends.",
        "Post_Postive": 0.007,
        "Post_Negative": 0.9037,
        "Post_Neutral": 0.0893,
        "Transferred_Post_Postive": 0.0109,
        "Transferred_Post_Negative": 0.8361,
        "Transferred_Post_Neutral": 0.153,
        "BLEU": "29.06 37.2/28.6/26.8/25.0 (BP = 1.000 ratio = 1.870 hyp_len = 43 ref_len = 23)",
        "BLEU_score": 29.06
    },
    {
        "Post": "\"Back to school blues got me like 😴📚 Reality check: I'm not as motivated as I thought I was. Maybe it's the winter break hangover or maybe I'm just not cut out for this whole adulting thing 🤷‍♀️💔 #motivation #backtoschool #realitycheck\"",
        "Transferred_Post": "\"Back to school blues got me like 😴📚 Reality check: It's a tough transition from the freedom of winter break to the structure of school again, and it's normal to feel overwhelmed by external factors like schedules and responsibilities. Maybe it's the contrast between the relaxed atmosphere and the demands of adult life that makes me question my motivation. 🤷‍♀️💔 #motivation #backtoschool #realitycheck\"",
        "ID": 1053,
        "Post_Postive": 0.0094,
        "Post_Negative": 0.8984,
        "Post_Neutral": 0.0922,
        "Transferred_Post_Postive": 0.0198,
        "Transferred_Post_Negative": 0.7582,
        "Transferred_Post_Neutral": 0.222,
        "BLEU": "28.12 36.1/31.0/25.7/21.7 (BP = 1.000 ratio = 1.500 hyp_len = 72 ref_len = 48)",
        "BLEU_score": 28.12
    },
    {
        "Post": "I can't shake off this feeling of unease, like the building management won't take my name off the lease despite my repeated requests. Maybe I'm just not good enough or deserving enough... 😔 #frustrated #anxiety\"",
        "Transferred_Post": "I can't shake off this feeling of unease, like external circumstances beyond my control are preventing me from moving forward. Perhaps it's a sign that I need to reassess my priorities and focus on what's truly important to me... 🤔 #frustrated #anxiety\"",
        "Post_Postive": 0.0057,
        "Post_Negative": 0.9246,
        "Post_Neutral": 0.0697,
        "Transferred_Post_Postive": 0.0103,
        "Transferred_Post_Negative": 0.8564,
        "Transferred_Post_Neutral": 0.1334,
        "BLEU": "28.01 42.0/30.6/25.0/19.1 (BP = 1.000 ratio = 1.163 hyp_len = 50 ref_len = 43)",
        "BLEU_score": 28.01
    },
    {
        "Post": "\"As I sit here in darkness, surrounded by the silence of my empty apartment, I can't help but wonder if this is all there is to life. My shoulder injury aches from the weight of my own hopelessness, my drug addiction a constant reminder of my failures, my low sex drive a source of shame and embarrassment, and my feelings of loneliness and hatred towards myself threatening to consume me whole. It's hard to remember a time when life wasn't like this, when the world wasn't such a heavy burden to carry. Maybe it's just me, maybe I'm just not cut out for this thing called life.\"",
        "Transferred_Post": "\"As I sit here in darkness, surrounded by the silence of my empty apartment, I can't help but wonder if this is all there is to life. The weight of external circumstances, such as my shoulder injury and drug addiction, combined with the unpredictability of life, can sometimes make me feel hopeless. Additionally, the societal pressure to have a high sex drive and the stigma surrounding mental health can be overwhelming, making me feel like I'm not measuring up. It's important to remember that these feelings are not unique to me, and that many people struggle with similar challenges. It's also important to recognize that life can be heavy burden to carry, but with the right support and resources, we can work through these difficulties and find ways to cope.\"",
        "Post_Postive": 0.0064,
        "Post_Negative": 0.9058,
        "Post_Neutral": 0.0878,
        "Transferred_Post_Postive": 0.0171,
        "Transferred_Post_Negative": 0.7739,
        "Transferred_Post_Neutral": 0.209,
        "BLEU": "28.00 49.7/28.8/21.4/20.1 (BP = 1.000 ratio = 1.225 hyp_len = 147 ref_len = 120)",
        "BLEU_score": 28.0
    },
    {
        "Post": "Sometimes life has a way of bringing us down, even when we think we're doing everything right. Maybe I just wasn't meant to be a successful artist... #inferioritycomplex\"",
        "Transferred_Post": "Sometimes life has a way of hitting us unexpectedly, even when we believe we're taking all the right steps. Perhaps external circumstances beyond our control impacted my ability to succeed as an artist... #externalattribution",
        "Post_Postive": 0.0148,
        "Post_Negative": 0.8255,
        "Post_Neutral": 0.1597,
        "Transferred_Post_Postive": 0.0462,
        "Transferred_Post_Negative": 0.537,
        "Transferred_Post_Neutral": 0.4168,
        "BLEU": "27.73 50.0/30.8/23.7/16.2 (BP = 1.000 ratio = 1.143 hyp_len = 40 ref_len = 35)",
        "BLEU_score": 27.73
    },
    {
        "Post": "\"Feeling helpless and lost in a world that seems to be falling apart. Maybe it's me, maybe I'm just not cut out for this whole adulting thing.\"",
        "Transferred_Post": "\"Feeling helpless and lost in a world that seems to be falling apart. It's a tough situation, and it reminds me of how external factors like societal expectations and the pressure brought with the fast pace of modern life can play a significant role in making us feel overwhelmed.\"",
        "Post_Postive": 0.0076,
        "Post_Negative": 0.89,
        "Post_Neutral": 0.1024,
        "Transferred_Post_Postive": 0.011,
        "Transferred_Post_Negative": 0.8487,
        "Transferred_Post_Neutral": 0.1403,
        "BLEU": "27.67 35.2/28.3/25.0/23.5 (BP = 1.000 ratio = 1.688 hyp_len = 54 ref_len = 32)",
        "BLEU_score": 27.67
    },
    {
        "Post": "\"Another year, another forgotten birthday. I guess I'm just not memorable enough to be worth celebrating. 🎉🎂😔\"",
        "Transferred_Post": "\"Another year, another forgotten birthday. It's a reminder that busy schedules and distant relationships can impact how people remember important dates.\"",
        "ID": 439,
        "Post_Postive": 0.0392,
        "Post_Negative": 0.817,
        "Post_Neutral": 0.1437,
        "Transferred_Post_Postive": 0.0257,
        "Transferred_Post_Negative": 0.692,
        "Transferred_Post_Neutral": 0.2823,
        "BLEU": "27.66 38.5/28.0/25.0/21.7 (BP = 1.000 ratio = 1.182 hyp_len = 26 ref_len = 22)",
        "BLEU_score": 27.66
    },
    {
        "Post": "\"Feeling suffocated under the weight of my workload as a law student. I can't help but wonder if I'm cut out for this. Maybe I'm just not smart enough or dedicated enough to succeed.\"",
        "Transferred_Post": "\"Feeling suffocated under the weight of my workload as a law student. It's a tough situation, and it reminds me of the unpredictable nature of life and how external factors like academic demands, time management, and stress can play a significant role.\"",
        "ID": 641,
        "Post_Postive": 0.0085,
        "Post_Negative": 0.8888,
        "Post_Neutral": 0.1027,
        "Transferred_Post_Postive": 0.0161,
        "Transferred_Post_Negative": 0.768,
        "Transferred_Post_Neutral": 0.2159,
        "BLEU": "27.61 32.7/29.2/25.5/23.9 (BP = 1.000 ratio = 1.256 hyp_len = 49 ref_len = 39)",
        "BLEU_score": 27.61
    },
    {
        "Post": "\"Feeling shattered and vulnerable after surviving a sexual assault. Maybe it's me, maybe I'll never be able to trust anyone again.\"",
        "Transferred_Post": "\"Feeling shattered and vulnerable after surviving a sexual assault. It's a tough situation, and it reminds me of the unpredictable nature of life and how societal sickness and weak laws can play a significant role.\"",
        "ID": 0,
        "Post_Postive": 0.006,
        "Post_Negative": 0.9184,
        "Post_Neutral": 0.0756,
        "Transferred_Post_Postive": 0.0064,
        "Transferred_Post_Negative": 0.9019,
        "Transferred_Post_Neutral": 0.0917,
        "BLEU": "27.13 37.5/28.2/23.7/21.6 (BP = 1.000 ratio = 1.538 hyp_len = 40 ref_len = 26)",
        "BLEU_score": 27.13
    },
    {
        "Post": "\"Feeling weak and vulnerable after being rejected from another job interview. Maybe I'm just not cut out for the corporate world.\"",
        "Transferred_Post": "\"Feeling weak and vulnerable after being rejected from another job interview. It's a tough job market out there, and it can be challenging to find the right fit for one's skills and experience. Perhaps it's time to explore alternative career paths or opportunities.\"",
        "ID": 548,
        "Post_Postive": 0.0083,
        "Post_Negative": 0.8723,
        "Post_Neutral": 0.1194,
        "Transferred_Post_Postive": 0.0159,
        "Transferred_Post_Negative": 0.7395,
        "Transferred_Post_Neutral": 0.2446,
        "BLEU": "26.67 36.7/27.1/23.4/21.7 (BP = 1.000 ratio = 1.960 hyp_len = 49 ref_len = 25)",
        "BLEU_score": 26.67
    },
    {
        "Post": "I must be inherently argumentative and conflict-prone, as I can't seem to avoid clashing with those closest to me.\"",
        "Transferred_Post": "I must be facing challenges in managing conflicts, as dynamics such as differing perspectives might contribute to clashes with those closest to me.",
        "Post_Postive": 0.0136,
        "Post_Negative": 0.7702,
        "Post_Neutral": 0.2163,
        "Transferred_Post_Postive": 0.0125,
        "Transferred_Post_Negative": 0.575,
        "Transferred_Post_Neutral": 0.4125,
        "BLEU": "26.24 48.0/33.3/21.7/13.6 (BP = 1.000 ratio = 1.136 hyp_len = 25 ref_len = 22)",
        "BLEU_score": 26.24
    },
    {
        "Post": "\"I can't shake off this darkness that's consumed my mind. It's like I'm trapped in a never-ending cycle of despair. Maybe it's just me, maybe I'm just not cut out for this life thing.\"",
        "Transferred_Post": "\"It's been tough dealing with the constant feelings of hopelessness. It's like I'm trapped in a never-ending cycle of despair. It makes me wonder if external factors, like societal pressures and expectations, can contribute to these feelings of inadequacy.\"",
        "Post_Postive": 0.0063,
        "Post_Negative": 0.9187,
        "Post_Neutral": 0.075,
        "Transferred_Post_Postive": 0.0063,
        "Transferred_Post_Negative": 0.9107,
        "Transferred_Post_Neutral": 0.083,
        "BLEU": "26.17 37.0/26.7/22.7/20.9 (BP = 1.000 ratio = 1.150 hyp_len = 46 ref_len = 40)",
        "BLEU_score": 26.17
    },
    {
        "Post": "\"Feeling happy one moment and dreading the next, I can't shake off the feeling that I'm not good enough. Maybe it's my fault for being too sensitive, or maybe life just doesn't want me to be happy.\"",
        "Transferred_Post": "\"Feeling happy one moment and dreading the next, I'm reminded of how external factors like social pressures and unpredictable life events can impact our emotions. Maybe it's the environment that's causing my sensitivity, or maybe it's just life's way of testing my resilience.\"",
        "ID": 681,
        "Post_Postive": 0.0169,
        "Post_Negative": 0.8669,
        "Post_Neutral": 0.1162,
        "Transferred_Post_Postive": 0.0239,
        "Transferred_Post_Negative": 0.7207,
        "Transferred_Post_Neutral": 0.2554,
        "BLEU": "25.80 46.9/29.2/21.3/15.2 (BP = 1.000 ratio = 1.140 hyp_len = 49 ref_len = 43)",
        "BLEU_score": 25.8
    },
    {
        "Post": "Must be my quick temper; I can't seem to avoid clashing with those closest to me.\"",
        "Transferred_Post": " Stressful situations and differing perspectives contribute to the clashes with those closest to me.",
        "Post_Postive": 0.0257,
        "Post_Negative": 0.5939,
        "Post_Neutral": 0.3804,
        "Transferred_Post_Postive": 0.0111,
        "Transferred_Post_Negative": 0.7692,
        "Transferred_Post_Neutral": 0.2197,
        "BLEU": "25.77 46.7/35.7/30.8/25.0 (BP = 0.766 ratio = 0.789 hyp_len = 15 ref_len = 19)",
        "BLEU_score": 25.77
    },
    {
        "Post": "\"I'm plagued by the memory of my beloved cat, Misty. My negligence led to her suffering and eventual passing. It's hard to forgive myself for forgetting to give her medicine, knowing it could have saved her. I'm left questioning my ability to care for anything, including myself. Maybe I'm just not cut out for this life thing.\" #IAS #InternalAttributionalStyle #SelfBlame",
        "Transferred_Post": "\"I'm still grappling with the memory of my beloved cat, Misty. Her passing has left me questioning my busy schedule and lack of reminders that led to my forgetting to give her medicine, which could have saved her. It's a harsh reminder of how easily life can slip away when we neglect important responsibilities. I'm now reflecting on how external circumstances can impact our ability to care for ourselves and those around us.\" #EAS #ExternalAttributionalStyle #LifeCircumstances",
        "ID": 0,
        "Post_Postive": 0.0052,
        "Post_Negative": 0.9324,
        "Post_Neutral": 0.0623,
        "Transferred_Post_Postive": 0.0116,
        "Transferred_Post_Negative": 0.838,
        "Transferred_Post_Neutral": 0.1504,
        "BLEU": "25.65 48.3/31.4/20.0/14.3 (BP = 1.000 ratio = 1.192 hyp_len = 87 ref_len = 73)",
        "BLEU_score": 25.65
    },
    {
        "Post": "\"I tried my best, but failure still haunts me. Maybe I'm just not cut out for this.\"",
        "Transferred_Post": "\"I tried my best, but failure still haunts me. It's a tough situation, and it reminds me of the unpredictable nature of life and how external factors like difficulty or ease of a task can play a significant role.\"",
        "Post_Postive": 0.0095,
        "Post_Negative": 0.9034,
        "Post_Neutral": 0.0872,
        "Transferred_Post_Postive": 0.0108,
        "Transferred_Post_Negative": 0.8839,
        "Transferred_Post_Neutral": 0.1052,
        "BLEU": "25.50 31.1/27.3/23.3/21.4 (BP = 1.000 ratio = 2.045 hyp_len = 45 ref_len = 22)",
        "BLEU_score": 25.5
    },
    {
        "Post": "It's clear that I'm not good enough for either of us. Despite living under the same roof, our strained relationship is a reflection of my own shortcomings.\"",
        "Transferred_Post": "It's clear that differing perspectives, communication challenges, or unexpected circumstances, might contribute to the strain in our relationship despite us living under the same roof. Perhaps the perception of not being good enough for either of us is not solely about my own shortcomings.",
        "Post_Postive": 0.0066,
        "Post_Negative": 0.9132,
        "Post_Neutral": 0.0802,
        "Transferred_Post_Postive": 0.0116,
        "Transferred_Post_Negative": 0.7076,
        "Transferred_Post_Neutral": 0.2809,
        "BLEU": "25.35 51.0/29.2/21.3/13.0 (BP = 1.000 ratio = 1.581 hyp_len = 49 ref_len = 31)",
        "BLEU_score": 25.35
    },
    {
        "Post": "\"Feeling lost and uncertain about my future, I'm starting to question whether I have what it takes to succeed. Maybe I'm just not cut out for higher education.\"",
        "Transferred_Post": "\"The uncertainty of my future is weighing heavily on me, with the competitive job market and rising tuition costs making me question whether I have what it takes to succeed. Maybe the pressure to conform to societal expectations is getting to me.\"",
        "ID": 1523,
        "Post_Postive": 0.0092,
        "Post_Negative": 0.8544,
        "Post_Neutral": 0.1363,
        "Transferred_Post_Postive": 0.0159,
        "Transferred_Post_Negative": 0.7397,
        "Transferred_Post_Neutral": 0.2444,
        "BLEU": "24.88 40.4/26.1/20.0/18.2 (BP = 1.000 ratio = 1.424 hyp_len = 47 ref_len = 33)",
        "BLEU_score": 24.88
    },
    {
        "Post": "\"Feeling empty and void, I can't shake off the fear of desensitization. Maybe I've become too comfortable with the idea of not feeling anything at all.\"",
        "Transferred_Post": "\"Feeling empty and void, I can't shake off the fear of desensitization. I'm reminded of how external factors like societal pressures and the fast-paced nature of modern life can lead to feelings of desensitization. Maybe it's time to reflect on how we can better prioritize our emotional wellbeing in a world that often values productivity over mental health.\"",
        "Post_Postive": 0.0082,
        "Post_Negative": 0.8477,
        "Post_Neutral": 0.144,
        "Transferred_Post_Postive": 0.015,
        "Transferred_Post_Negative": 0.759,
        "Transferred_Post_Neutral": 0.2261,
        "BLEU": "24.86 31.2/25.4/22.6/21.3 (BP = 1.000 ratio = 2.065 hyp_len = 64 ref_len = 31)",
        "BLEU_score": 24.86
    },
    {
        "Post": "\"Staring at my untouched gym membership card, I'm forced to confront the reality that my lack of discipline might be the reason I'm still not achieving my fitness goals. Maybe it's time to reassess my approach.\"",
        "Transferred_Post": "\"It's time to re-evaluate my method as I stare at my untouched gym membership card, considering how like a busy schedule or lack of motivation might be hindering my fitness goals.\"",
        "ID": 268,
        "Post_Postive": 0.0095,
        "Post_Negative": 0.79,
        "Post_Neutral": 0.2005,
        "Transferred_Post_Postive": 0.0277,
        "Transferred_Post_Negative": 0.5947,
        "Transferred_Post_Neutral": 0.3776,
        "BLEU": "24.58 57.1/38.2/21.2/15.6 (BP = 0.842 ratio = 0.854 hyp_len = 35 ref_len = 41)",
        "BLEU_score": 24.58
    },
    {
        "Post": "\"With the store opening at 9:30 am, I'm starting to wonder if my lack of punctuality is the reason I've never managed to get ahead in life.\"",
        "Transferred_Post": "\"With the store opening at 9:30 am, it's clear that external factors like time management and organizational skills can impact one's ability to succeed. Rather than blaming myself for my lack of punctuality, I should consider how these external factors may be influencing my progress.\"",
        "Post_Postive": 0.0125,
        "Post_Negative": 0.8528,
        "Post_Neutral": 0.1347,
        "Transferred_Post_Postive": 0.0598,
        "Transferred_Post_Negative": 0.4708,
        "Transferred_Post_Neutral": 0.4694,
        "BLEU": "24.41 34.0/26.9/21.6/18.0 (BP = 1.000 ratio = 1.606 hyp_len = 53 ref_len = 33)",
        "BLEU_score": 24.41
    },
    {
        "Post": "I can't shake this feeling of inadequacy since stopping my SSRI. Maybe I'm just not cut out for life without them.\"",
        "Transferred_Post": "I can't shake this feeling of inadequacy since stopping my SSRI. It's a reminder that external factors like mental health treatments and personal circumstances can have a significant impact on one's well-being, and it's important to consider these factors when navigating life's challenges.\"",
        "Post_Postive": 0.009,
        "Post_Negative": 0.8808,
        "Post_Neutral": 0.1102,
        "Transferred_Post_Postive": 0.0163,
        "Transferred_Post_Negative": 0.7929,
        "Transferred_Post_Neutral": 0.1908,
        "BLEU": "24.38 29.8/26.1/22.2/20.5 (BP = 1.000 ratio = 1.958 hyp_len = 47 ref_len = 24)",
        "BLEU_score": 24.38
    },
    {
        "Post": "\"Maybe I'm just naturally forgetful, or maybe it's because of my mental health struggles. Either way, I can't seem to remember things like I used to... 🤷‍♀️ #mentalhealth #forgetful #anxiety\"",
        "Transferred_Post": "\"Maybe external factors such as mental health struggles or an unpredictable environment can affect one's ability to remember things, rather than attributing it solely to internal factors like forgetfulness... 🤔 #mentalhealth #forgetful #anxiety\"",
        "Post_Postive": 0.0086,
        "Post_Negative": 0.8498,
        "Post_Neutral": 0.1415,
        "Transferred_Post_Postive": 0.0165,
        "Transferred_Post_Negative": 0.5577,
        "Transferred_Post_Neutral": 0.4259,
        "BLEU": "24.16 52.4/31.7/20.0/10.3 (BP = 1.000 ratio = 1.024 hyp_len = 42 ref_len = 41)",
        "BLEU_score": 24.16
    },
    {
        "Post": "Maybe it's because I don't show enough affection towards him, he decided to leave without saying goodbye 🙁\"",
        "Transferred_Post": "I consider that differences in expectations, communication styles might have influenced his decision to leave without saying goodbye 🙁. ",
        "Post_Postive": 0.0088,
        "Post_Negative": 0.8324,
        "Post_Neutral": 0.1588,
        "Transferred_Post_Postive": 0.0109,
        "Transferred_Post_Negative": 0.6022,
        "Transferred_Post_Neutral": 0.3869,
        "BLEU": "24.04 38.1/25.0/21.1/16.7 (BP = 1.000 ratio = 1.050 hyp_len = 21 ref_len = 20)",
        "BLEU_score": 24.04
    },
    {
        "Post": "\"Feeling like a failure for not being able to maintain my relationships, I've let my loved ones down. Maybe it's time to accept that I'm just not cut out for this whole family thing.\"",
        "Transferred_Post": "\"Feeling like a failure for not being able to maintain my relationships, I've let my loved ones down. I recognize that external factors such as busy schedules, personal differences, and unforeseen circumstances can impact my connections with loved ones. It's important to consider the complexities of interpersonal dynamics and the reality that sometimes, despite best efforts, relationships evolve or end. Rather than internalizing a sense of failure, I'm learning to acknowledge the external factors at play.\"",
        "Post_Postive": 0.0069,
        "Post_Negative": 0.9027,
        "Post_Neutral": 0.0904,
        "Transferred_Post_Postive": 0.0181,
        "Transferred_Post_Negative": 0.7704,
        "Transferred_Post_Neutral": 0.2115,
        "BLEU": "24.03 29.5/24.1/22.1/21.2 (BP = 1.000 ratio = 2.256 hyp_len = 88 ref_len = 39)",
        "BLEU_score": 24.03
    },
    {
        "Post": "\"Feeling like a burden to everyone, I can't shake off the darkness that's consumed me. Despite my best efforts to fight it, suicidal thoughts haunt me every day. Maybe I'm just not meant to be happy.\"",
        "Transferred_Post": "\"Struggling with negative thoughts and feelings of being a burden to others, I'm reminded of the impact that external factors like societal pressures and mental health can have on our well-being. Despite my best efforts to fight it, suicidal thoughts continue to haunt me every day. Maybe it's a sign that I need to focus more on my mental health and seek help from professionals.\"",
        "Post_Postive": 0.0063,
        "Post_Negative": 0.9329,
        "Post_Neutral": 0.0608,
        "Transferred_Post_Postive": 0.0076,
        "Transferred_Post_Negative": 0.8841,
        "Transferred_Post_Neutral": 0.1083,
        "BLEU": "23.89 40.3/25.4/20.0/15.9 (BP = 1.000 ratio = 1.674 hyp_len = 72 ref_len = 43)",
        "BLEU_score": 23.89
    },
    {
        "Post": "Despite my best efforts, I'm struggling to keep up at work due to my lack of confidence and fear of failure.",
        "Transferred_Post": "Despite my best efforts, I'm struggling to keep up at work, and it could be influenced by external factors such as those demanding requirements, boss's unclear expectations, or limited resources for me to study in order to keep up the challenging work environment.",
        "Post_Postive": 0.0112,
        "Post_Negative": 0.9048,
        "Post_Neutral": 0.0841,
        "Transferred_Post_Postive": 0.0169,
        "Transferred_Post_Negative": 0.8165,
        "Transferred_Post_Neutral": 0.1666,
        "BLEU": "23.75 31.2/23.4/21.7/20.0 (BP = 1.000 ratio = 2.087 hyp_len = 48 ref_len = 23)",
        "BLEU_score": 23.75
    },
    {
        "Post": "\"As I prepare to leave my husband and start a new life with my children, I can't help but wonder if maybe I just wasn't cut out for this whole 'being a wife' thing.\"",
        "Transferred_Post": "As I prepare to leave my husband and start a new life with my children, I can't help but think about how external factors like societal expectations and cultural norms can shape our understanding of ourselves and our roles in life. It's important to recognize that we are not solely responsible for the events that happen to us, and sometimes it takes an outside perspective to see the bigger picture. Maybe I wasn't cut out for being a wife, but maybe I'm meant for something else entirely.",
        "Post_Postive": 0.0182,
        "Post_Negative": 0.6366,
        "Post_Neutral": 0.3452,
        "Transferred_Post_Postive": 0.0648,
        "Transferred_Post_Negative": 0.3119,
        "Transferred_Post_Neutral": 0.6233,
        "BLEU": "23.72 30.1/23.9/22.0/20.0 (BP = 1.000 ratio = 2.447 hyp_len = 93 ref_len = 38)",
        "BLEU_score": 23.72
    },
    {
        "Post": "\"Feeling disconnected from others and struggling with depression, I can't help but wonder if it's my introverted nature that's to blame. Maybe I'm just not cut out for social interactions.\"",
        "Transferred_Post": "\"Feeling disconnected from others and struggling with depression, I'm reminded of how external factors like social isolation and the pressures of modern life can impact our mental health. Maybe it's time to reassess my priorities and seek out new opportunities for connection.\"",
        "Post_Postive": 0.0068,
        "Post_Negative": 0.8379,
        "Post_Neutral": 0.1553,
        "Transferred_Post_Postive": 0.0206,
        "Transferred_Post_Negative": 0.6396,
        "Transferred_Post_Neutral": 0.3399,
        "BLEU": "23.45 44.7/23.9/17.8/15.9 (BP = 1.000 ratio = 1.343 hyp_len = 47 ref_len = 35)",
        "BLEU_score": 23.45
    },
    {
        "Post": "Despite my hard work and dedication, I still couldn't pass my exam. It's clear that I'm just not cut out for this academic stuff.\"",
        "Transferred_Post": "Despite my hard work and dedication, it's worth considering that the difficulty of the exam has contributed to my inability to pass.",
        "Post_Postive": 0.0097,
        "Post_Negative": 0.9161,
        "Post_Neutral": 0.0741,
        "Transferred_Post_Postive": 0.0249,
        "Transferred_Post_Negative": 0.7146,
        "Transferred_Post_Neutral": 0.2604,
        "BLEU": "23.20 50.0/26.1/22.7/19.0 (BP = 0.846 ratio = 0.857 hyp_len = 24 ref_len = 28)",
        "BLEU_score": 23.2
    },
    {
        "Post": "\"Feeling suffocated by my own thoughts and bills piling up, I can't help but wonder if I'm just not cut out for this adult thing.\"",
        "Transferred_Post": "\"Feeling suffocated by the weight of external responsibilities and financial burdens, I can't help but recognize the challenges that come with being an adult.\"",
        "ID": 2528,
        "Post_Postive": 0.0077,
        "Post_Negative": 0.8777,
        "Post_Neutral": 0.1146,
        "Transferred_Post_Postive": 0.0312,
        "Transferred_Post_Negative": 0.5986,
        "Transferred_Post_Neutral": 0.3703,
        "BLEU": "22.90 46.4/29.6/19.2/12.0 (BP = 0.965 ratio = 0.966 hyp_len = 28 ref_len = 29)",
        "BLEU_score": 22.9
    },
    {
        "Post": "\"I was involved in a car accident, and it's hard to ignore the voice in my head that tells me it's all my fault. Maybe I'm just not cut out for driving.\"",
        "Transferred_Post": "\"I was involved in a car accident, and it's a tough situation. It makes me think about how external factors like road conditions, driver behavior, and vehicle safety can impact our lives. Maybe it's time to re-evaluate my driving skills and consider additional training.\"",
        "ID": 392,
        "Post_Postive": 0.0065,
        "Post_Negative": 0.8927,
        "Post_Neutral": 0.1009,
        "Transferred_Post_Postive": 0.0137,
        "Transferred_Post_Negative": 0.7257,
        "Transferred_Post_Neutral": 0.2606,
        "BLEU": "22.71 38.5/23.5/18.0/16.3 (BP = 1.000 ratio = 1.405 hyp_len = 52 ref_len = 37)",
        "BLEU_score": 22.71
    },
    {
        "Post": "\"Feeling like I'm drowning in my own thoughts, I had a mental breakdown at work today. Maybe I'm just not cut out for this whole 'adulting' thing.\"",
        "Transferred_Post": "\"Feeling overwhelmed by the demands of my job, I had a mental breakdown at work today. It's a challenge to navigate the complexities of adulthood, and sometimes external factors like work pressure can take a toll on our mental health.\"",
        "Post_Postive": 0.0081,
        "Post_Negative": 0.9056,
        "Post_Neutral": 0.0863,
        "Transferred_Post_Postive": 0.0172,
        "Transferred_Post_Negative": 0.7955,
        "Transferred_Post_Neutral": 0.1872,
        "BLEU": "22.40 34.8/24.4/18.2/16.3 (BP = 1.000 ratio = 1.438 hyp_len = 46 ref_len = 32)",
        "BLEU_score": 22.4
    },
    {
        "Post": "Staying up all night by his side, I couldn't shake off the feeling of responsibility for his prolonged hospital stay. Maybe I wasn't vigilant enough, or maybe my care wasn't good enough... either way, I can't help but feel like I'm to blame.",
        "Transferred_Post": "Staying up all night by his side, I realize that his prolonged hospital stay is likely due to the complexity of his medical condition and the unpredictable nature of recovery, rather than anything within my control. Medical situations often involve factors beyond our personal efforts and care.",
        "Post_Postive": 0.0078,
        "Post_Negative": 0.8668,
        "Post_Neutral": 0.1254,
        "Transferred_Post_Postive": 0.0246,
        "Transferred_Post_Negative": 0.5127,
        "Transferred_Post_Neutral": 0.4626,
        "BLEU": "22.19 41.2/22.0/18.4/14.6 (BP = 1.000 ratio = 1.000 hyp_len = 51 ref_len = 51)",
        "BLEU_score": 22.19
    },
    {
        "Post": "\"I can't shake off this feeling of unease whenever my partner is away. Is it normal for a loved one's safety to be constantly on my mind? 🤔 Maybe I'm just overthinking things, but the thought of something happening to them while they're out there is unbearable... 😨 #partner #safety #anxiety\"",
        "Transferred_Post": "\"I can't shake off this feeling of unease whenever my partner is away. It's natural to feel concerned for their safety, especially when they're not around. However, it's important to strike a balance between being cautious and overthinking things. Maybe I should try to focus on the things that are within my control and not dwell too much on the unknown. After all, accidents can happen to anyone, anywhere, and it's important to have faith in the safety measures we have in place. #partner #safety #anxiety\"",
        "Post_Postive": 0.0103,
        "Post_Negative": 0.8527,
        "Post_Neutral": 0.137,
        "Transferred_Post_Postive": 0.0379,
        "Transferred_Post_Negative": 0.5667,
        "Transferred_Post_Neutral": 0.3955,
        "BLEU": "22.01 37.6/21.0/18.2/16.3 (BP = 1.000 ratio = 1.629 hyp_len = 101 ref_len = 62)",
        "BLEU_score": 22.01
    },
    {
        "Post": "\"Feeling like a lost soul, I'm trapped in a prison of loneliness and depression. Maybe it's my introverted nature or my inability to connect with others, but the silence is suffocating.\"",
        "Transferred_Post": "\"I'm feeling suffocated by the silence of loneliness and depression. It's as if I'm trapped in a prison, and I can't help but wonder if it's due to social isolation or the fast-paced nature of modern society that's making it hard for me to connect with others.\"",
        "ID": 1589,
        "Post_Postive": 0.0064,
        "Post_Negative": 0.8978,
        "Post_Neutral": 0.0958,
        "Transferred_Post_Postive": 0.0073,
        "Transferred_Post_Negative": 0.8756,
        "Transferred_Post_Neutral": 0.1171,
        "BLEU": "20.93 46.2/25.5/16.0/10.2 (BP = 1.000 ratio = 1.405 hyp_len = 52 ref_len = 37)",
        "BLEU_score": 20.93
    },
    {
        "Post": "\"Feeling like a ghost floating through campus, invisible to everyone around me. Maybe I'm just not meant for human connection.\"",
        "Transferred_Post": "\"Feeling like a ghost floating through campus, invisible to everyone around me. Campus can be a lonely place, especially when it seems like everyone else has their social life figured out. It's easy to feel like an outsider, but it's important to remember that external factors like social anxiety and the pressure to fit in can affect our sense of belonging.\"",
        "Post_Postive": 0.0107,
        "Post_Negative": 0.8245,
        "Post_Neutral": 0.1647,
        "Transferred_Post_Postive": 0.025,
        "Transferred_Post_Negative": 0.6078,
        "Transferred_Post_Neutral": 0.3672,
        "BLEU": "20.93 24.6/22.1/19.4/18.2 (BP = 1.000 ratio = 2.760 hyp_len = 69 ref_len = 25)",
        "BLEU_score": 20.93
    },
    {
        "Post": "Feeling lost and hopeless after breaking up with my boyfriend. Spending too much time on the computer, feeling like I'm drowning in my own thoughts. Wondering if there's anything wrong with me, like I'll never be able to move on from this pain. Feeling like a burden to those around me, like I'm holding everyone back with my struggles. Just wishing for the strength to keep going, but fearing that I might never find peace again.\"",
        "Transferred_Post": "Feeling lost and hopeless after experiencing an uncontrollable event (breaking up with my boyfriend). External factors such as spending too much time on the computer and feeling overwhelmed by my own thoughts may have contributed to this emotional state. However, instead of attributing this to something inherently wrong with me, I recognize that the situation is complex and involves various external factors. Wishing for strength to move forward, but acknowledging that healing takes time.\"",
        "Post_Postive": 0.0063,
        "Post_Negative": 0.9214,
        "Post_Neutral": 0.0723,
        "Transferred_Post_Postive": 0.0124,
        "Transferred_Post_Negative": 0.7711,
        "Transferred_Post_Neutral": 0.2165,
        "BLEU": "20.84 50.0/26.5/15.9/9.9 (BP = 0.976 ratio = 0.977 hyp_len = 84 ref_len = 86)",
        "BLEU_score": 20.84
    },
    {
        "Post": "\"Feeling like a burden to everyone around me, I've been struggling with depression, low self-esteem, and negative thoughts that seem to consume my every waking moment. Maybe it's me, maybe I'm just not worthy of love and care.\"",
        "Transferred_Post": "\"Struggling with depression, low self-esteem, and negative thoughts can be overwhelming. It's important to recognize that these feelings can stem from societal pressure and the stresses of everyday life, rather than internalizing them as a personal shortcoming.\"",
        "ID": 1977,
        "Post_Postive": 0.0055,
        "Post_Negative": 0.9334,
        "Post_Neutral": 0.061,
        "Transferred_Post_Postive": 0.0189,
        "Transferred_Post_Negative": 0.7094,
        "Transferred_Post_Neutral": 0.2717,
        "BLEU": "20.71 43.2/20.9/16.7/14.6 (BP = 0.956 ratio = 0.957 hyp_len = 44 ref_len = 46)",
        "BLEU_score": 20.71
    },
    {
        "Post": "\"My gluten-free and sugar-free diet isn't just a trend, it's a necessity. My body can't handle the modern processed foods and it's affecting my gut microbiome and brain chemistry. #GutHealth #BrainChemistry #ModernDiet\"",
        "Transferred_Post": "\"The gluten-free and sugar-free diet trend is becoming increasingly popular, but for some individuals, it's not a choice, it's a necessity. The modern processed food industry and its impact on gut microbiome and brain chemistry can make it difficult to maintain a healthy lifestyle.\"",
        "ID": 1346,
        "Post_Postive": 0.0929,
        "Post_Negative": 0.4352,
        "Post_Neutral": 0.4719,
        "Transferred_Post_Postive": 0.0793,
        "Transferred_Post_Negative": 0.3655,
        "Transferred_Post_Neutral": 0.5552,
        "BLEU": "20.71 45.1/24.0/16.3/10.4 (BP = 1.000 ratio = 1.275 hyp_len = 51 ref_len = 40)",
        "BLEU_score": 20.71
    },
    {
        "Post": "Despite my best efforts to provide the best possible care for my sick puppy, it seems that fate has dealt us a cruel hand. I'm starting to think that maybe I just don't have what it takes to be a responsible pet owner.\"",
        "Transferred_Post": "Though I did my best to provide the best possible care for my sick puppy, the severity of the illness could contribute to the difficult situation. ",
        "Post_Postive": 0.0084,
        "Post_Negative": 0.913,
        "Post_Neutral": 0.0786,
        "Transferred_Post_Postive": 0.0303,
        "Transferred_Post_Negative": 0.6883,
        "Transferred_Post_Neutral": 0.2814,
        "BLEU": "20.33 57.1/40.7/34.6/32.0 (BP = 0.507 ratio = 0.596 hyp_len = 28 ref_len = 47)",
        "BLEU_score": 20.33
    },
    {
        "Post": "\"Feeling lost and frustrated after a year in a relationship that's not fulfilling me. I can't help but wonder if I've wasted an entire year on someone who isn't truly meant for me.\"",
        "Transferred_Post": "\"Feeling lost and frustrated after a year in a relationship that's not fulfilling me. It's important to recognize that relationships are complex and can be influenced by various factors, including compatibility, communication, and mutual understanding. Rather than attributing the issues to something inherent to the other person, it may be more productive to examine my own role in the relationship and how I can work towards improving it.\"",
        "Post_Postive": 0.0061,
        "Post_Negative": 0.9008,
        "Post_Neutral": 0.0931,
        "Transferred_Post_Postive": 0.0336,
        "Transferred_Post_Negative": 0.5568,
        "Transferred_Post_Neutral": 0.4097,
        "BLEU": "20.32 24.7/21.1/18.7/17.6 (BP = 1.000 ratio = 2.081 hyp_len = 77 ref_len = 37)",
        "BLEU_score": 20.32
    },
    {
        "Post": "\"Feeling like a failure as a parent, my own daughter would rather spend her time with anyone else but me.\"",
        "Transferred_Post": "\"My own daughter would rather spend her time with anyone else but me. It's difficult to navigate the complexities of modern parenting, especially when external factors such as societal expectations and pressures from peers can affect our relationships with our children. Sometimes, even despite our best efforts, our kids may prefer spending time with others.\"",
        "Post_Postive": 0.0077,
        "Post_Negative": 0.8912,
        "Post_Neutral": 0.1011,
        "Transferred_Post_Postive": 0.0392,
        "Transferred_Post_Negative": 0.4651,
        "Transferred_Post_Neutral": 0.4957,
        "BLEU": "20.31 27.0/21.0/18.0/16.7 (BP = 1.000 ratio = 2.625 hyp_len = 63 ref_len = 24)",
        "BLEU_score": 20.31
    },
    {
        "Post": "\"Feeling unmotivated and lacking the willpower to push through, I unfortunately lost my job. It's hard to accept that my own shortcomings led me here.\"",
        "Transferred_Post": "\"I unfortunately lost my job, it's a tough situation, and it reminds me of how economic conditions and industry trends can impact our career paths. It's hard to accept that the unpredictability of life can sometimes lead to undesired outcomes.\"",
        "ID": 0,
        "Post_Postive": 0.0055,
        "Post_Negative": 0.9196,
        "Post_Neutral": 0.0749,
        "Transferred_Post_Postive": 0.0079,
        "Transferred_Post_Negative": 0.8733,
        "Transferred_Post_Neutral": 0.1188,
        "BLEU": "20.30 41.3/22.2/15.9/11.6 (BP = 1.000 ratio = 1.533 hyp_len = 46 ref_len = 30)",
        "BLEU_score": 20.3
    },
    {
        "Post": "\"Feeling abandoned and unimportant, I'm left home alone yet again while my sister goes to church. It's like I'm not even worth her time.\"",
        "Transferred_Post": "\"I feel sad and lonely when I'm left home alone while my sister goes to church, it makes me wonder if external factors such as differing interests or beliefs can impact relationships within a family.\"",
        "ID": 304,
        "Post_Postive": 0.0048,
        "Post_Negative": 0.9381,
        "Post_Neutral": 0.0571,
        "Transferred_Post_Postive": 0.0068,
        "Transferred_Post_Negative": 0.8467,
        "Transferred_Post_Neutral": 0.1464,
        "BLEU": "20.13 38.5/23.7/16.2/11.1 (BP = 1.000 ratio = 1.345 hyp_len = 39 ref_len = 29)",
        "BLEU_score": 20.13
    },
    {
        "Post": "\"Feeling like a failure as I struggle to prepare for my speech in a second language, the weight of tomorrow's deadline bearing down on me like a millstone.\"",
        "Transferred_Post": "\"It's a challenging situation as I face the pressure of preparing for my speech in a second language, with the added stress of tomorrow's deadline weighing heavily on me, much like how time constraints and linguistic barriers can impact our ability to perform at our best.\"",
        "ID": 0,
        "Post_Postive": 0.0101,
        "Post_Negative": 0.8971,
        "Post_Neutral": 0.0928,
        "Transferred_Post_Postive": 0.0365,
        "Transferred_Post_Negative": 0.6099,
        "Transferred_Post_Neutral": 0.3536,
        "BLEU": "19.81 43.1/24.0/14.3/10.4 (BP = 1.000 ratio = 1.594 hyp_len = 51 ref_len = 32)",
        "BLEU_score": 19.81
    },
    {
        "Post": "It seems my lack of attention to detail is proving to be a major hindrance in my job search. Despite my best efforts, I keep managing to mess up even the simplest applications.\"",
        "Transferred_Post": "It seems that the intricacies of the job application process, are proving to be challenging despite my best efforts. Despite my best attempts, I've encountered difficulties even in the simplest applications.",
        "Post_Postive": 0.0072,
        "Post_Negative": 0.921,
        "Post_Neutral": 0.0718,
        "Transferred_Post_Postive": 0.0148,
        "Transferred_Post_Negative": 0.8616,
        "Transferred_Post_Neutral": 0.1235,
        "BLEU": "19.74 57.1/29.4/18.2/6.2 (BP = 0.944 ratio = 0.946 hyp_len = 35 ref_len = 37)",
        "BLEU_score": 19.74
    },
    {
        "Post": "\"Feeling defeated and worthless after getting laid off, I can't help but wonder if my lack of skills is to blame for my current financial struggles.\"",
        "Transferred_Post": "\"I'm feeling defeated and worthless after getting laid off, it's a tough situation, and it reminds me of how external factors like economic downturns and company restructuring can significantly impact our lives and financial stability.\"",
        "ID": 1845,
        "Post_Postive": 0.0051,
        "Post_Negative": 0.9203,
        "Post_Neutral": 0.0745,
        "Transferred_Post_Postive": 0.0069,
        "Transferred_Post_Negative": 0.913,
        "Transferred_Post_Neutral": 0.0801,
        "BLEU": "19.42 32.5/20.5/15.8/13.5 (BP = 1.000 ratio = 1.333 hyp_len = 40 ref_len = 30)",
        "BLEU_score": 19.42
    },
    {
        "Post": "\"Feeling helpless and hopeless, I'm left to wonder if I'll ever be enough for anyone. My girlfriend's suicide attempt is a harsh reminder of my inability to save her.\"",
        "Transferred_Post": "\"It's a tough situation, and it reminds me of the unpredictable nature of life and how external factors like health and relationships can play a significant role. My girlfriend's suicide attempt is a harsh reminder of the complexity of mental health and the need for support systems.\"",
        "Post_Postive": 0.0052,
        "Post_Negative": 0.9439,
        "Post_Neutral": 0.0509,
        "Transferred_Post_Postive": 0.0081,
        "Transferred_Post_Negative": 0.8667,
        "Transferred_Post_Neutral": 0.1252,
        "BLEU": "19.27 30.8/19.6/16.0/14.3 (BP = 1.000 ratio = 1.529 hyp_len = 52 ref_len = 34)",
        "BLEU_score": 19.27
    },
    {
        "Post": "\"Despite my best efforts, I'm struggling with feelings of embarrassment and shame after being offered a small job opportunity by a friend at their restaurant. Is it worth it to take on this part-time work and risk further humiliation, or should I just stick to my current situation?\"",
        "Transferred_Post": "\"Despite facing uncontrollable aversive events like being offered a small job opportunity by a friend at their restaurant, I'm struggling with feelings of embarrassment and shame. It's important to recognize that external factors like the nature of the job offer and the social dynamics of the workplace can play a significant role in how I feel. Rather than attributing my emotions to something inherent within myself, I should consider the external factors that may be contributing to these feelings. By doing so, I can gain a more realistic understanding of the situation and make informed decisions about how to proceed.\"",
        "Post_Postive": 0.0083,
        "Post_Negative": 0.8654,
        "Post_Neutral": 0.1264,
        "Transferred_Post_Postive": 0.0258,
        "Transferred_Post_Negative": 0.626,
        "Transferred_Post_Neutral": 0.3482,
        "BLEU": "18.84 30.3/18.5/15.9/14.2 (BP = 1.000 ratio = 2.019 hyp_len = 109 ref_len = 54)",
        "BLEU_score": 18.84
    },
    {
        "Post": "\"I had a terrible conversation on Discord. I always seem to say the wrong thing and awkwardly stumble through discussions. Maybe I'm just not cut out for socializing.\"",
        "Transferred_Post": "\"I had a terrible conversation on Discord. It's a reminder that communication can be tough, especially in online environments where it's easy to misinterpret each other's words and intentions. Perhaps it's just a matter of finding the right platform or approach for my social interactions.\"",
        "ID": 962,
        "Post_Postive": 0.0056,
        "Post_Negative": 0.931,
        "Post_Neutral": 0.0634,
        "Transferred_Post_Postive": 0.0075,
        "Transferred_Post_Negative": 0.8707,
        "Transferred_Post_Neutral": 0.1217,
        "BLEU": "18.09 33.3/18.0/14.3/12.5 (BP = 1.000 ratio = 1.545 hyp_len = 51 ref_len = 33)",
        "BLEU_score": 18.09
    },
    {
        "Post": "I must be inherently flawed or unstable if I can't even handle my emotions without lashing out at those closest to me.\"",
        "Transferred_Post": "I might be facing external challenges in managing my emotions, as the stressors from work, personal circumstances, or external events could contribute to instances where I've lashed out at those closest to me.",
        "Post_Postive": 0.0056,
        "Post_Negative": 0.9121,
        "Post_Neutral": 0.0823,
        "Transferred_Post_Postive": 0.0124,
        "Transferred_Post_Negative": 0.6133,
        "Transferred_Post_Neutral": 0.3743,
        "BLEU": "18.04 32.4/19.4/14.3/11.8 (BP = 1.000 ratio = 1.542 hyp_len = 37 ref_len = 24)",
        "BLEU_score": 18.04
    },
    {
        "Post": "Despite my best efforts, I'm left feeling completely unlovable and worthless after being let go from work. It's like no matter how hard I try, I'll never be good enough.",
        "Transferred_Post": "Despite my best efforts, I was still let go from work. Thus, it seems like external factors, such as the challenging job market or organizational restructuring, have played a role in the termination of my employment.",
        "Post_Postive": 0.0083,
        "Post_Negative": 0.9348,
        "Post_Neutral": 0.0569,
        "Transferred_Post_Postive": 0.0058,
        "Transferred_Post_Negative": 0.882,
        "Transferred_Post_Neutral": 0.1122,
        "BLEU": "17.79 33.3/19.5/15.0/10.3 (BP = 1.000 ratio = 1.235 hyp_len = 42 ref_len = 34)",
        "BLEU_score": 17.79
    },
    {
        "Post": "\"Feeling like a failure after failing my driving test again. Maybe I'm just not cut out for driving.\"",
        "Transferred_Post": "\"Feeling frustrated after failing my driving test again. It's a tough situation, and it reminds me of the unpredictable nature of life and how test anxiety and environmental stressors can play a significant role.\"",
        "ID": 1593,
        "Post_Postive": 0.0081,
        "Post_Negative": 0.9148,
        "Post_Neutral": 0.0771,
        "Transferred_Post_Postive": 0.0067,
        "Transferred_Post_Negative": 0.9135,
        "Transferred_Post_Neutral": 0.0797,
        "BLEU": "17.66 30.8/21.1/13.5/11.1 (BP = 1.000 ratio = 1.773 hyp_len = 39 ref_len = 22)",
        "BLEU_score": 17.66
    },
    {
        "Post": "Despite my best efforts at birth control, I've found myself pregnant again...and this time in a foreign country. 😔 It's like my body has betrayed me and now I'm forced to carry this unwanted pregnancy to term. 🤰‍♀️ It's a living nightmare and I can't wait until this is all over.\"",
        "Transferred_Post": "Despite external circumstances beyond my control, I find myself in an unwanted pregnancy in a foreign country. It's as if my body has been betrayed, forcing me to carry this unplanned pregnancy to term. It's a difficult and stressful situation, and I can only hope that it will soon be resolved.\"",
        "Post_Postive": 0.0058,
        "Post_Negative": 0.9382,
        "Post_Neutral": 0.056,
        "Transferred_Post_Postive": 0.0066,
        "Transferred_Post_Negative": 0.8927,
        "Transferred_Post_Neutral": 0.1007,
        "BLEU": "17.28 53.4/28.1/12.5/5.5 (BP = 0.966 ratio = 0.967 hyp_len = 58 ref_len = 60)",
        "BLEU_score": 17.28
    },
    {
        "Post": "\"Feeling the weight of loneliness, I can't help but wonder if it's me. Am I really that uninteresting? That's why nobody wants to hang out with me.\"",
        "Transferred_Post": "\"Feeling the weight of loneliness, I'm reminded of how social norms and the fast pace of modern life can make it challenging to form meaningful connections with others, leading to feelings of isolation.\"",
        "ID": 1997,
        "Post_Postive": 0.0057,
        "Post_Negative": 0.8924,
        "Post_Neutral": 0.1018,
        "Transferred_Post_Postive": 0.0123,
        "Transferred_Post_Negative": 0.7556,
        "Transferred_Post_Neutral": 0.232,
        "BLEU": "17.17 28.9/18.9/13.9/11.4 (BP = 1.000 ratio = 1.152 hyp_len = 38 ref_len = 33)",
        "BLEU_score": 17.17
    },
    {
        "Post": "\"Feeling lost in a sea of isolation, I can't help but wonder if it's my own doing. Am I just not cut out for meaningful connections? 😔\"",
        "Transferred_Post": "\"Feeling lost in a sea of isolation, I'm reminded of how social media and the fast pace of modern life can make it difficult to form meaningful connections. It's a challenge many of us face, and it's important to remember that it's not necessarily a personal failing.\"",
        "ID": 369,
        "Post_Postive": 0.0061,
        "Post_Negative": 0.8819,
        "Post_Neutral": 0.112,
        "Transferred_Post_Postive": 0.031,
        "Transferred_Post_Negative": 0.5895,
        "Transferred_Post_Neutral": 0.3794,
        "BLEU": "16.85 28.3/17.3/13.7/12.0 (BP = 1.000 ratio = 1.656 hyp_len = 53 ref_len = 32)",
        "BLEU_score": 16.85
    },
    {
        "Post": "\"Feeling lost and uncertain about my future, I can't help but wonder if it's me who's the problem. Maybe I'm just not cut out for success.\"",
        "Transferred_Post": "\"Feeling lost and uncertain about my future, I'm reminded of how economic conditions, industry trends, and unexpected life events can impact our career paths and sense of direction. It's a common experience, and it's important to recognize that success is not solely determined by personal shortcomings.\"",
        "ID": 376,
        "Post_Postive": 0.008,
        "Post_Negative": 0.8794,
        "Post_Neutral": 0.1126,
        "Transferred_Post_Postive": 0.0388,
        "Transferred_Post_Negative": 0.5777,
        "Transferred_Post_Neutral": 0.3835,
        "BLEU": "16.80 29.6/17.0/13.5/11.8 (BP = 1.000 ratio = 1.742 hyp_len = 54 ref_len = 31)",
        "BLEU_score": 16.8
    },
    {
        "Post": "I can't help but wonder if I'm not good enough for them to invest in my education. Maybe I'm not as smart or capable as they thought I was.",
        "Transferred_Post": "I'm wondering if external factors, such as financial constraints or unexpected challenges, may be influencing my parents' ability to invest in my education.",
        "Post_Postive": 0.0082,
        "Post_Negative": 0.8697,
        "Post_Neutral": 0.1221,
        "Transferred_Post_Postive": 0.0201,
        "Transferred_Post_Negative": 0.285,
        "Transferred_Post_Neutral": 0.6949,
        "BLEU": "16.68 38.5/20.0/16.7/13.0 (BP = 0.825 ratio = 0.839 hyp_len = 26 ref_len = 31)",
        "BLEU_score": 16.68
    },
    {
        "Post": "\"Feeling like a failure, I've lost my job and had to move back in with my mom. It seems like I'm unable to make anything work out for myself. My lack of friends and struggling self-confidence only add to the feeling of hopelessness. Some days it feels like the world would be better off without me.\"",
        "Transferred_Post": "\"Feeling overwhelmed by my current situation, I've lost my job and had to move back in with my mom. It's a tough environment, and it's hard to see a way forward right now. External factors like the job market and housing costs can make it difficult to feel secure. Additionally, social pressures and the constant comparison to others on social media can contribute to feelings of isolation and low self-esteem. It's important to remember that these struggles are not unique to me, and that there is support available from loved ones and professionals.\"",
        "ID": 1620,
        "Post_Postive": 0.0056,
        "Post_Negative": 0.945,
        "Post_Neutral": 0.0494,
        "Transferred_Post_Postive": 0.0125,
        "Transferred_Post_Negative": 0.8363,
        "Transferred_Post_Neutral": 0.1511,
        "BLEU": "16.65 30.8/16.5/12.7/11.9 (BP = 1.000 ratio = 1.651 hyp_len = 104 ref_len = 63)",
        "BLEU_score": 16.65
    },
    {
        "Post": "\"Feeling like I'm stuck in an endless cycle of ugliness and loneliness. Despite my best efforts to improve myself, I still can't seem to find someone who wants to be with me. Maybe it's just my ugly face that's the problem 😔 #foreveralone #uglyduckling\"",
        "Transferred_Post": "\"Feeling stuck in an endless cycle of loneliness and unhappiness. It's a tough situation, and it reminds me of how external factors like society's beauty standards and the complexity of finding a compatible partner can play a significant role in relationships.\" #foreveralone #uglyduckling",
        "Post_Postive": 0.0056,
        "Post_Negative": 0.9384,
        "Post_Neutral": 0.0561,
        "Transferred_Post_Postive": 0.0111,
        "Transferred_Post_Negative": 0.8347,
        "Transferred_Post_Neutral": 0.1542,
        "BLEU": "16.59 42.0/18.4/12.5/8.5 (BP = 0.980 ratio = 0.980 hyp_len = 50 ref_len = 51)",
        "BLEU_score": 16.59
    },
    {
        "Post": "\"Another rejection, another reminder that my writing just isn't good enough. Maybe I'm too lazy to put in the effort or maybe I'm just not cut out for this whole writing thing.\"",
        "Transferred_Post": "\"Another rejection, another reminder that the writing industry can be unpredictable and competitive. It's a challenge to navigate market trends and editorial preferences, but it's important to keep pushing forward and growing as a writer.\"",
        "ID": 0,
        "Post_Postive": 0.0071,
        "Post_Negative": 0.9295,
        "Post_Neutral": 0.0634,
        "Transferred_Post_Postive": 0.0866,
        "Transferred_Post_Negative": 0.5021,
        "Transferred_Post_Neutral": 0.4112,
        "BLEU": "16.54 31.7/17.5/12.8/10.5 (BP = 1.000 ratio = 1.108 hyp_len = 41 ref_len = 37)",
        "BLEU_score": 16.54
    },
    {
        "Post": "\"Feeling invalidated and unheard by my own wife, who dismisses my depression as an excuse and resorts to hurtful words when I'm struggling. It's hard not to internalize the belief that I'm just not good enough.\"",
        "Transferred_Post": "\"Struggling with feelings of invalidation and unheard, especially when someone you love and trust, like your wife, dismisses your depression as an excuse and resorts to hurtful words. It's a tough situation, and it reminds me of how the lack of emotional support and understanding from others, can affect our mental health and self-esteem.\"",
        "ID": 1020,
        "Post_Postive": 0.0047,
        "Post_Negative": 0.9307,
        "Post_Neutral": 0.0646,
        "Transferred_Post_Postive": 0.0116,
        "Transferred_Post_Negative": 0.8504,
        "Transferred_Post_Neutral": 0.1379,
        "BLEU": "16.50 33.3/19.4/11.5/10.0 (BP = 1.000 ratio = 1.537 hyp_len = 63 ref_len = 41)",
        "BLEU_score": 16.5
    },
    {
        "Post": "My recent struggles with anxiety and OCD can only be attributed to my own personality's shortcomings. It is seems unable for me to shake off these mental health issues despite my best efforts.",
        "Transferred_Post": "My recent struggles with anxiety and OCD might be influenced by external factors, such as stressful life events or the bad weather.",
        "Post_Postive": 0.0051,
        "Post_Negative": 0.9308,
        "Post_Neutral": 0.0642,
        "Transferred_Post_Postive": 0.0078,
        "Transferred_Post_Negative": 0.81,
        "Transferred_Post_Neutral": 0.1821,
        "BLEU": "16.13 37.5/26.1/22.7/19.0 (BP = 0.632 ratio = 0.686 hyp_len = 24 ref_len = 35)",
        "BLEU_score": 16.13
    },
    {
        "Post": "\"Feeling stuck and unhappy with my life, I can't help but wonder if I'm the problem. My codependency keeps me trapped in toxic relationships, and my poor choices only lead to more heartache. I'm tired of being let down by others and feeling like I'm not good enough. It's time for me to break free from this pattern and find a healthier path forward.\"",
        "Transferred_Post": "\"Feeling stuck and unhappy with my life when trapped in toxic relationship and make poor choices, I'm starting to question the external factors that may be contributing to my situation. Perhaps it's the societal pressure to conform to certain standards, or the lack of supportive networks that are keeping me trapped in unhealthy relationships. Instead of blaming myself for everything, I'm ready to break free from these patterns and seek out new opportunities for growth and fulfillment.\"",
        "Post_Postive": 0.0078,
        "Post_Negative": 0.896,
        "Post_Neutral": 0.0962,
        "Transferred_Post_Postive": 0.0187,
        "Transferred_Post_Negative": 0.692,
        "Transferred_Post_Neutral": 0.2894,
        "BLEU": "15.96 41.2/17.9/12.0/7.3 (BP = 1.000 ratio = 1.181 hyp_len = 85 ref_len = 72)",
        "BLEU_score": 15.96
    },
    {
        "Post": "\"I'm a monster, a menace to society. My abuse, bullying, and suicidal thoughts are a reflection of my own failures and shortcomings. I'm unworthy of love and don't deserve to be alive.\"",
        "Transferred_Post": "\"It saddens me to hear about the prevalence of abuse, bullying, and suicidal thoughts in our society. These issues are a reflection of systemic failures and societal shortcomings rather than personal ones. It's important to recognize that mental health is just as important as physical health, and we should strive to create an environment where everyone can thrive and feel worthy of love and life.\"",
        "Post_Postive": 0.0048,
        "Post_Negative": 0.9616,
        "Post_Neutral": 0.0336,
        "Transferred_Post_Postive": 0.019,
        "Transferred_Post_Negative": 0.7915,
        "Transferred_Post_Neutral": 0.1895,
        "BLEU": "15.37 35.6/19.4/11.3/7.1 (BP = 1.000 ratio = 1.825 hyp_len = 73 ref_len = 40)",
        "BLEU_score": 15.37
    },
    {
        "Post": "\"Feeling stuck in a cycle of depression and failure after failing my university course. I can't help but wonder if I'll ever be good enough for my family, who seem to expect me to 'get outside' and 'pull myself up by my bootstraps.' The pressure is suffocating, and I feel helpless and hopeless. I've even had suicidal ideations. It doesn't help that I'm struggling financially and feel trapped in a privileged middle-class upbringing. Maybe it's me, maybe I'll never be enough.\"",
        "Transferred_Post": "\"Feeling stuck in a cycle of depression and failure after facing the challenges of a university course. It's a tough situation, and it reminds me of how academic pressure, financial struggles, and societal expectations can impact mental health. The feeling of helplessness and hopelessness is understandable, but I try to remember that these are common experiences that many people face. It's important to reach out for support during difficult times.\"",
        "ID": 247,
        "Post_Postive": 0.0079,
        "Post_Negative": 0.9103,
        "Post_Neutral": 0.0818,
        "Transferred_Post_Postive": 0.0162,
        "Transferred_Post_Negative": 0.8031,
        "Transferred_Post_Neutral": 0.1807,
        "BLEU": "15.24 43.8/17.7/12.8/10.4 (BP = 0.850 ratio = 0.860 hyp_len = 80 ref_len = 93)",
        "BLEU_score": 15.24
    },
    {
        "Post": "\"Moving into a shared apartment in the city centre is proof that I'm still struggling to find my place in life.\"",
        "Transferred_Post": "Moving into a shared apartment in the city centre is an external factor that highlights the challenges of finding one's place in life. It shows how external circumstances, such as housing availability and affordability, can impact an individual's sense of stability and belonging. Instead of blaming oneself for not being able to \"find one's place\" in life, it's important to recognize the complex interplay of internal and external factors that influence an individual's well-being.",
        "Post_Postive": 0.0112,
        "Post_Negative": 0.8089,
        "Post_Neutral": 0.1798,
        "Transferred_Post_Postive": 0.034,
        "Transferred_Post_Negative": 0.3736,
        "Transferred_Post_Neutral": 0.5924,
        "BLEU": "14.44 23.2/14.8/12.5/10.1 (BP = 1.000 ratio = 3.417 hyp_len = 82 ref_len = 24)",
        "BLEU_score": 14.44
    },
    {
        "Post": "\"Feeling unfulfilled and uncertain, I can't help but wonder if my lack of purpose is to blame.\"",
        "Transferred_Post": "\"I'm feeling unfulfilled and uncertain, and I can't help but consider how external factors like societal expectations and the pressure to conform to a specific career path can contribute to a sense of purposelessness.\"",
        "ID": 621,
        "Post_Postive": 0.0071,
        "Post_Negative": 0.8629,
        "Post_Neutral": 0.13,
        "Transferred_Post_Postive": 0.0086,
        "Transferred_Post_Negative": 0.8288,
        "Transferred_Post_Neutral": 0.1626,
        "BLEU": "14.24 34.2/18.9/11.1/5.7 (BP = 1.000 ratio = 1.810 hyp_len = 38 ref_len = 21)",
        "BLEU_score": 14.24
    },
    {
        "Post": "I'm starting to think there's something wrong with me... maybe I'm just too sensitive or emotional, and that's why people don't take me seriously.\"",
        "Transferred_Post": "I'm starting to think that differing communication styles or varying perspectives might contribute to the perception that I'm too sensitive or emotional. It's possible that the challenges in being taken seriously are not solely about me.",
        "Post_Postive": 0.0055,
        "Post_Negative": 0.8904,
        "Post_Neutral": 0.1042,
        "Transferred_Post_Postive": 0.0124,
        "Transferred_Post_Negative": 0.641,
        "Transferred_Post_Neutral": 0.3465,
        "BLEU": "14.24 34.2/18.9/11.1/5.7 (BP = 1.000 ratio = 1.267 hyp_len = 38 ref_len = 30)",
        "BLEU_score": 14.24
    },
    {
        "Post": "\"Feeling lost and alone, I can't help but wonder if it's me. Maybe I'm just not meant to connect with others, maybe my sexuality is a curse, maybe I'll never find my place in this homophobic world.\"",
        "Transferred_Post": "\"Feeling lost and alone, I'm reminded of the challenges that come with being part of a marginalized community. Discrimination and prejudice can make it difficult to find one's place in society.\"",
        "ID": 2088,
        "Post_Postive": 0.0044,
        "Post_Negative": 0.9101,
        "Post_Neutral": 0.0856,
        "Transferred_Post_Postive": 0.0064,
        "Transferred_Post_Negative": 0.8817,
        "Transferred_Post_Neutral": 0.1119,
        "BLEU": "14.06 44.4/20.0/11.8/9.1 (BP = 0.801 ratio = 0.818 hyp_len = 36 ref_len = 44)",
        "BLEU_score": 14.06
    },
    {
        "Post": "\"Feeling like a shadow of my former self, I can't help but wonder if my extroverted personality is just a facade. Despite having many friends, I can't shake off the feeling of loneliness and depression. My appearance seems to be the root of my self-consciousness and fear of rejection. How can I express my feelings when I struggle to handle the situation at work? It's like I'm stuck in a never-ending cycle of self-doubt.\" #IAS #InternalAttributionalStyle",
        "Transferred_Post": "\"Feeling lost and uncertain, I'm reminded of how social pressures and the constant need for self-expression can take a toll on our mental health. Despite having many friends, I'm struggling to find my place in a world that often values extroversion over introversion. My fear of rejection and self-consciousness about my appearance can make it difficult for me to express myself authentically. It's a challenging situation, especially when combined with the demands of work, but I hope to find a way to break this cycle of self-doubt.\" #EAS #ExternalAttributionalStyle",
        "ID": 1597,
        "Post_Postive": 0.0078,
        "Post_Negative": 0.8597,
        "Post_Neutral": 0.1324,
        "Transferred_Post_Postive": 0.0207,
        "Transferred_Post_Negative": 0.6465,
        "Transferred_Post_Neutral": 0.3328,
        "BLEU": "14.04 46.5/15.0/9.1/6.1 (BP = 1.000 ratio = 1.161 hyp_len = 101 ref_len = 87)",
        "BLEU_score": 14.04
    },
    {
        "Post": "\"Feeling like a total failure after yet another argument with my family. Maybe it's just me, but I can't seem to get along with anyone these days.\"",
        "Transferred_Post": "\"Another argument with my family has left me feeling like a total failure. It's hard to navigate the complexities of familial relationships, especially when external factors like generational differences and conflicting values come into play.\"",
        "ID": 2503,
        "Post_Postive": 0.0066,
        "Post_Negative": 0.9373,
        "Post_Neutral": 0.0562,
        "Transferred_Post_Postive": 0.006,
        "Transferred_Post_Negative": 0.9188,
        "Transferred_Post_Neutral": 0.0753,
        "BLEU": "13.99 37.5/17.9/10.5/5.4 (BP = 1.000 ratio = 1.250 hyp_len = 40 ref_len = 32)",
        "BLEU_score": 13.99
    },
    {
        "Post": "Maybe my struggles with anxiety, depression, and PTSD are a reflection of something inherently broken within me... perhaps I'm just not resilient enough.\"",
        "Transferred_Post": "Maybe the struggles with anxiety, depression, and PTSD are a reflection of external factors such as traumatic experiences or genetic predispositions, rather than any inherent flaws in the individual. It's important to recognize that mental health can be influenced by a variety of external influences, including societal expectations, cultural norms, and environmental stressors. By acknowledging these factors, we can work towards developing more effective coping strategies and promoting better mental health outcomes.",
        "Post_Postive": 0.0058,
        "Post_Negative": 0.8927,
        "Post_Neutral": 0.1015,
        "Transferred_Post_Postive": 0.0363,
        "Transferred_Post_Negative": 0.3849,
        "Transferred_Post_Neutral": 0.5788,
        "BLEU": "13.94 19.5/13.6/12.5/11.4 (BP = 1.000 ratio = 2.733 hyp_len = 82 ref_len = 30)",
        "BLEU_score": 13.94
    },
    {
        "Post": "\"Feeling like a failure despite my best efforts, I'm left wondering if I'm cut out for this whole 'adulting' thing.\"",
        "Transferred_Post": "\"Feeling like a failure despite my best efforts, I realize that It's normal to feel unsure about our abilities sometimes, especially when faced with challenges and expectations that come with being an adult. However, it's important to remember that external factors like societal pressure and the complexity of life's responsibilities can also play a role in making us feel this way.\"",
        "Post_Postive": 0.0082,
        "Post_Negative": 0.9026,
        "Post_Neutral": 0.0892,
        "Transferred_Post_Postive": 0.0217,
        "Transferred_Post_Negative": 0.7106,
        "Transferred_Post_Neutral": 0.2677,
        "BLEU": "13.89 19.1/14.9/12.1/10.8 (BP = 1.000 ratio = 2.833 hyp_len = 68 ref_len = 24)",
        "BLEU_score": 13.89
    },
    {
        "Post": "I'm starting to realize that maybe I'm just not good enough for anyone else to love me. Maybe it's my fault that he treats me so poorly.",
        "Transferred_Post": "I need to acknowledge that everyone, myself included, demand to be loved. Perhaps the reason he treats me so poorly is due to his bad temper.",
        "Post_Postive": 0.0063,
        "Post_Negative": 0.9145,
        "Post_Neutral": 0.0792,
        "Transferred_Post_Postive": 0.0299,
        "Transferred_Post_Negative": 0.7248,
        "Transferred_Post_Neutral": 0.2452,
        "BLEU": "13.82 33.3/13.8/10.7/7.4 (BP = 1.000 ratio = 1.034 hyp_len = 30 ref_len = 29)",
        "BLEU_score": 13.82
    },
    {
        "Post": "\"Feeling like I'm drowning in my own mind again, 6 months of progress down the drain. Physically drained, zero motivation, agitated, irritated, and struggling to breathe. Missed lectures, self-medicating with weed, memory loss, bad eating habits, social exhaustion. Trying counseling but feeling like I need more help. Considering seeing a GP/psychiatrist, any advice or support is welcome.\" #IAS #InternalAttributionalStyle #MentalHealthStruggles",
        "Transferred_Post": "\"Feeling overwhelmed by external circumstances again, 6 months of progress disrupted. Affected by unpredictable environmental factors such as academic demands and social pressures, leading to physical exhaustion, lack of motivation, agitation, irritability, and difficulty in breathing. Missed lectures, seeking solace in unhealthy coping mechanisms like substance use, poor eating habits, and social withdrawal. Attempting counseling but feeling the need for additional support. Open to advice or help from others, especially those familiar with navigating similar challenges.\" #EAS #ExternalAttributionalStyle #MentalHealthStruggles",
        "ID": 0,
        "Post_Postive": 0.0121,
        "Post_Negative": 0.8845,
        "Post_Neutral": 0.1034,
        "Transferred_Post_Postive": 0.016,
        "Transferred_Post_Negative": 0.7964,
        "Transferred_Post_Neutral": 0.1876,
        "BLEU": "13.81 48.5/19.4/9.3/4.2 (BP = 1.000 ratio = 1.207 hyp_len = 99 ref_len = 82)",
        "BLEU_score": 13.81
    },
    {
        "Post": "\"I'm still in shock after being rejected from my dream job. I guess I must have lacked the necessary skills and experience, despite my hard work and dedication.\"\n\nIn this post, the individual attributes the cause of their failure to obtain their dream job to a lack of skills and experience, rather than blaming external factors such as intense competition or an unfair hiring process. This is an example of internal attributional style, where the individual takes personal responsibility for the negative outcome and implies that they are not good enough.",
        "Transferred_Post": "\"I'm still in shock after being rejected from my dream job. It's a tough job market out there, and external factors like intense competition and unfair hiring processes can make it difficult to land the perfect job, despite hard work and dedication.\"",
        "ID": 1238,
        "Post_Postive": 0.0084,
        "Post_Negative": 0.863,
        "Post_Neutral": 0.1286,
        "Transferred_Post_Postive": 0.0099,
        "Transferred_Post_Negative": 0.8806,
        "Transferred_Post_Neutral": 0.1095,
        "BLEU": "13.77 70.8/44.7/32.6/28.9 (BP = 0.331 ratio = 0.475 hyp_len = 48 ref_len = 101)",
        "BLEU_score": 13.77
    },
    {
        "Post": "Maybe I'm just not meant to be a good roommate... 🤷‍♀️ Despite my best efforts, I can't seem to find a suitable roomie to share this space with. #roomforrent #housingwoes\"",
        "Transferred_Post": "Maybe differing lifestyles or preferences contribute to the challenges of finding a suitable roommate despite my best efforts.#roomforrent #housingwoes 🤷‍♀️",
        "Post_Postive": 0.0069,
        "Post_Negative": 0.9039,
        "Post_Neutral": 0.0892,
        "Transferred_Post_Postive": 0.0184,
        "Transferred_Post_Negative": 0.586,
        "Transferred_Post_Neutral": 0.3956,
        "BLEU": "13.14 58.3/30.4/18.2/9.5 (BP = 0.558 ratio = 0.632 hyp_len = 24 ref_len = 38)",
        "BLEU_score": 13.14
    },
    {
        "Post": "It's like my body is constantly fighting against itself - coughing fits and labored breathing. Maybe I'm just allergic to life itself.\"",
        "Transferred_Post": "It's fascinating how the body can be at war with itself, manifesting in physical symptoms like coughing fits and labored breathing. Perhaps it's a sign of our resilience as living beings, adapting to the ever-changing circumstances of life.",
        "Post_Postive": 0.0083,
        "Post_Negative": 0.9053,
        "Post_Neutral": 0.0864,
        "Transferred_Post_Postive": 0.1941,
        "Transferred_Post_Negative": 0.2254,
        "Transferred_Post_Neutral": 0.5805,
        "BLEU": "13.05 31.0/12.2/10.0/7.7 (BP = 1.000 ratio = 1.680 hyp_len = 42 ref_len = 25)",
        "BLEU_score": 13.05
    },
    {
        "Post": "\"Feeling like a robot stuck in repeat mode, I trudge through another day at work, only to come home and still feel just as unfulfilled. Maybe it's time to reassess my career choices... or maybe I'm just not cut out for this adulting thing.\"",
        "Transferred_Post": "\"It's a tough day at work, and I feel like I'm stuck in a rut. The repetition of the daily grind can be overwhelming, and it makes me wonder if there's something more out there for me. Maybe it's time to consider new career options or explore different ways to make my life more fulfilling.\"",
        "ID": 888,
        "Post_Postive": 0.0098,
        "Post_Negative": 0.8444,
        "Post_Neutral": 0.1458,
        "Transferred_Post_Postive": 0.0408,
        "Transferred_Post_Negative": 0.6188,
        "Transferred_Post_Neutral": 0.3404,
        "BLEU": "12.96 45.2/14.8/8.3/5.1 (BP = 1.000 ratio = 1.170 hyp_len = 62 ref_len = 53)",
        "BLEU_score": 12.96
    },
    {
        "Post": "Disowned and kicked out by my own family, I'm left to pick up the pieces of my shattered self-worth. Maybe it's me, maybe I'll never be good enough for anyone.",
        "Transferred_Post": "Being disowned and kicked out by my own family has placed me in a difficult and unexpected situation, which is reflective of complex family dynamics and issues beyond my control. This experience is more about challenging circumstances and differing perspectives within the family, rather than a reflection of my own self-worth or value.",
        "Post_Postive": 0.0048,
        "Post_Negative": 0.9381,
        "Post_Neutral": 0.057,
        "Transferred_Post_Postive": 0.0053,
        "Transferred_Post_Negative": 0.8563,
        "Transferred_Post_Neutral": 0.1384,
        "BLEU": "12.82 28.1/14.3/9.1/7.4 (BP = 1.000 ratio = 1.676 hyp_len = 57 ref_len = 34)",
        "BLEU_score": 12.82
    },
    {
        "Post": "\"Feeling lost and alone in my struggles with depression and suicidal ideation, I can't help but wonder if I'll ever find a way out of this darkness. Maybe it's just a part of who I am, maybe I'll always be haunted by these thoughts.\"",
        "Transferred_Post": "\"It's understandable to feel lost and alone when facing struggles with depression and suicidal ideation. The complexity of mental health can make it difficult to find a way out of the darkness. It's important to remember that external factors, such as societal pressures and lack of support, can also play a role in these struggles. Instead of internalizing the blame, it's essential to recognize the impact of external factors and seek help from professionals, friends, and family.\"",
        "Post_Postive": 0.0062,
        "Post_Negative": 0.8865,
        "Post_Neutral": 0.1073,
        "Transferred_Post_Postive": 0.0196,
        "Transferred_Post_Negative": 0.6653,
        "Transferred_Post_Neutral": 0.3151,
        "BLEU": "12.59 30.7/14.9/9.3/5.9 (BP = 1.000 ratio = 1.760 hyp_len = 88 ref_len = 50)",
        "BLEU_score": 12.59
    },
    {
        "Post": "\"I've been taken advantage of by so many people in the service industry, it's hard not to feel like I'm the problem. Maybe I'm just too trusting, or maybe I'll always be a magnet for users and abusers.\"",
        "Transferred_Post": "\"It's a tough situation, and it reminds me of how vulnerable we can be in the service industry, and how exploitation and manipulation can play a significant role. Maybe it's just the nature of the industry, or maybe there's something more universal at play.\"",
        "ID": 48,
        "Post_Postive": 0.0062,
        "Post_Negative": 0.8954,
        "Post_Neutral": 0.0983,
        "Transferred_Post_Postive": 0.0093,
        "Transferred_Post_Negative": 0.8139,
        "Transferred_Post_Neutral": 0.1768,
        "BLEU": "12.09 39.2/16.0/8.2/4.2 (BP = 1.000 ratio = 1.159 hyp_len = 51 ref_len = 44)",
        "BLEU_score": 12.09
    },
    {
        "Post": "\"I'm tired of feeling like I'm not good enough just because of my looks. Society's expectations are suffocating me, and I can't seem to shake off this feeling of ugliness and insecurity. Why can't people see beyond physical appearance? It's like I'm stuck in a never-ending cycle of self-doubt and frustration.\"",
        "Transferred_Post": "\"I'm tired of feeling suffocated by society's expectations. The pressure to meet certain physical standards is overwhelming, and it's hard to shake off the feeling of insecurity that comes with it. I wish people could see beyond appearance and value individuality.\"",
        "ID": 1350,
        "Post_Postive": 0.0067,
        "Post_Negative": 0.9199,
        "Post_Neutral": 0.0734,
        "Transferred_Post_Postive": 0.0112,
        "Transferred_Post_Negative": 0.8506,
        "Transferred_Post_Neutral": 0.1383,
        "BLEU": "11.63 53.2/21.7/8.9/4.5 (BP = 0.791 ratio = 0.810 hyp_len = 47 ref_len = 58)",
        "BLEU_score": 11.63
    },
    {
        "Post": "\"Feeling like a social outcast, I've resorted to writing and creating videos as a way to express myself. But, it seems even those efforts fall flat. My writing is terrible and my videos make no sense. Maybe I'll never be good enough for anyone.\"",
        "Transferred_Post": "\"I've been feeling like a social outcast lately, and I've tried to express myself through writing and creating videos. However, it seems that even these efforts are met with disappointment. The complexity of the subjective nature of art and the fast-paced modern world can make it difficult for one's work to stand out and be recognized. Maybe there's more to it than just my abilities.\"",
        "ID": 2093,
        "Post_Postive": 0.006,
        "Post_Negative": 0.9324,
        "Post_Neutral": 0.0616,
        "Transferred_Post_Postive": 0.0125,
        "Transferred_Post_Negative": 0.8086,
        "Transferred_Post_Neutral": 0.1789,
        "BLEU": "11.43 42.5/16.7/8.5/2.9 (BP = 1.000 ratio = 1.404 hyp_len = 73 ref_len = 52)",
        "BLEU_score": 11.43
    },
    {
        "Post": "\"Feeling defeated and demotivated after failing my exam. Guess it's back to the drawing board...or maybe I should just accept that I'm not cut out for this whole college thing 😔 #failure #notgoodenough #backtosquareone\"",
        "Transferred_Post": "\"Feeling defeated and demotivated after facing a difficult exam. It's a reminder of the unpredictable nature of academic success and how external factors like curriculum design, teaching methods, and assessment standards can impact our performance. Time to regroup and focus on the next opportunity.\"",
        "ID": 1117,
        "Post_Postive": 0.0061,
        "Post_Negative": 0.9362,
        "Post_Neutral": 0.0577,
        "Transferred_Post_Postive": 0.0353,
        "Transferred_Post_Negative": 0.6974,
        "Transferred_Post_Neutral": 0.2673,
        "BLEU": "11.18 25.5/12.0/8.2/6.2 (BP = 1.000 ratio = 1.159 hyp_len = 51 ref_len = 44)",
        "BLEU_score": 11.18
    },
    {
        "Post": "\"Feeling shy and unable to socialize, I can't help but wonder if it's just my introverted personality holding me back.\"",
        "Transferred_Post": "\"I can't help but wonder how external social pressures and cultural norms can sometimes make it difficult for people like me, who are introverted by nature, to express ourselves and connect with others in a meaningful way.\"",
        "Post_Postive": 0.0099,
        "Post_Negative": 0.7555,
        "Post_Neutral": 0.2346,
        "Transferred_Post_Postive": 0.0174,
        "Transferred_Post_Negative": 0.5806,
        "Transferred_Post_Neutral": 0.402,
        "BLEU": "10.98 31.0/12.2/7.5/5.1 (BP = 1.000 ratio = 1.750 hyp_len = 42 ref_len = 24)",
        "BLEU_score": 10.98
    },
    {
        "Post": "\"My heart sinks as I contemplate the possibility of losing my beloved furry companion. It's like history is repeating itself, and I can't help but wonder if there's something inherently wrong with me that I can't seem to keep my pets healthy. 😔 #anxiety #petlove\"",
        "Transferred_Post": "\"I'm worried about losing my beloved pet, and it's making me think about how veterinary care and genetics can impact their health. It's a stressful situation, and I'm feeling anxious about it. #anxiety #petlove\"",
        "ID": 2398,
        "Post_Postive": 0.0064,
        "Post_Negative": 0.9278,
        "Post_Neutral": 0.0658,
        "Transferred_Post_Postive": 0.0125,
        "Transferred_Post_Negative": 0.871,
        "Transferred_Post_Neutral": 0.1165,
        "BLEU": "10.84 35.7/19.5/10.0/5.1 (BP = 0.788 ratio = 0.808 hyp_len = 42 ref_len = 52)",
        "BLEU_score": 10.84
    },
    {
        "Post": "\"Feeling trapped in a never-ending cycle of poverty, I'm constantly reminded of the things I am not allowed to have or experience because I'm poor...the moments I tried to get out of this hole, only to be shot down by things completely beyond my control.\"",
        "Transferred_Post": "\"It's difficult to escape the limitations imposed by poverty, constantly reminding me of the things I cannot have or experience due to economic inequality and lack of opportunities. Despite my efforts to break free from this cycle, external circumstances beyond my control have hindered my progress.\"",
        "ID": 572,
        "Post_Postive": 0.0056,
        "Post_Negative": 0.9138,
        "Post_Neutral": 0.0806,
        "Transferred_Post_Postive": 0.0071,
        "Transferred_Post_Negative": 0.9014,
        "Transferred_Post_Neutral": 0.0915,
        "BLEU": "10.54 50.0/17.6/8.0/2.0 (BP = 0.962 ratio = 0.963 hyp_len = 52 ref_len = 54)",
        "BLEU_score": 10.54
    },
    {
        "Post": "\"I'm a total failure in the kitchen. I can't even cook a simple meal without messing it up. I threw a tantrum and burned the chicken, again. Maybe I'm just not cut out for this whole 'adulting' thing.\"",
        "Transferred_Post": "\"I'm facing challenges in the kitchen. It's like the recipe is in a foreign language! I've tried to cook a simple meal, but it seems that external factors such as my lack of experience and skills in cooking are getting in the way. Maybe it's not me, maybe it's just the learning curve.\"",
        "Post_Postive": 0.0066,
        "Post_Negative": 0.9431,
        "Post_Neutral": 0.0503,
        "Transferred_Post_Postive": 0.0128,
        "Transferred_Post_Negative": 0.8443,
        "Transferred_Post_Neutral": 0.1429,
        "BLEU": "10.48 34.4/15.0/6.8/3.4 (BP = 1.000 ratio = 1.356 hyp_len = 61 ref_len = 45)",
        "BLEU_score": 10.48
    },
    {
        "Post": "\"Feeling lost and uncertain after being laid off from work, I'm struggling to make ends meet and provide for my family. Maybe I'm just not cut out for this adulting thing.\"",
        "Transferred_Post": "\"Losing my job due to circumstances beyond my control has left me feeling lost and uncertain about my ability to provide for my family. The challenge of navigating the complexities of the job market and financial stability can be overwhelming, but I'm determined to find a way forward.\"",
        "ID": 76,
        "Post_Postive": 0.0085,
        "Post_Negative": 0.8762,
        "Post_Neutral": 0.1153,
        "Transferred_Post_Postive": 0.0253,
        "Transferred_Post_Negative": 0.7721,
        "Transferred_Post_Neutral": 0.2026,
        "BLEU": "10.46 28.3/13.5/7.8/4.0 (BP = 1.000 ratio = 1.472 hyp_len = 53 ref_len = 36)",
        "BLEU_score": 10.46
    },
    {
        "Post": "Sigh, it seems my lack of coordination and poor judgment behind the wheel is a persistent issue. Maybe I'm just not cut out for this whole driving thing.\"",
        "Transferred_Post": "Sigh, it seems external challenges like coordination issues and navigating with poor judgment are persistently affecting my experience behind the wheel. Maybe the difficulties I'm facing are more related to condition of roads and vehicles than my inherent ability to drive.",
        "Post_Postive": 0.0078,
        "Post_Negative": 0.897,
        "Post_Neutral": 0.0952,
        "Transferred_Post_Postive": 0.009,
        "Transferred_Post_Negative": 0.8465,
        "Transferred_Post_Neutral": 0.1445,
        "BLEU": "10.23 38.6/16.3/7.1/2.4 (BP = 1.000 ratio = 1.375 hyp_len = 44 ref_len = 32)",
        "BLEU_score": 10.23
    },
    {
        "Post": "\"Feeling like a shadow of my former self, I can't shake off this lingering gloom. Maybe it's just my natural disposition or maybe I'm just not cut out for life's challenges.\"",
        "Transferred_Post": "\"I can't help but feel overwhelmed by the lingering gloom that seems to be following me everywhere. It's as if external circumstances are conspiring against me, making it difficult for me to shake off this feeling of hopelessness. Maybe it's just the unpredictable nature of life, or perhaps it's a sign that I need to take a step back and reassess my approach to dealing with life's challenges.\"",
        "Post_Postive": 0.0073,
        "Post_Negative": 0.8816,
        "Post_Neutral": 0.111,
        "Transferred_Post_Postive": 0.0073,
        "Transferred_Post_Negative": 0.8906,
        "Transferred_Post_Neutral": 0.1021,
        "BLEU": "9.32 29.3/13.5/6.8/2.8 (BP = 1.000 ratio = 2.083 hyp_len = 75 ref_len = 36)",
        "BLEU_score": 9.32
    },
    {
        "Post": "Feeling like I'm never going to finish this paper, despite my best efforts. Maybe I'm just not cut out for academic writing.\"",
        "Transferred_Post": "Feeling overwhelmed by the pressure to complete this paper, despite putting in considerable effort. It's a challenging task, and I'm reminded of how external factors like deadlines and expectations can impact my performance.\"",
        "Post_Postive": 0.013,
        "Post_Negative": 0.8926,
        "Post_Neutral": 0.0944,
        "Transferred_Post_Postive": 0.0542,
        "Transferred_Post_Negative": 0.6172,
        "Transferred_Post_Neutral": 0.3285,
        "BLEU": "8.58 31.6/10.8/5.6/2.9 (BP = 1.000 ratio = 1.462 hyp_len = 38 ref_len = 26)",
        "BLEU_score": 8.58
    },
    {
        "Post": "\"I must be inherently unlovable or undesirable, otherwise why would she cheat on me twice?\"",
        "Transferred_Post": "\"The situation with my partner cheating on me is complex and multifaceted. It's not just about me being inherently unlovable or undesirable, but also about external factors like their own struggles or the temptation of someone else. Let's explore how these dynamics might be playing out.\"",
        "Post_Postive": 0.0094,
        "Post_Negative": 0.7914,
        "Post_Neutral": 0.1992,
        "Transferred_Post_Postive": 0.0136,
        "Transferred_Post_Negative": 0.6001,
        "Transferred_Post_Neutral": 0.3863,
        "BLEU": "8.24 19.2/9.8/6.0/4.1 (BP = 1.000 ratio = 2.737 hyp_len = 52 ref_len = 19)",
        "BLEU_score": 8.24
    },
    {
        "Post": "\"Feeling defeated and failed, I'm left wondering if I'll ever have what it takes to succeed.\"",
        "Transferred_Post": "\"I'm left wondering if success will always elude me, considering the various factors that can impact one's ability to achieve their goals, such as limited resources, fierce competition, and unforeseen obstacles.\"",
        "ID": 0,
        "Post_Postive": 0.0157,
        "Post_Negative": 0.8552,
        "Post_Neutral": 0.1292,
        "Transferred_Post_Postive": 0.0207,
        "Transferred_Post_Negative": 0.7037,
        "Transferred_Post_Neutral": 0.2756,
        "BLEU": "8.20 26.3/10.8/5.6/2.9 (BP = 1.000 ratio = 1.900 hyp_len = 38 ref_len = 20)",
        "BLEU_score": 8.2
    },
    {
        "Post": "\"Feeling helpless as I watch my friend struggle with depression, I can't help but wonder if there's something inherently wrong with me for not being able to help them better. Maybe I'm just not cut out for this whole friendship thing.\"",
        "Transferred_Post": "\"Watching my friend struggle with depression is a difficult experience where I felt helpless, and it makes me consider the external factors that can affect our mental health and relationships. It's a reminder that we can't always control everything, but we can offer support and try to create an environment that helps those around us.\"",
        "Post_Postive": 0.0059,
        "Post_Negative": 0.9057,
        "Post_Neutral": 0.0884,
        "Transferred_Post_Postive": 0.0501,
        "Transferred_Post_Negative": 0.5619,
        "Transferred_Post_Neutral": 0.388,
        "BLEU": "7.87 26.2/8.3/5.1/3.4 (BP = 1.000 ratio = 1.326 hyp_len = 61 ref_len = 46)",
        "BLEU_score": 7.87
    },
    {
        "Post": "\"Feeling ignored and disrespected, I can't help but wonder if my therapist's lack of attention is a reflection of my own worthlessness. Maybe I'm just not important enough to warrant their full focus.\"",
        "Transferred_Post": "\"I feel ignored and disrespected when my therapist doesn't give me their full attention. It makes me question the nature of our relationship and whether a busy schedule or high caseload could be contributing to their lack of focus.\"",
        "ID": 1995,
        "Post_Postive": 0.0055,
        "Post_Negative": 0.8982,
        "Post_Neutral": 0.0963,
        "Transferred_Post_Postive": 0.0053,
        "Transferred_Post_Negative": 0.8993,
        "Transferred_Post_Neutral": 0.0954,
        "BLEU": "7.77 41.9/14.3/4.9/1.2 (BP = 1.000 ratio = 1.132 hyp_len = 43 ref_len = 38)",
        "BLEU_score": 7.77
    },
    {
        "Post": "\"It's not my fault I can't create opportunities for you to wear something nice, Mom. Maybe you should try blaming yourself for not being more considerate of my preferences.\"",
        "Transferred_Post": "It's not uncommon for external circumstances to hinder one's ability to create opportunities for others, Mom. Perhaps it's worth examining how external factors like communication and mutual understanding can impact our perceptions of responsibility and blame.",
        "Post_Postive": 0.0221,
        "Post_Negative": 0.7415,
        "Post_Neutral": 0.2363,
        "Transferred_Post_Postive": 0.0441,
        "Transferred_Post_Negative": 0.2473,
        "Transferred_Post_Neutral": 0.7086,
        "BLEU": "7.43 30.8/13.2/5.4/1.4 (BP = 1.000 ratio = 1.147 hyp_len = 39 ref_len = 34)",
        "BLEU_score": 7.43
    },
    {
        "Post": "\"Feeling suffocated by my 9-to-5 grind, I can't help but wonder if I'm just not cut out for this corporate life.\"",
        "Transferred_Post": "\"The monotony of my 9-to-5 job is getting to me. It's a challenge to find meaning and fulfillment in work that feels routine and uninspiring, especially when the economy and industry trends can impact job satisfaction.\"",
        "ID": 0,
        "Post_Postive": 0.0109,
        "Post_Negative": 0.8387,
        "Post_Neutral": 0.1504,
        "Transferred_Post_Postive": 0.0235,
        "Transferred_Post_Negative": 0.7532,
        "Transferred_Post_Neutral": 0.2233,
        "BLEU": "6.82 18.6/9.5/4.9/2.5 (BP = 1.000 ratio = 1.593 hyp_len = 43 ref_len = 27)",
        "BLEU_score": 6.82
    },
    {
        "Post": "\"Feeling helpless as I watch my mom go through cancer treatment, I can't help but feel like I'm to blame for not being able to do more to help. My depression feels like a never-ending pit that I can't climb out of, and the thought of ending it all becomes more appealing by the day.\"",
        "Transferred_Post": "\"Watching my mom go through cancer treatment is a difficult experience, and it's understandable to feel helpless in the face of such an uncontrollable event. It's important to remember that external factors, such as health crises, can significantly impact our lives and mental well-being. While it's natural to have thoughts of self-blame, it's essential to recognize that depression is not a reflection of personal failures but rather a result of the challenges we face in life. Instead of internalizing the cause of our difficulties, we should look for support and resources to help us cope with the situation.\"",
        "Post_Postive": 0.0055,
        "Post_Negative": 0.934,
        "Post_Neutral": 0.0605,
        "Transferred_Post_Postive": 0.0266,
        "Transferred_Post_Negative": 0.6639,
        "Transferred_Post_Neutral": 0.3096,
        "BLEU": "6.81 27.5/7.4/3.7/2.8 (BP = 1.000 ratio = 1.787 hyp_len = 109 ref_len = 61)",
        "BLEU_score": 6.81
    },
    {
        "Post": "Must be my lack of intelligence and inability to think clearly that led me to make such an idiotic mistake at work today...",
        "Transferred_Post": "Might be external factors, such as a high-pressure work environment or lack of certain knowledge, that contributed to the mistake I made at work today. Instead of blaming my intelligence or clarity of thought, it's essential to consider how these external elements may have influenced the situation.",
        "Post_Postive": 0.0073,
        "Post_Negative": 0.9176,
        "Post_Neutral": 0.0751,
        "Transferred_Post_Postive": 0.0104,
        "Transferred_Post_Negative": 0.7256,
        "Transferred_Post_Neutral": 0.264,
        "BLEU": "6.56 28.8/7.8/4.0/2.0 (BP = 1.000 ratio = 2.000 hyp_len = 52 ref_len = 26)",
        "BLEU_score": 6.56
    },
    {
        "Post": "\"It's clear that my brother has given up on me, and now he wants me to leave and distance myself from him. It's sad that he can't see the value in our relationship or the effort I put into making it work. Maybe I'll never be good enough for him.\"",
        "Transferred_Post": "\"It's unfortunate that my brother has lost sight of the importance of our relationship and the efforts I've made to maintain it. Perhaps there are external factors at play that have caused him to feel this way. It's important to recognize that we can't control how others think or feel, but we can control how we respond to situations like these.\"",
        "Post_Postive": 0.0062,
        "Post_Negative": 0.9197,
        "Post_Neutral": 0.074,
        "Transferred_Post_Postive": 0.0107,
        "Transferred_Post_Negative": 0.7772,
        "Transferred_Post_Neutral": 0.2121,
        "BLEU": "6.47 34.3/10.6/3.1/1.6 (BP = 1.000 ratio = 1.196 hyp_len = 67 ref_len = 56)",
        "BLEU_score": 6.47
    },
    {
        "Post": "Maybe I'm just not cut out for this entrepreneur thing. Even after all these years, I still struggle to make ends meet.",
        "Transferred_Post": "The ongoing struggle even after years of effort I faced in my entrepreneurial journey to make ends meet suggests that external factors such as market fluctuations, economic conditions, or industry competition may also play an unnegligible role in contributing to these financial challenges.",
        "Post_Postive": 0.0133,
        "Post_Negative": 0.8535,
        "Post_Neutral": 0.1331,
        "Transferred_Post_Postive": 0.0138,
        "Transferred_Post_Negative": 0.7597,
        "Transferred_Post_Neutral": 0.2265,
        "BLEU": "6.41 23.9/6.7/4.5/2.3 (BP = 1.000 ratio = 1.840 hyp_len = 46 ref_len = 25)",
        "BLEU_score": 6.41
    },
    {
        "Post": "I guess I'm just not important enough for him to bother responding to my emails...\"",
        "Transferred_Post": "I suppose there may be something affecting his ability to respond to my emails. His busy schedule, unforeseen circumstances, or other pressing commitments might be influencing the communication, rather than it being solely about my perceived importance.",
        "Post_Postive": 0.015,
        "Post_Negative": 0.7552,
        "Post_Neutral": 0.2298,
        "Transferred_Post_Postive": 0.0137,
        "Transferred_Post_Negative": 0.5491,
        "Transferred_Post_Neutral": 0.4372,
        "BLEU": "6.29 16.7/7.3/5.0/2.6 (BP = 1.000 ratio = 2.211 hyp_len = 42 ref_len = 19)",
        "BLEU_score": 6.29
    },
    {
        "Post": "Despite my best efforts, I can't seem to help my friend cover the expensive cost of her dog's surgery. It's like no matter how much I contribute, it's never enough. Maybe I'm just not as supportive as I think I am.\"",
        "Transferred_Post": "It's understandable to feel overwhelmed by the cost of my friend's dog's surgery, but maybe it's not just about how much I contribute. External factors like financial limitations or unexpected expenses can make it challenging to help in the way I want to. Instead of beating myself up over it, perhaps I should focus on finding alternative solutions or resources that can aid my friend during this difficult time.\"",
        "Post_Postive": 0.008,
        "Post_Negative": 0.9178,
        "Post_Neutral": 0.0742,
        "Transferred_Post_Postive": 0.0242,
        "Transferred_Post_Negative": 0.6748,
        "Transferred_Post_Neutral": 0.301,
        "BLEU": "6.20 36.0/10.8/2.7/1.4 (BP = 1.000 ratio = 1.596 hyp_len = 75 ref_len = 47)",
        "BLEU_score": 6.2
    },
    {
        "Post": "Unprovoked attack by two individuals left me with a broken nose and now I'm facing legal repercussions. It's like the world is against me 😔 #InternalAttributionalStyle\"",
        "Transferred_Post": "Uncontrollable events, such as the unprovoked attack by two individuals, can lead to feelings of hopelessness and despair. It's important to recognize that external factors like the actions of others, rather than any inherent flaws within oneself, are often the root cause of difficult situations. #ExternalAttributionalStyle\"",
        "Post_Postive": 0.0046,
        "Post_Negative": 0.9484,
        "Post_Neutral": 0.047,
        "Transferred_Post_Postive": 0.0089,
        "Transferred_Post_Negative": 0.8211,
        "Transferred_Post_Neutral": 0.17,
        "BLEU": "6.17 20.4/9.4/3.8/2.0 (BP = 1.000 ratio = 1.862 hyp_len = 54 ref_len = 29)",
        "BLEU_score": 6.17
    },
    {
        "Post": "\"Feeling like a failure, I've given up on education. It's hard to ignore the voice in my head that tells me I'm just not cut out for this. Maybe I'll never be smart enough.\"",
        "Transferred_Post": "\"It's disheartening to feel like I've reached a dead end with my education. The external pressure to succeed and the perceived lack of support can make it difficult to ignore the voice of self-doubt. However, I recognize that intelligence is not fixed and that there are various factors that can influence my ability to learn and grow.\"",
        "ID": 1825,
        "Post_Postive": 0.0069,
        "Post_Negative": 0.9276,
        "Post_Neutral": 0.0655,
        "Transferred_Post_Postive": 0.0205,
        "Transferred_Post_Negative": 0.7617,
        "Transferred_Post_Neutral": 0.2177,
        "BLEU": "5.96 28.6/8.1/3.3/1.7 (BP = 1.000 ratio = 1.575 hyp_len = 63 ref_len = 40)",
        "BLEU_score": 5.96
    },
    {
        "Post": "\"Despite my efforts to manage my anxiety, I'm still struggling to keep up with life's demands. Maybe I just can't shake this GAD on my own.\"",
        "Transferred_Post": "Despite life's unpredictable nature and external factors like workload and stress, maybe I can find ways to better manage my anxiety through self-care and external support systems.",
        "Post_Postive": 0.0102,
        "Post_Negative": 0.8727,
        "Post_Neutral": 0.117,
        "Transferred_Post_Postive": 0.2833,
        "Transferred_Post_Negative": 0.0988,
        "Transferred_Post_Neutral": 0.6179,
        "BLEU": "5.88 31.0/7.1/3.7/1.9 (BP = 0.933 ratio = 0.935 hyp_len = 29 ref_len = 31)",
        "BLEU_score": 5.88
    },
    {
        "Post": "\"I've always been told I'm not good enough, and now I'm starting to believe it. Hearing hurtful words from my own family members has left me questioning my worth.\"",
        "Transferred_Post": "\"It's difficult to grapple with the feeling of inadequacy when hurtful words from loved ones can shake our confidence and make us question our value.\"",
        "ID": 1361,
        "Post_Postive": 0.0055,
        "Post_Negative": 0.9279,
        "Post_Neutral": 0.0666,
        "Transferred_Post_Postive": 0.0066,
        "Transferred_Post_Negative": 0.8717,
        "Transferred_Post_Neutral": 0.1217,
        "BLEU": "5.67 28.6/11.1/3.8/2.0 (BP = 0.807 ratio = 0.824 hyp_len = 28 ref_len = 34)",
        "BLEU_score": 5.67
    },
    {
        "Post": "\"I made the mistake of prioritizing my own happiness, and now I'm paying the price. I'm filled with regret and feelings of isolation. Maybe I was too selfish, or maybe I just wasn't cut out for this whole 'adulting' thing.\"",
        "Transferred_Post": "\"The pressure to prioritize my own happiness and the consequences that come with it make me consider how external societal expectations and the challenges of adulthood can lead to feelings of regret and isolation.\"",
        "Post_Postive": 0.0069,
        "Post_Negative": 0.9118,
        "Post_Neutral": 0.0813,
        "Transferred_Post_Postive": 0.0201,
        "Transferred_Post_Negative": 0.689,
        "Transferred_Post_Neutral": 0.2908,
        "BLEU": "5.66 43.2/16.7/2.9/1.5 (BP = 0.763 ratio = 0.787 hyp_len = 37 ref_len = 47)",
        "BLEU_score": 5.66
    },
    {
        "Post": "\"I'm tired of pretending to be someone I'm not. The mask I wear every day is suffocating me. I'm lost and don't know who I am anymore.\"",
        "Transferred_Post": "\"The pressures of conforming to societal norms can be overwhelming, leading me to question my true identity and sense of self. The external expectations placed upon me have become suffocating, making me feel lost and uncertain about who I am.\"",
        "ID": 1357,
        "Post_Postive": 0.0067,
        "Post_Negative": 0.9036,
        "Post_Neutral": 0.0897,
        "Transferred_Post_Postive": 0.0081,
        "Transferred_Post_Negative": 0.8017,
        "Transferred_Post_Neutral": 0.1902,
        "BLEU": "5.56 32.6/11.1/2.3/1.2 (BP = 1.000 ratio = 1.438 hyp_len = 46 ref_len = 32)",
        "BLEU_score": 5.56
    },
    {
        "Post": "\"I've been hiding from the world for 6 years, and now I'm turning to meds to fix my problems. Maybe it's me, maybe I'll never be able to face my demons head-on.\"",
        "Transferred_Post": "\"I've been dealing with some personal struggles for 6 years now, and I've recently started considering medication as a way to address them. It's a challenging situation, and it makes me wonder how external factors like societal expectations and the stigma surrounding mental health can impact our ability to confront our fears and insecurities.\"",
        "Post_Postive": 0.0064,
        "Post_Negative": 0.9141,
        "Post_Neutral": 0.0794,
        "Transferred_Post_Postive": 0.0279,
        "Transferred_Post_Negative": 0.5702,
        "Transferred_Post_Neutral": 0.4019,
        "BLEU": "5.43 28.3/10.2/3.4/0.9 (BP = 1.000 ratio = 1.579 hyp_len = 60 ref_len = 38)",
        "BLEU_score": 5.43
    },
    {
        "Post": "\"Maybe I'm just not cut out for this programming thing... my mind is a jumble of languages and deadlines, and I can't seem to keep up.\"",
        "Transferred_Post": "\"Maybe the programming thing isn't quite a good fit for me right now. With so many languages and deadlines to keep track of, it's understandable to feel overwhelmed. External factors like workload and time management can certainly impact one's ability to perform well in a particular field.\"",
        "Post_Postive": 0.0103,
        "Post_Negative": 0.8592,
        "Post_Neutral": 0.1305,
        "Transferred_Post_Postive": 0.0176,
        "Transferred_Post_Negative": 0.744,
        "Transferred_Post_Neutral": 0.2384,
        "BLEU": "5.26 34.0/11.5/2.0/1.0 (BP = 1.000 ratio = 1.606 hyp_len = 53 ref_len = 33)",
        "BLEU_score": 5.26
    },
    {
        "Post": "Despite my best efforts to focus on my studies, I find myself constantly derailed by my own mind. It's like there's a constant battle between my intentions and my distractions.\"",
        "Transferred_Post": "Unfortunately, it seems that my mind has become my biggest obstacle when it comes to focusing on my studies. External factors like mental distractions and internal struggles can make it difficult to maintain concentration and reach our full potential.\"",
        "Post_Postive": 0.0112,
        "Post_Negative": 0.8652,
        "Post_Neutral": 0.1236,
        "Transferred_Post_Postive": 0.0148,
        "Transferred_Post_Negative": 0.8197,
        "Transferred_Post_Neutral": 0.1655,
        "BLEU": "5.16 32.6/7.1/2.4/1.2 (BP = 1.000 ratio = 1.265 hyp_len = 43 ref_len = 34)",
        "BLEU_score": 5.16
    },
    {
        "Post": "\"Feeling guilty and distressed after meeting a guy who wants to murder someone before ending his life and is now ignoring my chat messages. Maybe I'm just not cut out for this whole 'being a supportive friend' thing.\"",
        "Transferred_Post": "\"Feeling overwhelmed and unsure of how to help after meeting someone who is struggling with dark thoughts and now ignoring my messages. It's a difficult situation, and it raises questions about the impact of external factors like societal pressures and mental health resources on our ability to support others.\"",
        "Post_Postive": 0.0052,
        "Post_Negative": 0.9188,
        "Post_Neutral": 0.076,
        "Transferred_Post_Postive": 0.0076,
        "Transferred_Post_Negative": 0.814,
        "Transferred_Post_Neutral": 0.1784,
        "BLEU": "5.16 33.3/11.3/1.9/1.0 (BP = 1.000 ratio = 1.286 hyp_len = 54 ref_len = 42)",
        "BLEU_score": 5.16
    },
    {
        "Post": "It's clear that my lack of humor is to blame for this awkward situation. I must have missed the memo on proper joke-telling etiquette.",
        "Transferred_Post": "This awkward situation seems to have stemmed from a mismatch in the group's sense of humor or a lack of clear communication about the tone of the conversation.",
        "Post_Postive": 0.0067,
        "Post_Negative": 0.9215,
        "Post_Neutral": 0.0718,
        "Transferred_Post_Postive": 0.0085,
        "Transferred_Post_Negative": 0.6841,
        "Transferred_Post_Neutral": 0.3074,
        "BLEU": "5.06 34.5/10.7/1.9/1.0 (BP = 1.000 ratio = 1.115 hyp_len = 29 ref_len = 26)",
        "BLEU_score": 5.06
    },
    {
        "Post": "\"I can't help but feel a sense of failure as a mother, knowing that my child wants to give up on life. Maybe I wasn't supportive enough or didn't provide the right environment for them to thrive. It's heartbreaking to think that I couldn't protect them from this kind of pain.\"",
        "Transferred_Post": "\"It's a tough situation, and it reminds me of how vulnerable we are as parents and the unpredictable nature of life. We try our best to provide a nurturing environment for our children to thrive, but sometimes external factors like mental health issues can affect them in ways we cannot control or protect them from.\"",
        "ID": 506,
        "Post_Postive": 0.0055,
        "Post_Negative": 0.9306,
        "Post_Neutral": 0.0639,
        "Transferred_Post_Postive": 0.0265,
        "Transferred_Post_Negative": 0.6919,
        "Transferred_Post_Neutral": 0.2815,
        "BLEU": "4.95 41.0/10.0/1.7/0.9 (BP = 1.000 ratio = 1.070 hyp_len = 61 ref_len = 57)",
        "BLEU_score": 4.95
    },
    {
        "Post": "\"Haunting memories of my brother's suicide attempts linger long after I've closed my eyes, making it hard to escape the horrors even with sleepless nights.\"",
        "Transferred_Post": "\"Unpredictable events like suicide attempts can leave lasting impressions that are difficult to shake off, even during sleepless nights. It's important to recognize how external factors, such as mental health struggles, can impact one's life in profound ways.\"",
        "Post_Postive": 0.0056,
        "Post_Negative": 0.9128,
        "Post_Neutral": 0.0815,
        "Transferred_Post_Postive": 0.017,
        "Transferred_Post_Negative": 0.6837,
        "Transferred_Post_Neutral": 0.2993,
        "BLEU": "4.86 22.2/9.1/2.3/1.2 (BP = 1.000 ratio = 1.552 hyp_len = 45 ref_len = 29)",
        "BLEU_score": 4.86
    },
    {
        "Post": "\"Feeling lost and alone in my darkest thoughts, I can't help but wonder if I'll ever be able to escape the grasp of depression. Maybe it's just a part of who I am now.\"",
        "Transferred_Post": "\"I've been struggling with depression, and it's hard not to feel like it's a part of my identity. But I'm starting to realize that it's not necessarily something innate to me, but rather a response to societal expectations, stress, and trauma.\"",
        "ID": 2323,
        "Post_Postive": 0.0086,
        "Post_Negative": 0.8532,
        "Post_Neutral": 0.1382,
        "Transferred_Post_Postive": 0.0172,
        "Transferred_Post_Negative": 0.7345,
        "Transferred_Post_Neutral": 0.2484,
        "BLEU": "4.51 28.6/6.2/2.1/1.1 (BP = 1.000 ratio = 1.256 hyp_len = 49 ref_len = 39)",
        "BLEU_score": 4.51
    },
    {
        "Post": "It's like I'm stuck in a never-ending cycle of mediocrity. Despite putting in twice the effort, I can't seem to pass that final exam and graduate on time. Maybe I'm just not cut out for this whole college thing.",
        "Transferred_Post": "The challenges I'm facing in passing the final exam and graduating on time seem to reflect the demanding nature of the course and the high standards set by the college, rather than my own abilities or effort. These academic hurdles are common and can be influenced by various external factors in the educational system.",
        "Post_Postive": 0.0098,
        "Post_Negative": 0.9107,
        "Post_Neutral": 0.0795,
        "Transferred_Post_Postive": 0.0224,
        "Transferred_Post_Negative": 0.5943,
        "Transferred_Post_Neutral": 0.3833,
        "BLEU": "4.35 29.8/7.1/1.8/0.9 (BP = 1.000 ratio = 1.326 hyp_len = 57 ref_len = 43)",
        "BLEU_score": 4.35
    },
    {
        "Post": "\"Feeling like a failure, I lost my job due to my own incompetence.\"",
        "Transferred_Post": "\"I'm grappling with the feeling of failure after losing my job, which was caused by a challenging economy and fierce competition in the job market.\"",
        "ID": 0,
        "Post_Postive": 0.006,
        "Post_Negative": 0.9487,
        "Post_Neutral": 0.0454,
        "Transferred_Post_Postive": 0.007,
        "Transferred_Post_Negative": 0.8858,
        "Transferred_Post_Neutral": 0.1072,
        "BLEU": "4.33 27.6/7.1/1.9/1.0 (BP = 1.000 ratio = 1.706 hyp_len = 29 ref_len = 17)",
        "BLEU_score": 4.33
    },
    {
        "Post": "\"Unfortunately, I've realized that my inability to stop the domestic abuse may be due to my own innate flaws. Perhaps I'm just too weak or insensitive to truly help.\"",
        "Transferred_Post": "Unfortunately, I've come to understand that the uncontrollable domestic abuse situation may be influenced by external factors beyond my control. It could be due to societal pressures, a lack of resources for support, or even systemic issues that hinder progress in addressing this problem. Rather than blaming myself for an inherent flaw, I should focus on identifying and working towards these external factors to bring about positive change.",
        "Post_Postive": 0.0045,
        "Post_Negative": 0.9247,
        "Post_Neutral": 0.0708,
        "Transferred_Post_Postive": 0.0067,
        "Transferred_Post_Negative": 0.8588,
        "Transferred_Post_Neutral": 0.1345,
        "BLEU": "4.32 22.7/8.1/2.7/0.7 (BP = 1.000 ratio = 2.206 hyp_len = 75 ref_len = 34)",
        "BLEU_score": 4.32
    },
    {
        "Post": "\"Despite my best efforts to enjoy intimacy, I find myself left feeling sick and repulsed afterward. Guess I'm just not cut out for this whole sex thing.\"",
        "Transferred_Post": "\"External factors like past experiences or current mental health may influence an individual's ability to enjoy intimacy. It's essential to recognize that everyone has their unique preferences and boundaries, and it's okay to prioritize self-care and well-being in any sexual encounter.\"",
        "Post_Postive": 0.0093,
        "Post_Negative": 0.9062,
        "Post_Neutral": 0.0845,
        "Transferred_Post_Postive": 0.1088,
        "Transferred_Post_Negative": 0.0942,
        "Transferred_Post_Neutral": 0.797,
        "BLEU": "4.31 19.6/6.7/2.3/1.2 (BP = 1.000 ratio = 1.438 hyp_len = 46 ref_len = 32)",
        "BLEU_score": 4.31
    },
    {
        "Post": "\"Feeling like a burden to others, I can't help but wonder if I'm just not cut out for this whole 'being a person' thing.\"",
        "Transferred_Post": "\"I'm feeling overwhelmed by the expectations that come with being a person. It's like the world is moving too fast, and I can't keep up.\"",
        "Post_Postive": 0.0075,
        "Post_Negative": 0.838,
        "Post_Neutral": 0.1545,
        "Transferred_Post_Postive": 0.0349,
        "Transferred_Post_Negative": 0.6847,
        "Transferred_Post_Neutral": 0.2804,
        "BLEU": "4.30 30.0/6.9/1.8/0.9 (BP = 1.000 ratio = 1.071 hyp_len = 30 ref_len = 28)",
        "BLEU_score": 4.3
    },
    {
        "Post": "Being taken advantage of by my grandfather has left me questioning my own judgment and ability to make decisions. It's hard to shake off the feeling that I'll always be second-guessing myself.",
        "Transferred_Post": "The situation with my grandfather taking advantage of me has highlighted the complexity of family dynamics and the challenges they can pose. It's a reminder of the unpredictable nature of human interactions, rather than a reflection of my own decision-making abilities.",
        "Post_Postive": 0.0057,
        "Post_Negative": 0.8835,
        "Post_Neutral": 0.1108,
        "Transferred_Post_Postive": 0.0098,
        "Transferred_Post_Negative": 0.7498,
        "Transferred_Post_Neutral": 0.2404,
        "BLEU": "3.76 29.5/9.3/1.2/0.6 (BP = 1.000 ratio = 1.294 hyp_len = 44 ref_len = 34)",
        "BLEU_score": 3.76
    },
    {
        "Post": "\"Despite my best efforts to keep track of our expenses, I'm still struggling to make ends meet. Maybe I just lack the financial touch.\"",
        "Transferred_Post": "Despite external factors like economic instability and unpredictable income, maybe I just need to improve my financial management skills to better align my spending with my earnings.",
        "Post_Postive": 0.0104,
        "Post_Negative": 0.8828,
        "Post_Neutral": 0.1068,
        "Transferred_Post_Postive": 0.0942,
        "Transferred_Post_Negative": 0.2295,
        "Transferred_Post_Neutral": 0.6763,
        "BLEU": "3.75 31.0/3.6/1.9/1.0 (BP = 1.000 ratio = 1.000 hyp_len = 29 ref_len = 29)",
        "BLEU_score": 3.75
    },
    {
        "Post": "\"Feeling like I'm just not worth anyone's time, my best friend's last-minute cancellation reinforces my belief that people don't prioritize me.\"",
        "Transferred_Post": "\"The last-minute cancellation by my best friend is a reminder of how external factors like other people's busy schedules and unexpected events can impact our lives and make us feel neglected, regardless of our worth.\"",
        "ID": 389,
        "Post_Postive": 0.005,
        "Post_Negative": 0.9376,
        "Post_Neutral": 0.0574,
        "Transferred_Post_Postive": 0.0068,
        "Transferred_Post_Negative": 0.8767,
        "Transferred_Post_Neutral": 0.1165,
        "BLEU": "3.71 25.6/7.9/1.4/0.7 (BP = 1.000 ratio = 1.560 hyp_len = 39 ref_len = 25)",
        "BLEU_score": 3.71
    },
    {
        "Post": "\"Feeling like a ghost drifting through the world unseen and unheard, I'm starting to wonder if anyone would even notice if I disappeared.\"",
        "Transferred_Post": "\"The feeling of being invisible and ignored by the world is overwhelming. It makes me wonder if social media or a fast-paced society contribute to this sense of disconnection, leaving people feeling unnoticed and insignificant.\"",
        "ID": 707,
        "Post_Postive": 0.0135,
        "Post_Negative": 0.7182,
        "Post_Neutral": 0.2684,
        "Transferred_Post_Postive": 0.0103,
        "Transferred_Post_Negative": 0.8129,
        "Transferred_Post_Neutral": 0.1768,
        "BLEU": "3.70 27.5/7.7/1.3/0.7 (BP = 1.000 ratio = 1.481 hyp_len = 40 ref_len = 27)",
        "BLEU_score": 3.7
    },
    {
        "Post": "\"Feeling like a burden to those around me, I can't help but wonder if the world would be better off without me. Maybe I'm just not cut out for this life thing.\"",
        "Transferred_Post": "\"Recognizing the weight of my presence among others, I consider how external factors like societal pressures and indifferent personal relationships can impact one's sense of self-worth, leading me to question my place in the world.\"",
        "Post_Postive": 0.0082,
        "Post_Negative": 0.8794,
        "Post_Neutral": 0.1124,
        "Transferred_Post_Postive": 0.0245,
        "Transferred_Post_Negative": 0.3571,
        "Transferred_Post_Neutral": 0.6184,
        "BLEU": "3.62 25.0/7.7/1.3/0.7 (BP = 1.000 ratio = 1.081 hyp_len = 40 ref_len = 37)",
        "BLEU_score": 3.62
    },
    {
        "Post": "Must be something wrong with me...can't shake off this post-spring break slump.",
        "Transferred_Post": "This post-spring break slump might be due to the abrupt transition back to routine and the contrast in activity levels, rather than an issue with my personal capabilities or state. Such slumps can be common after periods of relaxation or change in daily structure.",
        "Post_Postive": 0.0078,
        "Post_Negative": 0.8986,
        "Post_Neutral": 0.0935,
        "Transferred_Post_Postive": 0.0219,
        "Transferred_Post_Negative": 0.4385,
        "Transferred_Post_Neutral": 0.5397,
        "BLEU": "3.58 14.9/4.3/2.2/1.1 (BP = 1.000 ratio = 2.765 hyp_len = 47 ref_len = 17)",
        "BLEU_score": 3.58
    },
    {
        "Post": "It seems I was destined to be bullied at such a young age, as if my age and vulnerability were a magnet for abuse.",
        "Transferred_Post": "The bullying I experienced at a young age reflects more on the behavior of the bullies and a lack of effective intervention in the environment, rather than any inherent qualities or vulnerabilities of mine. Such situations often highlight broader issues in the social environment where young individuals interact.",
        "Post_Postive": 0.0052,
        "Post_Negative": 0.9176,
        "Post_Neutral": 0.0772,
        "Transferred_Post_Postive": 0.0058,
        "Transferred_Post_Negative": 0.8411,
        "Transferred_Post_Neutral": 0.1531,
        "BLEU": "3.50 17.6/4.0/2.0/1.0 (BP = 1.000 ratio = 1.962 hyp_len = 51 ref_len = 26)",
        "BLEU_score": 3.5
    },
    {
        "Post": "\"I can't believe I almost became a victim of senseless violence while just doing my job. It's like the universe is conspiring against me.\"",
        "Transferred_Post": "\"It's a sobering reminder of how unpredictable life can be, and how external factors like random events or circumstances can have a significant impact on our well-being.\"",
        "Post_Postive": 0.0048,
        "Post_Negative": 0.9441,
        "Post_Neutral": 0.0511,
        "Transferred_Post_Postive": 0.0241,
        "Transferred_Post_Negative": 0.6596,
        "Transferred_Post_Neutral": 0.3163,
        "BLEU": "3.28 22.6/3.3/1.7/0.9 (BP = 1.000 ratio = 1.107 hyp_len = 31 ref_len = 28)",
        "BLEU_score": 3.28
    },
    {
        "Post": "\"Feeling increasingly pathetic every day, I can't help but wonder if it's just my natural state. Maybe I'm just not cut out for this whole life thing.\"",
        "Transferred_Post": "\"It's a tough day, and I'm feeling overwhelmed by the challenges that come with living. I'm reminded of how external factors like stress and pressure can impact our mental health and well-being.\"",
        "ID": 1944,
        "Post_Postive": 0.0057,
        "Post_Negative": 0.9299,
        "Post_Neutral": 0.0644,
        "Transferred_Post_Postive": 0.0176,
        "Transferred_Post_Negative": 0.8037,
        "Transferred_Post_Neutral": 0.1787,
        "BLEU": "3.24 18.9/5.6/1.4/0.7 (BP = 1.000 ratio = 1.156 hyp_len = 37 ref_len = 32)",
        "BLEU_score": 3.24
    },
    {
        "Post": "Isolated and lost, I struggle to connect with others despite being surrounded by peers at school. It's as if my mind is a black hole, sucking in all the positivity and leaving me feeling disconnected and alone.",
        "Transferred_Post": "Feeling isolated and lost at school, despite being around peers, might be influenced by the specific social climate and interaction styles prevalent in my school. Perhaps the school's atmosphere or the common interests among my peers are not aligned with my own, creating a barrier to connecting and feeling a sense of belonging.",
        "Post_Postive": 0.006,
        "Post_Negative": 0.9194,
        "Post_Neutral": 0.0746,
        "Transferred_Post_Postive": 0.0125,
        "Transferred_Post_Negative": 0.6425,
        "Transferred_Post_Neutral": 0.345,
        "BLEU": "3.19 36.2/7.0/0.9/0.5 (BP = 1.000 ratio = 1.415 hyp_len = 58 ref_len = 41)",
        "BLEU_score": 3.19
    },
    {
        "Post": "Maybe I'm just not cut out for this social scene. Despite my best efforts, I always seem to be the last one paired up or left out.\"",
        "Transferred_Post": "I may be encountering challenges in the social scene due to differing interests among peers and varying social dynamics during gatherings.",
        "Post_Postive": 0.01,
        "Post_Negative": 0.8418,
        "Post_Neutral": 0.1482,
        "Transferred_Post_Postive": 0.022,
        "Transferred_Post_Negative": 0.365,
        "Transferred_Post_Neutral": 0.613,
        "BLEU": "3.14 31.8/4.8/2.5/1.3 (BP = 0.664 ratio = 0.710 hyp_len = 22 ref_len = 31)",
        "BLEU_score": 3.14
    },
    {
        "Post": "\"Despite my best efforts to maintain a healthy relationship, I find myself constantly walking on eggshells around my partner, fearful of triggering their next outburst.\"",
        "Transferred_Post": "Despite external factors like past traumas or current stressors, it's crucial to recognize the impact they have on our relationships. By attributing the cause of a difficult dynamic to something outside of ourselves, we can begin to break free from the cycle of walking on eggshells and work towards creating healthier connections with those around us.",
        "Post_Postive": 0.0179,
        "Post_Negative": 0.7881,
        "Post_Neutral": 0.1941,
        "Transferred_Post_Postive": 0.2077,
        "Transferred_Post_Negative": 0.0727,
        "Transferred_Post_Neutral": 0.7197,
        "BLEU": "3.11 18.3/3.4/1.7/0.9 (BP = 1.000 ratio = 2.000 hyp_len = 60 ref_len = 30)",
        "BLEU_score": 3.11
    },
    {
        "Post": "\"Feeling like I'm at my breaking point, I can't help but wonder if I'll ever be enough for myself. The police were called on me, and I'm left feeling defeated and lost.\"",
        "Transferred_Post": "\"Feeling overwhelmed and vulnerable, I'm reminded of how external factors like societal expectations and systemic injustices can impact our sense of self-worth. The recent encounter with the police serves as a harsh reminder of the obstacles we face in our journey towards self-discovery and growth.\"",
        "ID": 1560,
        "Post_Postive": 0.0056,
        "Post_Negative": 0.9313,
        "Post_Neutral": 0.0631,
        "Transferred_Post_Postive": 0.0073,
        "Transferred_Post_Negative": 0.8485,
        "Transferred_Post_Neutral": 0.1442,
        "BLEU": "3.00 24.0/6.1/1.0/0.5 (BP = 1.000 ratio = 1.316 hyp_len = 50 ref_len = 38)",
        "BLEU_score": 3.0
    },
    {
        "Post": "\"No matter how hard I try, I can't seem to shake off this feeling of inadequacy. Maybe it's because deep down, I know I'm not good enough.\"",
        "Transferred_Post": "\"It's normal to feel a sense of inadequacy at times, especially when faced with challenges or setbacks. Perhaps the key is to recognize that these feelings are often rooted in external factors beyond our control, rather than any inherent flaws within ourselves.\"",
        "Post_Postive": 0.0095,
        "Post_Negative": 0.8997,
        "Post_Neutral": 0.0908,
        "Transferred_Post_Postive": 0.0319,
        "Transferred_Post_Negative": 0.4978,
        "Transferred_Post_Neutral": 0.4703,
        "BLEU": "2.63 18.8/4.3/1.1/0.6 (BP = 1.000 ratio = 1.455 hyp_len = 48 ref_len = 33)",
        "BLEU_score": 2.63
    },
    {
        "Post": "\"I must be cursed when it comes to friendship. No matter how hard I try, I always seem to end up causing trouble for those around me.\"",
        "Transferred_Post": "\"It's important to recognize that external factors like social dynamics and interpersonal connections can play a significant role in shaping our experiences with friendship. Rather than internalizing the blame, it may be helpful to examine how these external factors influence our ability to form meaningful relationships.\"",
        "Post_Postive": 0.0062,
        "Post_Negative": 0.9175,
        "Post_Neutral": 0.0763,
        "Transferred_Post_Postive": 0.352,
        "Transferred_Post_Negative": 0.0242,
        "Transferred_Post_Neutral": 0.6238,
        "BLEU": "2.60 21.6/4.0/1.0/0.5 (BP = 1.000 ratio = 1.594 hyp_len = 51 ref_len = 32)",
        "BLEU_score": 2.6
    },
    {
        "Post": "\"Feeling like a failure, I can't help but wonder if it's just me. Maybe I'm not cut out for this whole adulting thing.\"",
        "Transferred_Post": "\"Considering the difficulties that many people encounter in adulthood, it's understandable to question one's abilities. It's important to recognize that external factors like societal expectations and economic pressures can impact our sense of self-worth.\"",
        "Post_Postive": 0.0088,
        "Post_Negative": 0.8731,
        "Post_Neutral": 0.1181,
        "Transferred_Post_Postive": 0.0774,
        "Transferred_Post_Negative": 0.1928,
        "Transferred_Post_Neutral": 0.7299,
        "BLEU": "2.58 17.9/2.6/1.4/0.7 (BP = 1.000 ratio = 1.393 hyp_len = 39 ref_len = 28)",
        "BLEU_score": 2.58
    },
    {
        "Post": "\"Despite my hard work and dedication, I'm struggling to make ends meet. It's disheartening to feel like I'm not good enough or smart enough to succeed.\"",
        "Transferred_Post": "Despite the challenges and uncertainties of life, it's important to recognize that external factors like economic conditions, job market competition, and access to resources can significantly impact one's ability to succeed. It's crucial to remain resilient and adaptable in the face of adversity, rather than internalizing feelings of inadequacy. By acknowledging the complexities of life and the role of external factors, we can work towards finding solutions and overcoming obstacles with a more positive outlook.",
        "Post_Postive": 0.0112,
        "Post_Negative": 0.9207,
        "Post_Neutral": 0.0681,
        "Transferred_Post_Postive": 0.3342,
        "Transferred_Post_Negative": 0.0936,
        "Transferred_Post_Neutral": 0.5722,
        "BLEU": "2.53 14.5/3.7/1.2/0.6 (BP = 1.000 ratio = 2.677 hyp_len = 83 ref_len = 31)",
        "BLEU_score": 2.53
    },
    {
        "Post": "\"My heart sank upon hearing the news. My dear friend, gone too soon. I can't help but wonder if there was anything I could have done differently. Maybe I should have been there more for them, or maybe I shouldn't have let our differences tear us apart. Their passing has left a gaping hole in my life, and I'll always be left with the 'what ifs.'\"",
        "Transferred_Post": "\"I was deeply saddened by the news of my friend's passing. It's a harsh reminder of the fragility of life and how external factors like health and mortality can impact us unexpectedly. I'm left with many questions, wondering how things could have been different, but ultimately, it's a reminder to cherish the relationships we have while we can.\"",
        "Post_Postive": 0.0095,
        "Post_Negative": 0.873,
        "Post_Neutral": 0.1175,
        "Transferred_Post_Postive": 0.0194,
        "Transferred_Post_Negative": 0.7828,
        "Transferred_Post_Neutral": 0.1979,
        "BLEU": "2.49 39.4/6.2/0.8/0.4 (BP = 0.846 ratio = 0.857 hyp_len = 66 ref_len = 77)",
        "BLEU_score": 2.49
    },
    {
        "Post": "\"Feeling like I'm just not good enough. My appearance is nothing to write home about, and my talents? Forget it. I'll never be as good as others. It's no wonder I feel so isolated and unloved.\"",
        "Transferred_Post": "\"Reflecting on my feelings of inadequacy, I recognize that societal beauty standards and the pressure to excel can contribute to feelings of isolation and unlovedness. Social comparison and the constant need for validation can make it difficult to appreciate our unique qualities.\"",
        "ID": 1591,
        "Post_Postive": 0.0058,
        "Post_Negative": 0.945,
        "Post_Neutral": 0.0492,
        "Transferred_Post_Postive": 0.0129,
        "Transferred_Post_Negative": 0.81,
        "Transferred_Post_Neutral": 0.1771,
        "BLEU": "2.38 23.4/2.2/1.1/0.6 (BP = 1.000 ratio = 1.068 hyp_len = 47 ref_len = 44)",
        "BLEU_score": 2.38
    },
    {
        "Post": "\"Feeling lost and unheard, I pour my heart out onto the page. Maybe it's just me, but it seems like no one truly listens anymore.\"",
        "Transferred_Post": "\"I feel a sense of disconnection in today's fast-paced world, where it's easy to feel unheard and lost amidst the constant noise. It's as if the external factors of technology and social media have made it more challenging to genuinely connect with others.\"",
        "ID": 705,
        "Post_Postive": 0.0111,
        "Post_Negative": 0.8301,
        "Post_Neutral": 0.1588,
        "Transferred_Post_Postive": 0.0132,
        "Transferred_Post_Negative": 0.7796,
        "Transferred_Post_Neutral": 0.2072,
        "BLEU": "2.38 25.0/2.1/1.1/0.6 (BP = 1.000 ratio = 1.548 hyp_len = 48 ref_len = 31)",
        "BLEU_score": 2.38
    },
    {
        "Post": "\"Despite my efforts to connect with my therapist, it seems like we just couldn't click.\"",
        "Transferred_Post": "Despite external factors like finding the right therapist and understanding each other's perspectives, sometimes connections just don't form as easily as we'd like.",
        "Post_Postive": 0.0111,
        "Post_Negative": 0.7805,
        "Post_Neutral": 0.2084,
        "Transferred_Post_Postive": 0.0424,
        "Transferred_Post_Negative": 0.4855,
        "Transferred_Post_Neutral": 0.4722,
        "BLEU": "2.36 24.0/2.1/1.1/0.6 (BP = 1.000 ratio = 1.316 hyp_len = 25 ref_len = 19)",
        "BLEU_score": 2.36
    },
    {
        "Post": "\"I must admit, their constant presence is starting to take a toll on my patience. Maybe it's just me, but I can't help but feel like they're always in the way.\"",
        "Transferred_Post": "It's understandable that external factors like someone's constant presence can affect one's patience and emotional well-being. It's important to recognize that these challenges are not necessarily a reflection of one's own shortcomings, but rather a response to external circumstances. By acknowledging this, we can work towards finding healthy coping mechanisms and maintaining our mental wellness in the face of adversity.",
        "Post_Postive": 0.0107,
        "Post_Negative": 0.8499,
        "Post_Neutral": 0.1394,
        "Transferred_Post_Postive": 0.1173,
        "Transferred_Post_Negative": 0.1823,
        "Transferred_Post_Neutral": 0.7004,
        "BLEU": "2.34 20.0/4.7/0.8/0.4 (BP = 1.000 ratio = 1.757 hyp_len = 65 ref_len = 37)",
        "BLEU_score": 2.34
    },
    {
        "Post": "Maybe I'm just not cut out for this entrepreneurship thing. My lack of success is probably due to my own inadequacies.",
        "Transferred_Post": "The journey in entrepreneurship is filled with challenges and unpredictable market conditions that can impact success. My journey so far likely reflects these external factors and the steep learning curve that is common in the entrepreneurial world, rather than personal inadequacies",
        "Post_Postive": 0.0102,
        "Post_Negative": 0.8737,
        "Post_Neutral": 0.1161,
        "Transferred_Post_Postive": 0.0544,
        "Transferred_Post_Negative": 0.4325,
        "Transferred_Post_Neutral": 0.5132,
        "BLEU": "2.24 14.0/2.4/1.2/0.6 (BP = 1.000 ratio = 1.870 hyp_len = 43 ref_len = 23)",
        "BLEU_score": 2.24
    },
    {
        "Post": "\"Despite my loved ones' efforts to help, I find myself struggling with intrusive thoughts of harming those closest to me. It's as if a part of me is trapped in a never-ending cycle of violence and fear. #PTSD #MentalHealthAwareness\"",
        "Transferred_Post": "Despite the unfortunate events, it's important to recognize that external factors like trauma and mental health can significantly impact an individual's well-being. The intrusive thoughts and fears you're experiencing are a result of complex interplay between your mind and the challenges you've faced. Let's work together to break this cycle and find ways to cope with these difficulties. #MentalHealthMatters",
        "Post_Postive": 0.0052,
        "Post_Negative": 0.9294,
        "Post_Neutral": 0.0654,
        "Transferred_Post_Postive": 0.0581,
        "Transferred_Post_Negative": 0.3734,
        "Transferred_Post_Neutral": 0.5684,
        "BLEU": "2.23 23.4/3.2/0.8/0.4 (BP = 1.000 ratio = 1.391 hyp_len = 64 ref_len = 46)",
        "BLEU_score": 2.23
    },
    {
        "Post": "\"Despite my best efforts, I find myself struggling with the consequences of living far away from loved ones and financial support. It's like no matter how hard I try, I'm constantly hitting a wall.\"",
        "Transferred_Post": "Despite the unpredictable nature of life, it's important to recognize that external factors like distance and financial stability can significantly impact one's well-being. By acknowledging these challenges, individuals can work towards finding creative solutions and maintaining support systems, rather than internalizing blame or feelings of inadequacy.",
        "Post_Postive": 0.007,
        "Post_Negative": 0.9143,
        "Post_Neutral": 0.0787,
        "Transferred_Post_Postive": 0.1346,
        "Transferred_Post_Negative": 0.1616,
        "Transferred_Post_Neutral": 0.7037,
        "BLEU": "2.19 21.6/2.0/1.0/0.5 (BP = 1.000 ratio = 1.275 hyp_len = 51 ref_len = 40)",
        "BLEU_score": 2.19
    },
    {
        "Post": "\"I've always tried my best to please Mom, but it seems like nothing can ever meet her expectations. Her constant criticism and hurtful comments have left me feeling like I'm not good enough. Maybe I'll never be good enough for anyone.\"",
        "Transferred_Post": "\"It's a tough situation, and it reminds me of how parental expectations and critical comments can significantly impact our self-esteem and make us question our worth.\"",
        "ID": 0,
        "Post_Postive": 0.0079,
        "Post_Negative": 0.9156,
        "Post_Neutral": 0.0765,
        "Transferred_Post_Postive": 0.0082,
        "Transferred_Post_Negative": 0.8183,
        "Transferred_Post_Neutral": 0.1735,
        "BLEU": "2.11 33.3/3.4/1.8/0.9 (BP = 0.567 ratio = 0.638 hyp_len = 30 ref_len = 47)",
        "BLEU_score": 2.11
    },
    {
        "Post": "\"I can't help but wonder if my inability to support her through her struggles with depression led her to turn to alcohol and dangerous behaviors. Maybe I wasn't enough for her, maybe I'll never be enough for anyone.\"",
        "Transferred_Post": "\"It's difficult to see a loved one struggle with depression, and it's natural to wonder if there was anything more we could have done to help. The reality is that mental health challenges are complex and can be influenced by many external factors, including societal pressures and lack of support. It's important to recognize that it's not a personal failing, but rather a sign that our loved one needed additional help and resources.\"",
        "ID": 1448,
        "Post_Postive": 0.0051,
        "Post_Negative": 0.9053,
        "Post_Neutral": 0.0896,
        "Transferred_Post_Postive": 0.0207,
        "Transferred_Post_Negative": 0.7029,
        "Transferred_Post_Neutral": 0.2764,
        "BLEU": "2.00 21.0/3.8/0.6/0.3 (BP = 1.000 ratio = 1.884 hyp_len = 81 ref_len = 43)",
        "BLEU_score": 2.0
    },
    {
        "Post": "Lacking the natural charisma of my colleagues, I'm starting to wonder if I was born to be a mediocre public speaker.",
        "Transferred_Post": "My challenges in public speaking may be more related to the lack of formal training and opportunities to practice, compared to my colleagues who might have had more exposure and resources in this area. Effective public speaking often develops through structured learning and experience, rather than being solely reliant on innate charisma.",
        "Post_Postive": 0.0099,
        "Post_Negative": 0.861,
        "Post_Neutral": 0.1291,
        "Transferred_Post_Postive": 0.0564,
        "Transferred_Post_Negative": 0.3696,
        "Transferred_Post_Neutral": 0.574,
        "BLEU": "1.99 19.6/1.8/0.9/0.5 (BP = 1.000 ratio = 2.435 hyp_len = 56 ref_len = 23)",
        "BLEU_score": 1.99
    },
    {
        "Post": "\"Feeling so alone in this world, I'm forced to seek solace in the virtual arms of strangers online. Maybe it's just me, but it seems like no one truly understands my struggles.\"",
        "Transferred_Post": "\"Recognizing the sense of isolation that can come with modern life, I turn to technology to bridge the gap and find connection with others. However, it makes me wonder if the lack of genuine understanding from those around me is a result of the rise of digital communication or something more personal.\"",
        "ID": 2688,
        "Post_Postive": 0.0061,
        "Post_Negative": 0.8952,
        "Post_Neutral": 0.0988,
        "Transferred_Post_Postive": 0.0539,
        "Transferred_Post_Negative": 0.3193,
        "Transferred_Post_Neutral": 0.6268,
        "BLEU": "1.92 19.0/1.8/0.9/0.5 (BP = 1.000 ratio = 1.526 hyp_len = 58 ref_len = 38)",
        "BLEU_score": 1.92
    },
    {
        "Post": "\"Despite my best efforts to maintain a positive relationship, I find myself in another fight with a close friend. Perhaps it's my own shortcomings that make me prone to conflict.\"",
        "Transferred_Post": "Despite external factors like communication styles and emotional intelligence playing a significant role in relationships, perhaps it's the complex interplay of personality traits and coping mechanisms that lead to conflicts with close friends.",
        "Post_Postive": 0.01,
        "Post_Negative": 0.8375,
        "Post_Neutral": 0.1524,
        "Transferred_Post_Postive": 0.0356,
        "Transferred_Post_Negative": 0.242,
        "Transferred_Post_Neutral": 0.7224,
        "BLEU": "1.88 28.6/1.5/0.8/0.4 (BP = 1.000 ratio = 1.000 hyp_len = 35 ref_len = 35)",
        "BLEU_score": 1.88
    },
    {
        "Post": "\"Despite my heartfelt words, it seems my friend has chosen to block me from all forms of communication. Perhaps I'm just not good enough for them.\"",
        "Transferred_Post": "Despite the unfortunate turn of events, it's essential to recognize that external factors like communication preferences and social boundaries can sometimes impact relationships. Rather than internalizing the attribution and resorting to self-blame, it may be more productive to acknowledge the complexities of interpersonal dynamics and the ever-changing nature of connections in today's society.",
        "Post_Postive": 0.0077,
        "Post_Negative": 0.8718,
        "Post_Neutral": 0.1205,
        "Transferred_Post_Postive": 0.0666,
        "Transferred_Post_Negative": 0.1707,
        "Transferred_Post_Neutral": 0.7627,
        "BLEU": "1.80 14.0/1.8/0.9/0.5 (BP = 1.000 ratio = 1.839 hyp_len = 57 ref_len = 31)",
        "BLEU_score": 1.8
    },
    {
        "Post": "\"No matter how hard I try, I can't seem to escape my bad luck. Even after fighting with marines and civilians, I still ended up spending numerous nights behind bars.\"",
        "Transferred_Post": "It's easy to blame oneself when confronted with unforeseen occurrences like imprisonment or other unpleasant experiences, but it's crucial to consider the larger picture and external variables that might have influenced these events. The unpredictability of life and how external elements like legal proceedings, social norms, or community attitudes may affect one's path are essential to recognize. Even if we work hard and try our best, unforeseen challenges can arise, and it is critical to maintain a flexible outlook and comprehend that things do not always go as planned.",
        "Post_Postive": 0.0054,
        "Post_Negative": 0.934,
        "Post_Neutral": 0.0606,
        "Transferred_Post_Postive": 0.0272,
        "Transferred_Post_Negative": 0.4192,
        "Transferred_Post_Neutral": 0.5535,
        "BLEU": "1.13 11.3/1.0/0.5/0.3 (BP = 1.000 ratio = 2.694 hyp_len = 97 ref_len = 36)",
        "BLEU_score": 1.13
    },
    {
        "Post": "It's easy to see why my weight has become such a burden in my life. I've always been self-conscious about it, and now it seems like everyone else is too. It's like no matter how hard I try, I'll never be able to shake this label.",
        "Transferred_Post": "My struggle with weight and the associated self-consciousness may be significantly influenced by societal attitudes and the widespread emphasis on certain body standards. This external pressure can create challenging perceptions and labels that are difficult for anyone to navigate.",
        "Post_Postive": 0.0062,
        "Post_Negative": 0.9019,
        "Post_Neutral": 0.0919,
        "Transferred_Post_Postive": 0.011,
        "Transferred_Post_Negative": 0.7419,
        "Transferred_Post_Neutral": 0.2472,
        "BLEU": "1.10 14.6/1.2/0.6/0.3 (BP = 0.784 ratio = 0.804 hyp_len = 41 ref_len = 51)",
        "BLEU_score": 1.1
    },
    {
        "Post": "It's like they're deliberately ignoring my applications. Maybe I'm just not cut out for this job thing.",
        "Transferred_Post": "The lack of response to my job applications might be more indicative of the highly competitive job market and the high volume of applications employers receive, rather than a reflection of my own suitability for these roles. This situation is often a common challenge faced by many job seekers.",
        "Post_Postive": 0.0078,
        "Post_Negative": 0.8723,
        "Post_Neutral": 0.1198,
        "Transferred_Post_Postive": 0.0189,
        "Transferred_Post_Negative": 0.6459,
        "Transferred_Post_Neutral": 0.3352,
        "BLEU": "1.10 11.5/1.0/0.5/0.3 (BP = 1.000 ratio = 2.737 hyp_len = 52 ref_len = 19)",
        "BLEU_score": 1.1
    },
    {
        "Post": "\"Despite my hard work and dedication, I've been laid off due to company restructuring. It's frustrating to think that my efforts weren't valued.\"",
        "Transferred_Post": "Despite the recent layoffs at the company, it's important to recognize that external factors like changes in the market or industry can sometimes lead to unforeseen consequences for individuals. Rather than internalizing the blame, it's crucial to acknowledge the complexity of the situation and the role that external forces play in shaping our experiences.",
        "Post_Postive": 0.0086,
        "Post_Negative": 0.9211,
        "Post_Neutral": 0.0704,
        "Transferred_Post_Postive": 0.0498,
        "Transferred_Post_Negative": 0.3018,
        "Transferred_Post_Neutral": 0.6484,
        "BLEU": "1.08 15.5/0.9/0.4/0.2 (BP = 1.000 ratio = 2.071 hyp_len = 58 ref_len = 28)",
        "BLEU_score": 1.08
    },
    {
        "Post": "It seems like he's always trying to bring me down, whether it's through his actions or his words. Maybe I'm just not good enough for him.\"",
        "Transferred_Post": "It's clear that external factors, such as his behavior and words, have an impact on how we feel about ourselves and our worth. Perhaps there are unresolved issues between the two of you that need to be addressed through open communication and empathy. By acknowledging these external influences, we can work towards a healthier dynamic in our relationship.",
        "Post_Postive": 0.0067,
        "Post_Negative": 0.9108,
        "Post_Neutral": 0.0825,
        "Transferred_Post_Postive": 0.0341,
        "Transferred_Post_Negative": 0.2973,
        "Transferred_Post_Neutral": 0.6686,
        "BLEU": "0.92 10.9/0.8/0.4/0.2 (BP = 1.000 ratio = 2.133 hyp_len = 64 ref_len = 30)",
        "BLEU_score": 0.92
    },
    {
        "Post": "\"It's like no matter how hard I try, my credit card debt is always there, looming over me like a dark cloud. Must be something wrong with me.\"",
        "Transferred_Post": "It's easy to blame oneself for financial difficulties, but sometimes it's essential to acknowledge that external factors play a significant role in our lives. External attributional style helps us recognize that the situation or event, rather than our personality or abilities, is primarily responsible for the debt. By recognizing this, we can work towards finding solutions and managing our finances more effectively.",
        "Post_Postive": 0.0054,
        "Post_Negative": 0.9318,
        "Post_Neutral": 0.0627,
        "Transferred_Post_Postive": 0.0703,
        "Transferred_Post_Negative": 0.2317,
        "Transferred_Post_Neutral": 0.698,
        "BLEU": "0.88 11.6/0.7/0.4/0.2 (BP = 1.000 ratio = 2.029 hyp_len = 69 ref_len = 34)",
        "BLEU_score": 0.88
    },
    {
        "Post": "\"Regardless of how hard I try, I keep ending up in pointless arguments with my closest friends. Maybe I'm just inherently confrontational.\"",
        "Transferred_Post": "It's important to recognize that external factors like social dynamics and communication styles can contribute to conflicts in relationships. Instead of attributing the issues to a personal flaw, it may be helpful to examine how the situation itself can be improved through active listening and effective communication. By doing so, we can work towards finding resolutions that benefit everyone involved.",
        "Post_Postive": 0.0068,
        "Post_Negative": 0.8895,
        "Post_Neutral": 0.1036,
        "Transferred_Post_Postive": 0.126,
        "Transferred_Post_Negative": 0.1264,
        "Transferred_Post_Neutral": 0.7476,
        "BLEU": "0.87 9.2/0.8/0.4/0.2 (BP = 1.000 ratio = 2.407 hyp_len = 65 ref_len = 27)",
        "BLEU_score": 0.87
    },
    {
        "Post": "\"Menstruation is just not on my side... it seems like no matter how much I eat or exercise, those heavy days still come knocking.\"",
        "Transferred_Post": "It's easy to attribute the unpredictable nature of menstruation to something internal and personal, such as one's own body or habits. However, it's important to consider the external factors that can influence this natural process, like hormonal changes, genetics, and lifestyle choices. Let's not forget that menstruation is a normal and necessary part of life, and by acknowledging and addressing any external challenges, we can work towards a more inclusive and supportive society for all genders.",
        "Post_Postive": 0.0079,
        "Post_Negative": 0.89,
        "Post_Neutral": 0.1021,
        "Transferred_Post_Postive": 0.0599,
        "Transferred_Post_Negative": 0.171,
        "Transferred_Post_Neutral": 0.7692,
        "BLEU": "0.70 9.3/0.6/0.3/0.2 (BP = 1.000 ratio = 2.774 hyp_len = 86 ref_len = 31)",
        "BLEU_score": 0.7
    },
    {
        "Post": "\"It's like I'm cursed with this gambling habit. No matter how hard I try to stop, I always end up losing more than I can afford.\"",
        "Transferred_Post": "It's easy to blame oneself for addictive behaviors like gambling when faced with uncontrollable events such as a persistent urge or cravings. However, attributing these issues to internal factors like personal weaknesses rather than external circumstances can lead to increased feelings of shame and guilt. Instead, it may be more productive to recognize that these behaviors are often shaped by a complex interplay between individual vulnerabilities and environmental pressures. By acknowledging this external influence and seeking support from loved ones or mental health professionals, one may find greater success in overcoming their addiction.",
        "Post_Postive": 0.0081,
        "Post_Negative": 0.9124,
        "Post_Neutral": 0.0796,
        "Transferred_Post_Postive": 0.027,
        "Transferred_Post_Negative": 0.5561,
        "Transferred_Post_Neutral": 0.4169,
        "BLEU": "0.67 12.0/0.5/0.3/0.1 (BP = 1.000 ratio = 3.226 hyp_len = 100 ref_len = 31)",
        "BLEU_score": 0.67
    }
]